Repository: minios-linux/lokit
Catalog: po/*.po
Languages: ar, de, es, fr, it, ja, pl, pt_br, ru, tr, uk

source: Translate files using AI providers. Supports gettext PO, po4a, i18next JSON, Android strings.xml, generic JSON, YAML, Markdown, Java .properties, and Flutter ARB formats. Project type is auto-detected or configured via lokit.yaml. For gettext/po4a projects, automatically initializes if needed (extracts strings, creates PO files). Requires --provider and --model flags. Incremental translation: lokit tracks source string checksums in lokit.lock. Only new or changed strings are sent to the AI provider, saving tokens and time. Use --force to ignore the lock file and re-translate everything. Key filtering: configure per-target in lokit.yaml: ignored_keys — keys excluded from translation entirely (never sent to AI) locked_keys — keys whose translations are preserved (skipped even with --retranslate; only --force overrides) locked_patterns — regex patterns matching keys treated as locked (e.g. "^brand_.*" locks all brand_ prefixed keys) Each target type has a built-in system prompt optimized for its format. Use the --prompt flag to override it for the current run, or set prompt: in lokit.yaml target config for a permanent override. Use {{targetLang}} as a placeholder for the target language name. Examples: # Translate a gettext project using GitHub Copilot (free) lokit translate --provider copilot --model gpt-4o # Translate an Android project using Gemini (free, OAuth) lokit translate --provider gemini --model gemini-2.5-flash # Translate an i18next project using Google AI (API key) lokit translate --provider google --model gemini-2.5-flash # Translate specific languages in parallel lokit translate --provider copilot --model gpt-4o --lang ru,de --parallel # Force full re-translation (ignore lock file) lokit translate --provider copilot --model gpt-4o --force # Re-translate everything with a custom prompt lokit translate --provider copilot --model gpt-4o --retranslate \ --prompt "Translate to {{targetLang}}. Use informal tone." # Translate a Flutter project lokit translate --provider copilot --model gpt-4o # Dry run (show what would be translated) lokit translate --provider copilot --model gpt-4o --dry-run
ar: ترجمة الملفات باستخدام مزودي الذكاء الاصطناعي. يدعم تنسيقات gettext PO، po4a، i18next JSON، Android strings.xml، JSON العام، YAML، Markdown، Java .properties، وFlutter ARB. يتم اكتشاف نوع المشروع تلقائيًا أو تكوينه عبر lokit.yaml. بالنسبة لمشاريع gettext/po4a، يتم التهيئة تلقائيًا إذا لزم الأمر (استخراج النصوص، إنشاء ملفات PO). يتطلب استخدام العلامتين --provider و--model. الترجمة التزايدية: يقوم lokit بتتبع تجزئة النصوص المصدرية في lokit.lock. يتم إرسال النصوص الجديدة أو المعدلة فقط إلى مزود الذكاء الاصطناعي، مما يوفر الرموز والوقت. استخدم --force لتجاهل ملف القفل وإعادة ترجمة كل شيء. تصفية المفاتيح: يمكن تكوينها لكل هدف في lokit.yaml: ignored_keys — المفاتيح المستبعدة من الترجمة تمامًا (لا تُرسل أبدًا إلى الذكاء الاصطناعي) locked_keys — المفاتيح التي تُحفظ ترجماتها (تُتخطى حتى مع --retranslate؛ فقط --force يتجاوزها) locked_patterns — أنماط regex التي تطابق المفاتيح المعاملة كمقفلة (مثل "^brand_.*" لقفل جميع المفاتيح التي تبدأ بـ brand_) لكل نوع هدف يوجد موجه نظام مدمج محسّن لتنسيقه. استخدم العلامة --prompt لتجاوز ذلك أثناء التشغيل الحالي، أو قم بتعيين prompt: في تكوين هدف lokit.yaml لتجاوز دائم. استخدم {{targetLang}} كعنصر نائب لاسم اللغة الهدف. أمثلة: # ترجمة مشروع gettext باستخدام GitHub Copilot (مجاني) lokit translate --provider copilot --model gpt-4o # ترجمة مشروع Android باستخدام Gemini (مجاني، OAuth) lokit translate --provider gemini --model gemini-2.5-flash # ترجمة مشروع i18next باستخدام Google AI (مفتاح API) lokit translate --provider google --model gemini-2.5-flash # ترجمة لغات محددة بالتوازي lokit translate --provider copilot --model gpt-4o --lang ru,de --parallel # فرض إعادة الترجمة الكاملة (تجاهل ملف القفل) lokit translate --provider copilot --model gpt-4o --force # إعادة ترجمة كل شيء بموجه مخصص lokit translate --provider copilot --model gpt-4o --retranslate \ --prompt "ترجم إلى {{targetLang}}. استخدم نبرة غير رسمية." # ترجمة مشروع Flutter lokit translate --provider copilot --model gpt-4o # تشغيل تجريبي (عرض ما سيتم ترجمته) lokit translate --provider copilot --model gpt-4o --dry-run
de: Übersetzen Sie Dateien mit KI-Anbietern. Unterstützt gettext PO, po4a, i18next JSON, Android strings.xml, generisches JSON, YAML, Markdown, Java .properties und Flutter ARB-Formate. Der Projekttyp wird automatisch erkannt oder über lokit.yaml konfiguriert. Für gettext/po4a-Projekte wird bei Bedarf automatisch initialisiert (Extrahieren von Strings, Erstellen von PO-Dateien). Erfordert die Flags --provider und --model. Inkrementelle Übersetzung: lokit verfolgt Prüfsummen der Quellstrings in lokit.lock. Nur neue oder geänderte Strings werden an den KI-Anbieter gesendet, was Tokens und Zeit spart. Verwenden Sie --force, um die Lock-Datei zu ignorieren und alles neu zu übersetzen. Schlüssel-Filterung: Konfigurieren Sie dies pro Ziel in lokit.yaml: ignored_keys — Schlüssel, die vollständig von der Übersetzung ausgeschlossen werden (niemals an KI gesendet) locked_keys — Schlüssel, deren Übersetzungen beibehalten werden (werden auch mit --retranslate übersprungen; nur --force überschreibt dies) locked_patterns — Regex-Muster, die auf Schlüssel angewendet werden, die als gesperrt behandelt werden (z. B. sperrt "^brand_.*" alle Schlüssel mit dem Präfix brand_) Jeder Zieltyp hat eine integrierte Systemaufforderung, die für sein Format optimiert ist. Verwenden Sie das Flag --prompt, um diese für den aktuellen Durchlauf zu überschreiben, oder setzen Sie prompt: in der lokit.yaml-Zielkonfiguration für eine dauerhafte Überschreibung. Verwenden Sie {{targetLang}} als Platzhalter für den Namen der Zielsprache. Beispiele: # Übersetzen eines gettext-Projekts mit GitHub Copilot (kostenlos) lokit translate --provider copilot --model gpt-4o # Übersetzen eines Android-Projekts mit Gemini (kostenlos, OAuth) lokit translate --provider gemini --model gemini-2.5-flash # Übersetzen eines i18next-Projekts mit Google AI (API-Schlüssel) lokit translate --provider google --model gemini-2.5-flash # Bestimmte Sprachen parallel übersetzen lokit translate --provider copilot --model gpt-4o --lang ru,de --parallel # Vollständige Neuübersetzung erzwingen (Lock-Datei ignorieren) lokit translate --provider copilot --model gpt-4o --force # Alles neu übersetzen mit einer benutzerdefinierten Aufforderung lokit translate --provider copilot --model gpt-4o --retranslate \ --prompt "Übersetzen Sie in {{targetLang}}. Verwenden Sie einen informellen Ton." # Übersetzen eines Flutter-Projekts lokit translate --provider copilot --model gpt-4o # Testlauf (zeigt, was übersetzt würde) lokit translate --provider copilot --model gpt-4o --dry-run
es: Traduce archivos utilizando proveedores de IA. Compatible con los formatos gettext PO, po4a, i18next JSON, Android strings.xml, JSON genérico, YAML, Markdown, Java .properties y Flutter ARB. El tipo de proyecto se detecta automáticamente o se configura mediante lokit.yaml. Para proyectos gettext/po4a, se inicializa automáticamente si es necesario (extrae cadenas, crea archivos PO). Requiere las banderas --provider y --model. Traducción incremental: lokit rastrea los checksums de las cadenas fuente en lokit.lock. Solo se envían al proveedor de IA las cadenas nuevas o modificadas, ahorrando tokens y tiempo. Usa --force para ignorar el archivo de bloqueo y volver a traducir todo. Filtrado de claves: configura por destino en lokit.yaml: ignored_keys — claves excluidas completamente de la traducción (nunca se envían a la IA) locked_keys — claves cuyas traducciones se preservan (omitidas incluso con --retranslate; solo --force las sobrescribe) locked_patterns — patrones regex que coinciden con claves tratadas como bloqueadas (por ejemplo, "^brand_.*" bloquea todas las claves con el prefijo brand_) Cada tipo de destino tiene un mensaje del sistema integrado optimizado para su formato. Usa la bandera --prompt para sobrescribirlo en la ejecución actual, o configura prompt: en la configuración del destino en lokit.yaml para un sobrescribirlo permanentemente. Usa {{targetLang}} como marcador de posición para el nombre del idioma de destino. Ejemplos: # Traducir un proyecto gettext usando GitHub Copilot (gratis) lokit translate --provider copilot --model gpt-4o # Traducir un proyecto Android usando Gemini (gratis, OAuth) lokit translate --provider gemini --model gemini-2.5-flash # Traducir un proyecto i18next usando Google AI (clave API) lokit translate --provider google --model gemini-2.5-flash # Traducir idiomas específicos en paralelo lokit translate --provider copilot --model gpt-4o --lang ru,de --parallel # Forzar la re-traducción completa (ignorar archivo de bloqueo) lokit translate --provider copilot --model gpt-4o --force # Re-traducir todo con un mensaje personalizado lokit translate --provider copilot --model gpt-4o --retranslate \ --prompt "Traduce a {{targetLang}}. Usa un tono informal." # Traducir un proyecto Flutter lokit translate --provider copilot --model gpt-4o # Simulación (muestra lo que se traduciría) lokit translate --provider copilot --model gpt-4o --dry-run
fr: Traduisez des fichiers à l'aide de fournisseurs d'IA. Prend en charge les formats gettext PO, po4a, i18next JSON, Android strings.xml, JSON générique, YAML, Markdown, Java .properties et Flutter ARB. Le type de projet est auto-détecté ou configuré via lokit.yaml. Pour les projets gettext/po4a, une initialisation automatique est effectuée si nécessaire (extraction des chaînes, création des fichiers PO). Nécessite les options --provider et --model. Traduction incrémentielle : lokit suit les sommes de contrôle des chaînes sources dans lokit.lock. Seules les chaînes nouvelles ou modifiées sont envoyées au fournisseur d'IA, économisant des jetons et du temps. Utilisez --force pour ignorer le fichier de verrouillage et tout retraduire. Filtrage des clés : configurez par cible dans lokit.yaml : ignored_keys — clés exclues entièrement de la traduction (jamais envoyées à l'IA) locked_keys — clés dont les traductions sont préservées (ignorées même avec --retranslate ; seul --force les remplace) locked_patterns — motifs regex correspondant aux clés traitées comme verrouillées (par exemple, "^brand_.*" verrouille toutes les clés préfixées par brand_) Chaque type de cible dispose d'une invite système intégrée optimisée pour son format. Utilisez l'option --prompt pour la remplacer lors de l'exécution actuelle, ou définissez prompt : dans la configuration de la cible dans lokit.yaml pour un remplacement permanent. Utilisez {{targetLang}} comme espace réservé pour le nom de la langue cible. Exemples : # Traduire un projet gettext avec GitHub Copilot (gratuit) lokit translate --provider copilot --model gpt-4o # Traduire un projet Android avec Gemini (gratuit, OAuth) lokit translate --provider gemini --model gemini-2.5-flash # Traduire un projet i18next avec Google AI (clé API) lokit translate --provider google --model gemini-2.5-flash # Traduire des langues spécifiques en parallèle lokit translate --provider copilot --model gpt-4o --lang ru,de --parallel # Forcer une retraduction complète (ignorer le fichier de verrouillage) lokit translate --provider copilot --model gpt-4o --force # Retraduire tout avec une invite personnalisée lokit translate --provider copilot --model gpt-4o --retranslate \n --prompt "Traduire en {{targetLang}}. Utiliser un ton informel." # Traduire un projet Flutter lokit translate --provider copilot --model gpt-4o # Simulation (afficher ce qui serait traduit) lokit translate --provider copilot --model gpt-4o --dry-run
it: Traduci i file utilizzando fornitori di AI. Supporta i formati gettext PO, po4a, i18next JSON, Android strings.xml, JSON generico, YAML, Markdown, Java .properties e Flutter ARB. Il tipo di progetto viene autodetectato o configurato tramite lokit.yaml. Per i progetti gettext/po4a, inizializza automaticamente se necessario (estrae le stringhe, crea i file PO). Richiede i flag --provider e --model. Traduzione incrementale: lokit traccia i checksum delle stringhe sorgente in lokit.lock. Solo le stringhe nuove o modificate vengono inviate al fornitore di AI, risparmiando token e tempo. Usa --force per ignorare il file di lock e ritradurre tutto. Filtraggio delle chiavi: configura per ogni target in lokit.yaml: ignored_keys — chiavi escluse completamente dalla traduzione (mai inviate all'AI) locked_keys — chiavi le cui traduzioni sono preservate (saltate anche con --retranslate; solo --force le sovrascrive) locked_patterns — pattern regex che corrispondono a chiavi trattate come bloccate (es. "^brand_.*" blocca tutte le chiavi con prefisso brand_) Ogni tipo di target ha un prompt di sistema integrato ottimizzato per il suo formato. Usa il flag --prompt per sovrascriverlo per l'esecuzione corrente, oppure imposta prompt: nella configurazione del target in lokit.yaml per una sovrascrittura permanente. Usa {{targetLang}} come segnaposto per il nome della lingua di destinazione. Esempi: # Traduci un progetto gettext utilizzando GitHub Copilot (gratuito) lokit translate --provider copilot --model gpt-4o # Traduci un progetto Android utilizzando Gemini (gratuito, OAuth) lokit translate --provider gemini --model gemini-2.5-flash # Traduci un progetto i18next utilizzando Google AI (API key) lokit translate --provider google --model gemini-2.5-flash # Traduci lingue specifiche in parallelo lokit translate --provider copilot --model gpt-4o --lang ru,de --parallel # Forza una ritraduzione completa (ignora il file di lock) lokit translate --provider copilot --model gpt-4o --force # Ritraduci tutto con un prompt personalizzato lokit translate --provider copilot --model gpt-4o --retranslate \n --prompt "Traduci in {{targetLang}}. Usa un tono informale." # Traduci un progetto Flutter lokit translate --provider copilot --model gpt-4o # Simulazione (mostra cosa verrebbe tradotto) lokit translate --provider copilot --model gpt-4o --dry-run
ja: AIプロバイダーを使用してファイルを翻訳します。 gettext PO、po4a、i18next JSON、Android strings.xml、汎用JSON、 YAML、Markdown、Java .properties、Flutter ARB形式をサポート。 プロジェクトタイプは自動検出されるか、lokit.yamlで設定可能です。 gettext/po4aプロジェクトの場合、必要に応じて自動初期化を実行します （文字列を抽出し、POファイルを作成）。--providerおよび--modelフラグが必要です。 インクリメンタル翻訳: lokitはlokit.lockでソース文字列のチェックサムを追跡します。 新規または変更された文字列のみがAIプロバイダーに送信され、トークンと時間を節約します。 --forceを使用すると、ロックファイルを無視してすべてを再翻訳できます。 キーのフィルタリング: lokit.yamlでターゲットごとに設定可能: ignored_keys — 完全に翻訳から除外されるキー（AIに送信されない） locked_keys — 翻訳が保持されるキー（--retranslateでもスキップされ、 --forceのみで上書き可能） locked_patterns — ロックとして扱われるキーに一致する正規表現パターン （例: "^brand_.*" はすべてのbrand_プレフィックス付きキーをロック） 各ターゲットタイプには、その形式に最適化された組み込みシステムプロンプトがあります。 --promptフラグを使用して現在の実行で上書きするか、lokit.yamlのターゲット設定で prompt: を設定して永続的に上書きできます。 {{targetLang}}をターゲット言語名のプレースホルダーとして使用します。 例: # GitHub Copilot（無料）を使用してgettextプロジェクトを翻訳 lokit translate --provider copilot --model gpt-4o # Gemini（無料、OAuth）を使用してAndroidプロジェクトを翻訳 lokit translate --provider gemini --model gemini-2.5-flash # Google AI（APIキー）を使用してi18nextプロジェクトを翻訳 lokit translate --provider google --model gemini-2.5-flash # 特定の言語を並列で翻訳 lokit translate --provider copilot --model gpt-4o --lang ru,de --parallel # フル再翻訳を強制（ロックファイルを無視） lokit translate --provider copilot --model gpt-4o --force # カスタムプロンプトで全てを再翻訳 lokit translate --provider copilot --model gpt-4o --retranslate \ --prompt "{{targetLang}}に翻訳してください。カジュアルな口調を使用。" # Flutterプロジェクトを翻訳 lokit translate --provider copilot --model gpt-4o # ドライラン（翻訳対象を表示） lokit translate --provider copilot --model gpt-4o --dry-run
pl: Tłumacz pliki za pomocą dostawców AI. Obsługuje formaty gettext PO, po4a, i18next JSON, Android strings.xml, generic JSON, YAML, Markdown, Java .properties oraz Flutter ARB. Typ projektu jest automatycznie wykrywany lub konfigurowany w lokit.yaml. Dla projektów gettext/po4a automatycznie inicjalizuje, jeśli to konieczne (ekstrakcja ciągów, tworzenie plików PO). Wymaga flag --provider i --model. Tłumaczenie przyrostowe: lokit śledzi sumy kontrolne ciągów źródłowych w lokit.lock. Do dostawcy AI wysyłane są tylko nowe lub zmienione ciągi, co oszczędza tokeny i czas. Użyj --force, aby zignorować plik blokady i przetłumaczyć wszystko od nowa. Filtrowanie kluczy: konfiguracja dla każdego celu w lokit.yaml: ignored_keys — klucze całkowicie wykluczone z tłumaczenia (nigdy nie wysyłane do AI) locked_keys — klucze, których tłumaczenia są zachowywane (pomijane nawet przy --retranslate; tylko --force je nadpisuje) locked_patterns — wzorce regex dopasowujące klucze traktowane jako zablokowane (np. "^brand_.*" blokuje wszystkie klucze z prefiksem brand_) Każdy typ celu ma wbudowaną podpowiedź systemową zoptymalizowaną dla swojego formatu. Użyj flagi --prompt, aby ją nadpisać dla bieżącego uruchomienia, lub ustaw prompt: w konfiguracji celu w lokit.yaml, aby zmienić ją na stałe. Użyj {{targetLang}} jako symbolu zastępczego dla nazwy języka docelowego. Przykłady: # Tłumaczenie projektu gettext za pomocą GitHub Copilot (darmowe) lokit translate --provider copilot --model gpt-4o # Tłumaczenie projektu Android za pomocą Gemini (darmowe, OAuth) lokit translate --provider gemini --model gemini-2.5-flash # Tłumaczenie projektu i18next za pomocą Google AI (klucz API) lokit translate --provider google --model gemini-2.5-flash # Tłumaczenie konkretnych języków równolegle lokit translate --provider copilot --model gpt-4o --lang ru,de --parallel # Wymuszenie pełnego tłumaczenia (ignorowanie pliku blokady) lokit translate --provider copilot --model gpt-4o --force # Ponowne tłumaczenie wszystkiego z niestandardową podpowiedzią lokit translate --provider copilot --model gpt-4o --retranslate \n --prompt "Translate to {{targetLang}}. Use informal tone." # Tłumaczenie projektu Flutter lokit translate --provider copilot --model gpt-4o # Suchy przebieg (pokaż, co zostanie przetłumaczone) lokit translate --provider copilot --model gpt-4o --dry-run
pt_br: Traduza arquivos usando provedores de IA. Suporta os formatos gettext PO, po4a, i18next JSON, Android strings.xml, JSON genérico, YAML, Markdown, Java .properties e Flutter ARB. O tipo de projeto é autodetectado ou configurado via lokit.yaml. Para projetos gettext/po4a, inicializa automaticamente se necessário (extrai strings, cria arquivos PO). Requer as flags --provider e --model. Tradução incremental: o lokit rastreia checksums das strings de origem no lokit.lock. Apenas strings novas ou alteradas são enviadas ao provedor de IA, economizando tokens e tempo. Use --force para ignorar o arquivo de lock e retraduzir tudo. Filtragem de chaves: configure por destino no lokit.yaml: ignored_keys — chaves totalmente excluídas da tradução (nunca enviadas para a IA) locked_keys — chaves cujas traduções são preservadas (ignoradas mesmo com --retranslate; apenas --force sobrescreve) locked_patterns — padrões regex que correspondem a chaves tratadas como bloqueadas (ex.: "^brand_.*" bloqueia todas as chaves com prefixo brand_) Cada tipo de destino possui um prompt de sistema embutido otimizado para seu formato. Use a flag --prompt para sobrescrevê-lo na execução atual ou configure prompt: no destino do lokit.yaml para uma sobrescrita permanente. Use {{targetLang}} como placeholder para o nome do idioma de destino. Exemplos: # Traduza um projeto gettext usando o GitHub Copilot (gratuito) lokit translate --provider copilot --model gpt-4o # Traduza um projeto Android usando o Gemini (gratuito, OAuth) lokit translate --provider gemini --model gemini-2.5-flash # Traduza um projeto i18next usando o Google AI (chave de API) lokit translate --provider google --model gemini-2.5-flash # Traduza idiomas específicos em paralelo lokit translate --provider copilot --model gpt-4o --lang ru,de --parallel # Forçar retradução completa (ignorar arquivo de lock) lokit translate --provider copilot --model gpt-4o --force # Retraduzir tudo com um prompt personalizado lokit translate --provider copilot --model gpt-4o --retranslate \n --prompt "Traduza para {{targetLang}}. Use um tom informal." # Traduza um projeto Flutter lokit translate --provider copilot --model gpt-4o # Simulação (mostra o que seria traduzido) lokit translate --provider copilot --model gpt-4o --dry-run
ru: Перевод файлов с использованием AI-провайдеров. Поддерживаются форматы gettext PO, po4a, i18next JSON, Android strings.xml, generic JSON, YAML, Markdown, Java .properties и Flutter ARB. Тип проекта определяется автоматически или настраивается через lokit.yaml. Для проектов gettext/po4a выполняется автоматическая инициализация при необходимости (извлечение строк, создание PO-файлов). Требуются флаги --provider и --model. Инкрементальный перевод: lokit отслеживает контрольные суммы исходных строк в lokit.lock. Только новые или изменённые строки отправляются AI-провайдеру, что экономит токены и время. Используйте --force, чтобы игнорировать файл блокировки и перевести всё заново. Фильтрация ключей: настройка для каждой цели в lokit.yaml: ignored_keys — ключи, исключённые из перевода полностью (никогда не отправляются AI) locked_keys — ключи, переводы которых сохраняются (пропускаются даже с --retranslate; только --force переопределяет) locked_patterns — регулярные выражения для ключей, которые считаются заблокированными (например, "^brand_.*" блокирует все ключи с префиксом brand_) Для каждого типа цели используется встроенная системная подсказка, оптимизированная под формат. Используйте флаг --prompt, чтобы переопределить её для текущего запуска, или задайте prompt: в конфигурации цели в lokit.yaml для постоянного переопределения. Используйте {{targetLang}} как шаблон для названия целевого языка. Примеры: # Перевод проекта gettext с использованием GitHub Copilot (бесплатно) lokit translate --provider copilot --model gpt-4o # Перевод Android-проекта через Gemini (бесплатно, OAuth) lokit translate --provider gemini --model gemini-2.5-flash # Перевод проекта i18next с использованием Google AI (API-ключ) lokit translate --provider google --model gemini-2.5-flash # Перевод конкретных языков параллельно lokit translate --provider copilot --model gpt-4o --lang ru,de --parallel # Принудительный полный перевод (игнорировать файл блокировки) lokit translate --provider copilot --model gpt-4o --force # Перевод всего с пользовательской подсказкой lokit translate --provider copilot --model gpt-4o --retranslate \ --prompt "Перевести на {{targetLang}}. Использовать неформальный тон." # Перевод проекта Flutter lokit translate --provider copilot --model gpt-4o # Пробный запуск (показать, что будет переведено) lokit translate --provider copilot --model gpt-4o --dry-run
tr: Dosyaları AI sağlayıcıları kullanarak çevirin. gettext PO, po4a, i18next JSON, Android strings.xml, genel JSON, YAML, Markdown, Java .properties ve Flutter ARB formatlarını destekler. Proje türü otomatik olarak algılanır veya lokit.yaml üzerinden yapılandırılır. gettext/po4a projeleri için, gerekirse otomatik olarak başlatılır (metinleri çıkarır, PO dosyalarını oluşturur). --provider ve --model bayrakları gereklidir. Artımlı çeviri: lokit, kaynak metinlerin sağlama toplamlarını lokit.lock dosyasına kaydeder. Sadece yeni veya değişen metinler AI sağlayıcısına gönderilir, böylece token ve zaman tasarrufu sağlanır. --force bayrağını kullanarak kilit dosyasını yok sayabilir ve her şeyi yeniden çevirebilirsiniz. Anahtar filtreleme: lokit.yaml'de hedef başına yapılandırılabilir: ignored_keys — tamamen çeviri dışı bırakılacak anahtarlar (AI'ye asla gönderilmez) locked_keys — çevirileri korunan anahtarlar (--retranslate ile bile atlanır; sadece --force ile geçersiz kılınır) locked_patterns — kilitli olarak işlenecek anahtarları eşleyen regex desenleri (ör. "^brand_.*" tüm brand_ ile başlayan anahtarları kilitler) Her hedef türü için formatına optimize edilmiş yerleşik bir sistem istemi vardır. Geçerli çalıştırma için bunu geçersiz kılmak için --prompt bayrağını kullanın veya kalıcı bir geçersiz kılma için lokit.yaml hedef yapılandırmasında prompt: ayarını yapın. Hedef dil adı için {{targetLang}} yer tutucusunu kullanın. Örnekler: # GitHub Copilot (ücretsiz) kullanarak bir gettext projesini çevirin lokit translate --provider copilot --model gpt-4o # Gemini (ücretsiz, OAuth) kullanarak bir Android projesini çevirin lokit translate --provider gemini --model gemini-2.5-flash # Google AI (API anahtarı) kullanarak bir i18next projesini çevirin lokit translate --provider google --model gemini-2.5-flash # Belirli dilleri paralel olarak çevirin lokit translate --provider copilot --model gpt-4o --lang ru,de --parallel # Tam yeniden çevirme zorla (kilit dosyasını yok say) lokit translate --provider copilot --model gpt-4o --force # Özel bir istemle her şeyi yeniden çevirin lokit translate --provider copilot --model gpt-4o --retranslate \ --prompt "{{targetLang}} diline çevir. Samimi bir ton kullan." # Bir Flutter projesini çevirin lokit translate --provider copilot --model gpt-4o # Kuru çalıştırma (ne çevrileceğini göster) lokit translate --provider copilot --model gpt-4o --dry-run
uk: Переклад файлів за допомогою AI-провайдерів. Підтримуються формати gettext PO, po4a, i18next JSON, Android strings.xml, загальний JSON, YAML, Markdown, Java .properties та Flutter ARB. Тип проєкту визначається автоматично або налаштовується через lokit.yaml. Для проєктів gettext/po4a автоматично виконується ініціалізація за потреби (екстракція рядків, створення PO-файлів). Вимагає прапорці --provider та --model. Інкрементний переклад: lokit відстежує контрольні суми вихідних рядків у lokit.lock. Тільки нові або змінені рядки надсилаються до AI-провайдера, що економить токени та час. Використовуйте --force, щоб ігнорувати файл блокування та перекласти все заново. Фільтрація ключів: налаштовується для кожної цілі в lokit.yaml: ignored_keys — ключі, які повністю виключаються з перекладу (ніколи не надсилаються до AI) locked_keys — ключі, переклади яких зберігаються (пропускаються навіть із --retranslate; лише --force їх перевизначає) locked_patterns — регулярні вирази для ключів, які вважаються заблокованими (наприклад, "^brand_.*" блокує всі ключі з префіксом brand_) Кожен тип цілі має вбудовану системну підказку, оптимізовану для свого формату. Використовуйте прапорець --prompt, щоб перевизначити її для поточного запуску, або задайте prompt: у конфігурації цілі в lokit.yaml для постійного перевизначення. Використовуйте {{targetLang}} як заповнювач для назви цільової мови. Приклади: # Переклад проєкту gettext за допомогою GitHub Copilot (безкоштовно) lokit translate --provider copilot --model gpt-4o # Переклад проєкту Android за допомогою Gemini (безкоштовно, OAuth) lokit translate --provider gemini --model gemini-2.5-flash # Переклад проєкту i18next за допомогою Google AI (ключ API) lokit translate --provider google --model gemini-2.5-flash # Переклад конкретних мов паралельно lokit translate --provider copilot --model gpt-4o --lang ru,de --parallel # Повторний повний переклад (ігнорувати файл блокування) lokit translate --provider copilot --model gpt-4o --force # Повторний переклад із власною підказкою lokit translate --provider copilot --model gpt-4o --retranslate \n --prompt "Translate to {{targetLang}}. Use informal tone." # Переклад проєкту Flutter lokit translate --provider copilot --model gpt-4o # Сухий запуск (показати, що буде перекладено) lokit translate --provider copilot --model gpt-4o --dry-run
