Repository: minios-linux/lokit
Catalog: po/*.po
Languages: ar, de, es, fr, it, ja, pl, pt_br, ru, tr, uk

source: Extract translatable strings and create/update translation files. Requires a lokit.yaml configuration file in the project root. For gettext projects: runs xgettext to extract strings into a POT template, then creates or updates PO files for each language. For po4a projects: runs 'po4a --no-translations' to update templates. For i18next/json/yaml/properties/flutter projects: creates missing language files with empty translations. For android/markdown projects: no init step needed — use 'lokit translate' directly. This command is idempotent — safe to run multiple times. Existing translations are preserved when updating files. CONFIG FORMAT (lokit.yaml) source_lang: en # Source language (default: en) languages: [ru, de, fr, es, ...] # Target languages targets: - name: myproject # Display name type: gettext # Target type (see below) root: . # Working directory (default: .) # ... type-specific options TARGET TYPES gettext — Source code string extraction (shell, python, C, Go, etc.) dir: po # PO files directory (required) pot_file: po/messages.pot # POT template path sources: [src, scripts] # Directories to scan (default: root) keywords: [_, N_, gettext] # xgettext keywords (default: standard set) po4a — Documentation translation (man pages, AsciiDoc, etc.) po4a_config: po4a.cfg # Path to po4a.cfg (default: po4a.cfg) i18next — i18next JSON translations dir: public/translations # JSON files directory (required) json — Simple JSON translations { "key": "value" } dir: translations # JSON files directory (required) android — Android strings.xml dir: app/src/main/res # Android res/ directory (required) yaml — YAML key/value translations dir: translations # YAML files directory (required) markdown — Markdown document translation dir: translations # Root dir; files at translations/LANG/ (required) properties — Java .properties translations dir: translations # .properties files directory (required) flutter — Flutter ARB (Application Resource Bundle) dir: lib/l10n # ARB files directory (required) COMMON OPTIONS (all target types) languages: [ru, de] # Override global language list prompt: "Custom translation..." # Override AI translation prompt EXAMPLES # Shell scripts with gettext source_lang: en languages: [ru, de, fr] targets: - name: myapp type: gettext sources: [scripts, lib] keywords: [gettext, eval_gettext] # Go project with wrapper functions targets: - name: myapp type: gettext sources: [.] keywords: [T, N] # Documentation + code targets: - name: code type: gettext sources: [src] - name: docs type: po4a po4a_config: docs/po4a.cfg # i18next web application targets: - name: frontend type: i18next dir: public/translations # Flutter application targets: - name: app type: flutter dir: lib/l10n # Java application with .properties targets: - name: app type: properties dir: src/main/resources
ar: استخراج النصوص القابلة للترجمة وإنشاء/تحديث ملفات الترجمة. يتطلب ملف تكوين lokit.yaml في جذر المشروع. لمشاريع gettext: يتم تشغيل xgettext لاستخراج النصوص إلى قالب POT، ثم إنشاء أو تحديث ملفات PO لكل لغة. لمشاريع po4a: يتم تشغيل 'po4a --no-translations' لتحديث القوالب. لمشاريع i18next/json/yaml/properties/flutter: يتم إنشاء ملفات اللغات المفقودة مع ترجمات فارغة. لمشاريع android/markdown: لا حاجة إلى خطوة تهيئة — استخدم 'lokit translate' مباشرة. هذا الأمر يمكن تشغيله عدة مرات بأمان — يتم الحفاظ على الترجمات الحالية عند تحديث الملفات. صيغة التكوين (lokit.yaml) source_lang: en # لغة المصدر (الافتراضي: en) languages: [ru, de, fr, es, ...] # اللغات المستهدفة targets: - name: myproject # الاسم المعروض type: gettext # نوع الهدف (انظر أدناه) root: . # دليل العمل (الافتراضي: .) # ... خيارات خاصة بالنوع أنواع الأهداف gettext — استخراج النصوص من الشيفرة المصدرية (shell, python, C, Go, إلخ) dir: po # دليل ملفات PO (إلزامي) pot_file: po/messages.pot # مسار قالب POT sources: [src, scripts] # الأدلة المطلوب مسحها (الافتراضي: root) keywords: [_, N_, gettext] # كلمات xgettext المفتاحية (الافتراضي: مجموعة قياسية) po4a — ترجمة الوثائق (صفحات man، AsciiDoc، إلخ) po4a_config: po4a.cfg # مسار po4a.cfg (الافتراضي: po4a.cfg) i18next — ترجمات JSON باستخدام i18next dir: public/translations # دليل ملفات JSON (إلزامي) json — ترجمات JSON بسيطة { "key": "value" } dir: translations # دليل ملفات JSON (إلزامي) android — ملفات strings.xml لنظام Android dir: app/src/main/res # دليل res/ لنظام Android (إلزامي) yaml — ترجمات YAML بنمط المفتاح/القيمة dir: translations # دليل ملفات YAML (إلزامي) markdown — ترجمة مستندات Markdown dir: translations # الدليل الجذر؛ الملفات في translations/LANG/ (إلزامي) properties — ترجمات ملفات .properties الخاصة بجافا dir: translations # دليل ملفات .properties (إلزامي) flutter — ملفات ARB (حزمة موارد التطبيقات) الخاصة بـ Flutter dir: lib/l10n # دليل ملفات ARB (إلزامي) خيارات عامة (جميع أنواع الأهداف) languages: [ru, de] # تجاوز قائمة اللغات العامة prompt: "ترجمة مخصصة..." # تجاوز نص المطالبة للترجمة الآلية أمثلة # سكربتات Shell باستخدام gettext source_lang: en languages: [ru, de, fr] targets: - name: myapp type: gettext sources: [scripts, lib] keywords: [gettext, eval_gettext] # مشروع Go مع دوال مغلفة targets: - name: myapp type: gettext sources: [.] keywords: [T, N] # الوثائق + الشيفرة targets: - name: code type: gettext sources: [src] - name: docs type: po4a po4a_config: docs/po4a.cfg # تطبيق ويب i18next targets: - name: frontend type: i18next dir: public/translations # تطبيق Flutter targets: - name: app type: flutter dir: lib/l10n # تطبيق Java مع .properties targets: - name: app type: properties dir: src/main/resources
de: Extrahiert übersetzbare Zeichenketten und erstellt/aktualisiert Übersetzungsdateien. Erfordert eine lokit.yaml-Konfigurationsdatei im Projektstammverzeichnis. Für gettext-Projekte: Führt xgettext aus, um Zeichenketten in eine POT-Vorlage zu extrahieren, und erstellt oder aktualisiert anschließend PO-Dateien für jede Sprache. Für po4a-Projekte: Führt 'po4a --no-translations' aus, um Vorlagen zu aktualisieren. Für i18next/JSON/YAML/Properties/Flutter-Projekte: Erstellt fehlende Sprachdateien mit leeren Übersetzungen. Für Android/Markdown-Projekte: Kein Initialisierungsschritt erforderlich — verwenden Sie direkt 'lokit translate'. Dieser Befehl ist idempotent — sicher mehrfach ausführbar. Bestehende Übersetzungen bleiben beim Aktualisieren der Dateien erhalten. KONFIGURATIONSFORMAT (lokit.yaml) source_lang: en # Ausgangssprache (Standard: en) languages: [ru, de, fr, es, ...] # Zielsprachen targets: - name: myproject # Anzeigename type: gettext # Zieltyp (siehe unten) root: . # Arbeitsverzeichnis (Standard: .) # ... typspezifische Optionen ZIELTYPEN gettext — Extraktion von Zeichenketten aus Quellcode (Shell, Python, C, Go, etc.) dir: po # Verzeichnis für PO-Dateien (erforderlich) pot_file: po/messages.pot # Pfad zur POT-Vorlage sources: [src, scripts] # Zu durchsuchende Verzeichnisse (Standard: root) keywords: [_, N_, gettext] # xgettext-Schlüsselwörter (Standard: Standardsatz) po4a — Übersetzung von Dokumentationen (Manpages, AsciiDoc, etc.) po4a_config: po4a.cfg # Pfad zu po4a.cfg (Standard: po4a.cfg) i18next — i18next JSON-Übersetzungen dir: public/translations # Verzeichnis für JSON-Dateien (erforderlich) json — Einfache JSON-Übersetzungen { "key": "value" } dir: translations # Verzeichnis für JSON-Dateien (erforderlich) android — Android strings.xml dir: app/src/main/res # Android res/-Verzeichnis (erforderlich) yaml — YAML-Schlüssel/Wert-Übersetzungen dir: translations # Verzeichnis für YAML-Dateien (erforderlich) markdown — Übersetzung von Markdown-Dokumenten dir: translations # Stammverzeichnis; Dateien unter translations/LANG/ (erforderlich) properties — Java .properties-Übersetzungen dir: translations # Verzeichnis für .properties-Dateien (erforderlich) flutter — Flutter ARB (Application Resource Bundle) dir: lib/l10n # Verzeichnis für ARB-Dateien (erforderlich) ALLGEMEINE OPTIONEN (alle Zieltypen) languages: [ru, de] # Überschreibt die globale Sprachliste prompt: "Benutzerdefinierte Übersetzung..." # Überschreibt den KI-Übersetzungshinweis BEISPIELE # Shell-Skripte mit gettext source_lang: en languages: [ru, de, fr] targets: - name: myapp type: gettext sources: [scripts, lib] keywords: [gettext, eval_gettext] # Go-Projekt mit Wrapper-Funktionen targets: - name: myapp type: gettext sources: [.] keywords: [T, N] # Dokumentation + Code targets: - name: code type: gettext sources: [src] - name: docs type: po4a po4a_config: docs/po4a.cfg # i18next-Webanwendung targets: - name: frontend type: i18next dir: public/translations # Flutter-Anwendung targets: - name: app type: flutter dir: lib/l10n # Java-Anwendung mit .properties targets: - name: app type: properties dir: src/main/resources
es: Extrae cadenas traducibles y crea/actualiza archivos de traducción. Requiere un archivo de configuración lokit.yaml en la raíz del proyecto. Para proyectos gettext: ejecuta xgettext para extraer cadenas en una plantilla POT, luego crea o actualiza archivos PO para cada idioma. Para proyectos po4a: ejecuta 'po4a --no-translations' para actualizar las plantillas. Para proyectos i18next/json/yaml/properties/flutter: crea archivos de idioma faltantes con traducciones vacías. Para proyectos android/markdown: no se necesita un paso de inicialización — utiliza 'lokit translate' directamente. Este comando es idempotente — seguro de ejecutar varias veces. Las traducciones existentes se preservan al actualizar los archivos. FORMATO DE CONFIGURACIÓN (lokit.yaml) source_lang: en # Idioma fuente (por defecto: en) languages: [ru, de, fr, es, ...] # Idiomas de destino targets: - name: myproject # Nombre para mostrar type: gettext # Tipo de destino (ver abajo) root: . # Directorio de trabajo (por defecto: .) # ... opciones específicas del tipo TIPOS DE DESTINO gettext — Extracción de cadenas del código fuente (shell, python, C, Go, etc.) dir: po # Directorio de archivos PO (requerido) pot_file: po/messages.pot # Ruta de la plantilla POT sources: [src, scripts] # Directorios a escanear (por defecto: raíz) keywords: [_, N_, gettext] # Palabras clave de xgettext (por defecto: conjunto estándar) po4a — Traducción de documentación (man pages, AsciiDoc, etc.) po4a_config: po4a.cfg # Ruta a po4a.cfg (por defecto: po4a.cfg) i18next — Traducciones JSON de i18next dir: public/translations # Directorio de archivos JSON (requerido) json — Traducciones JSON simples { "key": "value" } dir: translations # Directorio de archivos JSON (requerido) android — strings.xml de Android dir: app/src/main/res # Directorio res/ de Android (requerido) yaml — Traducciones YAML de clave/valor dir: translations # Directorio de archivos YAML (requerido) markdown — Traducción de documentos Markdown dir: translations # Directorio raíz; archivos en translations/LANG/ (requerido) properties — Traducciones de archivos .properties de Java dir: translations # Directorio de archivos .properties (requerido) flutter — ARB (Application Resource Bundle) de Flutter dir: lib/l10n # Directorio de archivos ARB (requerido) OPCIONES COMUNES (todos los tipos de destino) languages: [ru, de] # Sobrescribir la lista global de idiomas prompt: "Traducción personalizada..." # Sobrescribir el mensaje de traducción AI EJEMPLOS # Scripts shell con gettext source_lang: en languages: [ru, de, fr] targets: - name: myapp type: gettext sources: [scripts, lib] keywords: [gettext, eval_gettext] # Proyecto Go con funciones wrapper targets: - name: myapp type: gettext sources: [.] keywords: [T, N] # Documentación + código targets: - name: code type: gettext sources: [src] - name: docs type: po4a po4a_config: docs/po4a.cfg # Aplicación web i18next targets: - name: frontend type: i18next dir: public/translations # Aplicación Flutter targets: - name: app type: flutter dir: lib/l10n # Aplicación Java con .properties targets: - name: app type: properties dir: src/main/resources
fr: Extrait les chaînes traduisibles et crée/met à jour les fichiers de traduction. Nécessite un fichier de configuration lokit.yaml à la racine du projet. Pour les projets gettext : exécute xgettext pour extraire les chaînes dans un modèle POT, puis crée ou met à jour les fichiers PO pour chaque langue. Pour les projets po4a : exécute 'po4a --no-translations' pour mettre à jour les modèles. Pour les projets i18next/json/yaml/properties/flutter : crée les fichiers de langue manquants avec des traductions vides. Pour les projets android/markdown : aucune étape d'initialisation nécessaire — utilisez directement 'lokit translate'. Cette commande est idempotente — elle peut être exécutée plusieurs fois sans risque. Les traductions existantes sont préservées lors de la mise à jour des fichiers. FORMAT DE CONFIGURATION (lokit.yaml) source_lang: en # Langue source (par défaut : en) languages: [ru, de, fr, es, ...] # Langues cibles targets: - name: myproject # Nom affiché type: gettext # Type de cible (voir ci-dessous) root: . # Répertoire de travail (par défaut : .) # ... options spécifiques au type TYPES DE CIBLE gettext — Extraction des chaînes du code source (shell, python, C, Go, etc.) dir: po # Répertoire des fichiers PO (obligatoire) pot_file: po/messages.pot # Chemin du modèle POT sources: [src, scripts] # Répertoires à analyser (par défaut : racine) keywords: [_, N_, gettext] # Mots-clés xgettext (par défaut : ensemble standard) po4a — Traduction de documentation (pages man, AsciiDoc, etc.) po4a_config: po4a.cfg # Chemin vers po4a.cfg (par défaut : po4a.cfg) i18next — Traductions JSON i18next dir: public/translations # Répertoire des fichiers JSON (obligatoire) json — Traductions JSON simples { "key": "value" } dir: translations # Répertoire des fichiers JSON (obligatoire) android — strings.xml Android dir: app/src/main/res # Répertoire res/ Android (obligatoire) yaml — Traductions YAML clé/valeur dir: translations # Répertoire des fichiers YAML (obligatoire) markdown — Traduction de documents Markdown dir: translations # Répertoire racine ; fichiers dans translations/LANG/ (obligatoire) properties — Traductions Java .properties dir: translations # Répertoire des fichiers .properties (obligatoire) flutter — ARB (Application Resource Bundle) Flutter dir: lib/l10n # Répertoire des fichiers ARB (obligatoire) OPTIONS COMMUNES (tous les types de cibles) languages: [ru, de] # Remplace la liste globale des langues prompt: "Traduction personnalisée..." # Remplace l'invite de traduction AI EXEMPLES # Scripts shell avec gettext source_lang: en languages: [ru, de, fr] targets: - name: myapp type: gettext sources: [scripts, lib] keywords: [gettext, eval_gettext] # Projet Go avec fonctions wrapper targets: - name: myapp type: gettext sources: [.] keywords: [T, N] # Documentation + code targets: - name: code type: gettext sources: [src] - name: docs type: po4a po4a_config: docs/po4a.cfg # Application web i18next targets: - name: frontend type: i18next dir: public/translations # Application Flutter targets: - name: app type: flutter dir: lib/l10n # Application Java avec .properties targets: - name: app type: properties dir: src/main/resources
it: Estrai le stringhe traducibili e crea/aggiorna i file di traduzione. Richiede un file di configurazione lokit.yaml nella directory principale del progetto. Per i progetti gettext: esegue xgettext per estrarre le stringhe in un template POT, quindi crea o aggiorna i file PO per ogni lingua. Per i progetti po4a: esegue 'po4a --no-translations' per aggiornare i template. Per i progetti i18next/json/yaml/properties/flutter: crea i file di lingua mancanti con traduzioni vuote. Per i progetti android/markdown: nessun passaggio di inizializzazione necessario — usa direttamente 'lokit translate'. Questo comando è idempotente — sicuro da eseguire più volte. Le traduzioni esistenti vengono preservate durante l'aggiornamento dei file. FORMATO CONFIGURAZIONE (lokit.yaml) source_lang: en # Lingua sorgente (predefinita: en) languages: [ru, de, fr, es, ...] # Lingue di destinazione targets: - name: myproject # Nome visualizzato type: gettext # Tipo di destinazione (vedi sotto) root: . # Directory di lavoro (predefinita: .) # ... opzioni specifiche per tipo TIPI DI DESTINAZIONE gettext — Estrazione di stringhe dal codice sorgente (shell, python, C, Go, ecc.) dir: po # Directory dei file PO (obbligatoria) pot_file: po/messages.pot # Percorso del template POT sources: [src, scripts] # Directory da scansionare (predefinita: root) keywords: [_, N_, gettext] # Parole chiave xgettext (predefinite: set standard) po4a — Traduzione della documentazione (pagine man, AsciiDoc, ecc.) po4a_config: po4a.cfg # Percorso di po4a.cfg (predefinito: po4a.cfg) i18next — Traduzioni JSON per i18next dir: public/translations # Directory dei file JSON (obbligatoria) json — Traduzioni JSON semplici { "key": "value" } dir: translations # Directory dei file JSON (obbligatoria) android — strings.xml di Android dir: app/src/main/res # Directory res/ di Android (obbligatoria) yaml — Traduzioni YAML key/value dir: translations # Directory dei file YAML (obbligatoria) markdown — Traduzione di documenti Markdown dir: translations # Directory principale; file in translations/LANG/ (obbligatoria) properties — Traduzioni Java .properties dir: translations # Directory dei file .properties (obbligatoria) flutter — ARB (Application Resource Bundle) per Flutter dir: lib/l10n # Directory dei file ARB (obbligatoria) OPZIONI COMUNI (tutti i tipi di destinazione) languages: [ru, de] # Sovrascrive l'elenco globale delle lingue prompt: "Traduzione personalizzata..." # Sovrascrive il prompt di traduzione AI ESEMPI # Script shell con gettext source_lang: en languages: [ru, de, fr] targets: - name: myapp type: gettext sources: [scripts, lib] keywords: [gettext, eval_gettext] # Progetto Go con funzioni wrapper targets: - name: myapp type: gettext sources: [.] keywords: [T, N] # Documentazione + codice targets: - name: code type: gettext sources: [src] - name: docs type: po4a po4a_config: docs/po4a.cfg # Applicazione web i18next targets: - name: frontend type: i18next dir: public/translations # Applicazione Flutter targets: - name: app type: flutter dir: lib/l10n # Applicazione Java con .properties targets: - name: app type: properties dir: src/main/resources
ja: 翻訳可能な文字列を抽出し、翻訳ファイルを作成または更新します。 プロジェクトルートに lokit.yaml 設定ファイルが必要です。 gettext プロジェクトの場合: xgettext を実行して文字列を POT テンプレートに抽出し、 各言語の PO ファイルを作成または更新します。 po4a プロジェクトの場合: 'po4a --no-translations' を実行してテンプレートを更新します。 i18next/json/yaml/properties/flutter プロジェクトの場合: 空の翻訳を含む言語ファイルを作成します。 android/markdown プロジェクトの場合: 初期化ステップは不要です — 'lokit translate' を直接使用してください。 このコマンドは冪等性を持ち、複数回実行しても安全です。ファイルを更新する際、既存の翻訳は保持されます。 設定フォーマット (lokit.yaml) source_lang: en # ソース言語 (デフォルト: en) languages: [ru, de, fr, es, ...] # 対象言語 targets: - name: myproject # 表示名 type: gettext # ターゲットタイプ (以下を参照) root: . # 作業ディレクトリ (デフォルト: .) # ... タイプ固有のオプション ターゲットタイプ gettext — ソースコード文字列の抽出 (shell, python, C, Go など) dir: po # PO ファイルディレクトリ (必須) pot_file: po/messages.pot # POT テンプレートのパス sources: [src, scripts] # スキャン対象ディレクトリ (デフォルト: ルート) keywords: [_, N_, gettext] # xgettext キーワード (デフォルト: 標準セット) po4a — ドキュメント翻訳 (man ページ、AsciiDoc など) po4a_config: po4a.cfg # po4a.cfg のパス (デフォルト: po4a.cfg) i18next — i18next JSON 翻訳 dir: public/translations # JSON ファイルディレクトリ (必須) json — シンプルな JSON 翻訳 { "key": "value" } dir: translations # JSON ファイルディレクトリ (必須) android — Android strings.xml dir: app/src/main/res # Android res/ ディレクトリ (必須) yaml — YAML キー/値翻訳 dir: translations # YAML ファイルディレクトリ (必須) markdown — Markdown ドキュメント翻訳 dir: translations # ルートディレクトリ; ファイルは translations/LANG/ に配置 (必須) properties — Java .properties 翻訳 dir: translations # .properties ファイルディレクトリ (必須) flutter — Flutter ARB (Application Resource Bundle) dir: lib/l10n # ARB ファイルディレクトリ (必須) 共通オプション (すべてのターゲットタイプ) languages: [ru, de] # グローバル言語リストを上書き prompt: "カスタム翻訳..." # AI 翻訳プロンプトを上書き 使用例 # gettext を使用したシェルスクリプト source_lang: en languages: [ru, de, fr] targets: - name: myapp type: gettext sources: [scripts, lib] keywords: [gettext, eval_gettext] # ラッパー関数を使用した Go プロジェクト targets: - name: myapp type: gettext sources: [.] keywords: [T, N] # ドキュメント + コード targets: - name: code type: gettext sources: [src] - name: docs type: po4a po4a_config: docs/po4a.cfg # i18next ウェブアプリケーション targets: - name: frontend type: i18next dir: public/translations # Flutter アプリケーション targets: - name: app type: flutter dir: lib/l10n # Java アプリケーション (.properties) targets: - name: app type: properties dir: src/main/resources
pl: Wyodrębnij tłumaczalne ciągi znaków i utwórz/zaktualizuj pliki tłumaczeń. Wymaga pliku konfiguracyjnego lokit.yaml w katalogu głównym projektu. Dla projektów gettext: uruchamia xgettext w celu wyodrębnienia ciągów do szablonu POT, następnie tworzy lub aktualizuje pliki PO dla każdego języka. Dla projektów po4a: uruchamia 'po4a --no-translations' w celu aktualizacji szablonów. Dla projektów i18next/json/yaml/properties/flutter: tworzy brakujące pliki językowe z pustymi tłumaczeniami. Dla projektów android/markdown: krok inicjalizacji nie jest wymagany — użyj bezpośrednio 'lokit translate'. To polecenie jest idempotentne — można je bezpiecznie uruchamiać wielokrotnie. Istniejące tłumaczenia są zachowywane podczas aktualizacji plików. FORMAT KONFIGURACJI (lokit.yaml) source_lang: en # Język źródłowy (domyślnie: en) languages: [ru, de, fr, es, ...] # Języki docelowe targets: - name: myproject # Nazwa wyświetlana type: gettext # Typ docelowy (patrz poniżej) root: . # Katalog roboczy (domyślnie: .) # ... opcje specyficzne dla typu TYPY DOCELOWE gettext — Wyodrębnianie ciągów znaków z kodu źródłowego (shell, python, C, Go, itd.) dir: po # Katalog z plikami PO (wymagane) pot_file: po/messages.pot # Ścieżka do szablonu POT sources: [src, scripts] # Katalogi do skanowania (domyślnie: root) keywords: [_, N_, gettext] # Słowa kluczowe xgettext (domyślnie: standardowy zestaw) po4a — Tłumaczenie dokumentacji (strony man, AsciiDoc, itd.) po4a_config: po4a.cfg # Ścieżka do po4a.cfg (domyślnie: po4a.cfg) i18next — Tłumaczenia JSON dla i18next dir: public/translations # Katalog z plikami JSON (wymagane) json — Proste tłumaczenia JSON { "key": "value" } dir: translations # Katalog z plikami JSON (wymagane) android — Android strings.xml dir: app/src/main/res # Katalog res/ dla Androida (wymagane) yaml — Tłumaczenia w formacie YAML klucz/wartość dir: translations # Katalog z plikami YAML (wymagane) markdown — Tłumaczenie dokumentów Markdown dir: translations # Katalog główny; pliki w translations/LANG/ (wymagane) properties — Tłumaczenia Java .properties dir: translations # Katalog z plikami .properties (wymagane) flutter — Flutter ARB (Application Resource Bundle) dir: lib/l10n # Katalog z plikami ARB (wymagane) WSPÓLNE OPCJE (dla wszystkich typów docelowych) languages: [ru, de] # Nadpisanie globalnej listy języków prompt: "Custom translation..." # Nadpisanie promptu dla tłumaczenia AI PRZYKŁADY # Skrypty powłoki z gettext source_lang: en languages: [ru, de, fr] targets: - name: myapp type: gettext sources: [scripts, lib] keywords: [gettext, eval_gettext] # Projekt Go z funkcjami wrapper targets: - name: myapp type: gettext sources: [.] keywords: [T, N] # Dokumentacja + kod targets: - name: code type: gettext sources: [src] - name: docs type: po4a po4a_config: docs/po4a.cfg # Aplikacja webowa i18next targets: - name: frontend type: i18next dir: public/translations # Aplikacja Flutter targets: - name: app type: flutter dir: lib/l10n # Aplikacja Java z .properties targets: - name: app type: properties dir: src/main/resources
pt_br: Extrai strings traduzíveis e cria/atualiza arquivos de tradução. Requer um arquivo de configuração lokit.yaml na raiz do projeto. Para projetos gettext: executa xgettext para extrair strings em um template POT, em seguida cria ou atualiza arquivos PO para cada idioma. Para projetos po4a: executa 'po4a --no-translations' para atualizar os templates. Para projetos i18next/json/yaml/properties/flutter: cria arquivos de idioma faltantes com traduções vazias. Para projetos android/markdown: nenhuma etapa de inicialização necessária — use 'lokit translate' diretamente. Este comando é idempotente — seguro para executar várias vezes. Traduções existentes são preservadas ao atualizar os arquivos. FORMATO DA CONFIGURAÇÃO (lokit.yaml) source_lang: en # Idioma de origem (padrão: en) languages: [ru, de, fr, es, ...] # Idiomas de destino targets: - name: myproject # Nome de exibição type: gettext # Tipo de destino (veja abaixo) root: . # Diretório de trabalho (padrão: .) # ... opções específicas do tipo TIPOS DE DESTINO gettext — Extração de strings do código-fonte (shell, python, C, Go, etc.) dir: po # Diretório dos arquivos PO (obrigatório) pot_file: po/messages.pot # Caminho do template POT sources: [src, scripts] # Diretórios para escanear (padrão: root) keywords: [_, N_, gettext] # Palavras-chave do xgettext (padrão: conjunto padrão) po4a — Tradução de documentação (man pages, AsciiDoc, etc.) po4a_config: po4a.cfg # Caminho para po4a.cfg (padrão: po4a.cfg) i18next — Traduções JSON do i18next dir: public/translations # Diretório dos arquivos JSON (obrigatório) json — Traduções JSON simples { "key": "value" } dir: translations # Diretório dos arquivos JSON (obrigatório) android — strings.xml do Android dir: app/src/main/res # Diretório res/ do Android (obrigatório) yaml — Traduções YAML chave/valor dir: translations # Diretório dos arquivos YAML (obrigatório) markdown — Tradução de documentos Markdown dir: translations # Diretório raiz; arquivos em translations/LANG/ (obrigatório) properties — Traduções Java .properties dir: translations # Diretório dos arquivos .properties (obrigatório) flutter — ARB (Application Resource Bundle) do Flutter dir: lib/l10n # Diretório dos arquivos ARB (obrigatório) OPÇÕES COMUNS (todos os tipos de destino) languages: [ru, de] # Substituir a lista global de idiomas prompt: "Tradução personalizada..." # Substituir o prompt de tradução da IA EXEMPLOS # Scripts Shell com gettext source_lang: en languages: [ru, de, fr] targets: - name: myapp type: gettext sources: [scripts, lib] keywords: [gettext, eval_gettext] # Projeto Go com funções wrapper targets: - name: myapp type: gettext sources: [.] keywords: [T, N] # Documentação + código targets: - name: code type: gettext sources: [src] - name: docs type: po4a po4a_config: docs/po4a.cfg # Aplicação web i18next targets: - name: frontend type: i18next dir: public/translations # Aplicação Flutter targets: - name: app type: flutter dir: lib/l10n # Aplicação Java com .properties targets: - name: app type: properties dir: src/main/resources
ru: Извлечение переводимых строк и создание/обновление файлов перевода. Требуется конфигурационный файл lokit.yaml в корневой директории проекта. Для проектов gettext: выполняется xgettext для извлечения строк в POT-шаблон, затем создаются или обновляются PO-файлы для каждого языка. Для проектов po4a: выполняется 'po4a --no-translations' для обновления шаблонов. Для проектов i18next/json/yaml/properties/flutter: создаются отсутствующие языковые файлы с пустыми переводами. Для проектов android/markdown: шаг инициализации не требуется — используйте 'lokit translate' напрямую. Эта команда идемпотентна — безопасно запускать несколько раз. Существующие переводы сохраняются при обновлении файлов. ФОРМАТ КОНФИГУРАЦИИ (lokit.yaml) source_lang: en # Исходный язык (по умолчанию: en) languages: [ru, de, fr, es, ...] # Целевые языки targets: - name: myproject # Отображаемое имя type: gettext # Тип цели (см. ниже) root: . # Рабочая директория (по умолчанию: .) # ... параметры для конкретного типа ТИПЫ ЦЕЛЕЙ gettext — Извлечение строк из исходного кода (shell, python, C, Go и т.д.) dir: po # Директория для PO-файлов (обязательно) pot_file: po/messages.pot # Путь к POT-шаблону sources: [src, scripts] # Директории для сканирования (по умолчанию: root) keywords: [_, N_, gettext] # Ключевые слова для xgettext (по умолчанию: стандартный набор) po4a — Перевод документации (man-страницы, AsciiDoc и т.д.) po4a_config: po4a.cfg # Путь к po4a.cfg (по умолчанию: po4a.cfg) i18next — JSON-переводы для i18next dir: public/translations # Директория для JSON-файлов (обязательно) json — Простые JSON-переводы { "key": "value" } dir: translations # Директория для JSON-файлов (обязательно) android — Android strings.xml dir: app/src/main/res # Директория res/ для Android (обязательно) yaml — YAML-переводы ключ/значение dir: translations # Директория для YAML-файлов (обязательно) markdown — Перевод Markdown-документов dir: translations # Корневая директория; файлы в translations/LANG/ (обязательно) properties — Переводы Java .properties dir: translations # Директория для .properties-файлов (обязательно) flutter — Flutter ARB (Application Resource Bundle) dir: lib/l10n # Директория для ARB-файлов (обязательно) ОБЩИЕ ПАРАМЕТРЫ (для всех типов целей) languages: [ru, de] # Переопределение глобального списка языков prompt: "Custom translation..." # Переопределение подсказки для AI-перевода ПРИМЕРЫ # Shell-скрипты с gettext source_lang: en languages: [ru, de, fr] targets: - name: myapp type: gettext sources: [scripts, lib] keywords: [gettext, eval_gettext] # Go-проект с обёрточными функциями targets: - name: myapp type: gettext sources: [.] keywords: [T, N] # Документация + код targets: - name: code type: gettext sources: [src] - name: docs type: po4a po4a_config: docs/po4a.cfg # Веб-приложение на i18next targets: - name: frontend type: i18next dir: public/translations # Приложение на Flutter targets: - name: app type: flutter dir: lib/l10n # Java-приложение с .properties targets: - name: app type: properties dir: src/main/resources
tr: Çevrilebilir dizgileri çıkarın ve çeviri dosyalarını oluşturun/güncelleyin. Proje kök dizininde bir lokit.yaml yapılandırma dosyası gereklidir. Gettext projeleri için: Dizgileri bir POT şablonuna çıkarmak için xgettext çalıştırır, sonrasında her dil için PO dosyalarını oluşturur veya günceller. Po4a projeleri için: Şablonları güncellemek için 'po4a --no-translations' komutunu çalıştırır. i18next/json/yaml/properties/flutter projeleri için: Boş çevirilerle eksik dil dosyalarını oluşturur. Android/markdown projeleri için: Başlatma adımı gerekmez — doğrudan 'lokit translate' kullanın. Bu komut idempotenttir — birden fazla kez çalıştırılması güvenlidir. Dosyalar güncellenirken mevcut çeviriler korunur. YAPILANDIRMA FORMAT (lokit.yaml) source_lang: en # Kaynak dil (varsayılan: en) languages: [ru, de, fr, es, ...] # Hedef diller targets: - name: myproject # Görünen ad type: gettext # Hedef türü (aşağıya bakın) root: . # Çalışma dizini (varsayılan: .) # ... türe özgü seçenekler HEDEF TÜRLERİ gettext — Kaynak kod dizgisi çıkarma (shell, python, C, Go, vb.) dir: po # PO dosyaları dizini (gerekli) pot_file: po/messages.pot # POT şablon yolu sources: [src, scripts] # Tarama yapılacak dizinler (varsayılan: root) keywords: [_, N_, gettext] # xgettext anahtar kelimeleri (varsayılan: standart set) po4a — Dokümantasyon çevirisi (man sayfaları, AsciiDoc, vb.) po4a_config: po4a.cfg # po4a.cfg yolu (varsayılan: po4a.cfg) i18next — i18next JSON çevirileri dir: public/translations # JSON dosyaları dizini (gerekli) json — Basit JSON çevirileri { "key": "value" } dir: translations # JSON dosyaları dizini (gerekli) android — Android strings.xml dir: app/src/main/res # Android res/ dizini (gerekli) yaml — YAML anahtar/değer çevirileri dir: translations # YAML dosyaları dizini (gerekli) markdown — Markdown doküman çevirisi dir: translations # Kök dizin; dosyalar translations/LANG/ içinde (gerekli) properties — Java .properties çevirileri dir: translations # .properties dosyaları dizini (gerekli) flutter — Flutter ARB (Application Resource Bundle) dir: lib/l10n # ARB dosyaları dizini (gerekli) ORTAK SEÇENEKLER (tüm hedef türleri) languages: [ru, de] # Genel dil listesini geçersiz kıl prompt: "Özel çeviri..." # AI çeviri istemini geçersiz kıl ÖRNEKLER # Gettext ile shell scriptleri source_lang: en languages: [ru, de, fr] targets: - name: myapp type: gettext sources: [scripts, lib] keywords: [gettext, eval_gettext] # Wrapper fonksiyonlarıyla Go projesi targets: - name: myapp type: gettext sources: [.] keywords: [T, N] # Dokümantasyon + kod targets: - name: code type: gettext sources: [src] - name: docs type: po4a po4a_config: docs/po4a.cfg # i18next web uygulaması targets: - name: frontend type: i18next dir: public/translations # Flutter uygulaması targets: - name: app type: flutter dir: lib/l10n # .properties ile Java uygulaması targets: - name: app type: properties dir: src/main/resources
uk: Витягування перекладних рядків і створення/оновлення файлів перекладу. Потребує конфігураційного файлу lokit.yaml у кореневій директорії проєкту. Для проєктів gettext: виконує xgettext для витягування рядків у шаблон POT, потім створює або оновлює PO-файли для кожної мови. Для проєктів po4a: виконує 'po4a --no-translations' для оновлення шаблонів. Для проєктів i18next/json/yaml/properties/flutter: створює відсутні файли мов з порожніми перекладами. Для проєктів android/markdown: крок ініціалізації не потрібен — використовуйте 'lokit translate' безпосередньо. Ця команда є ідемпотентною — її безпечно виконувати кілька разів. Існуючі переклади зберігаються під час оновлення файлів. ФОРМАТ КОНФІГУРАЦІЇ (lokit.yaml) source_lang: en # Мова оригіналу (за замовчуванням: en) languages: [ru, de, fr, es, ...] # Цільові мови targets: - name: myproject # Назва для відображення type: gettext # Тип цілі (див. нижче) root: . # Робоча директорія (за замовчуванням: .) # ... параметри для конкретного типу ТИПИ ЦІЛЕЙ gettext — Витягування рядків з вихідного коду (shell, python, C, Go тощо) dir: po # Директорія PO-файлів (обов'язково) pot_file: po/messages.pot # Шлях до шаблону POT sources: [src, scripts] # Директорії для сканування (за замовчуванням: root) keywords: [_, N_, gettext] # Ключові слова xgettext (за замовчуванням: стандартний набір) po4a — Переклад документації (man-сторінки, AsciiDoc тощо) po4a_config: po4a.cfg # Шлях до po4a.cfg (за замовчуванням: po4a.cfg) i18next — JSON-переклади для i18next dir: public/translations # Директорія JSON-файлів (обов'язково) json — Простий JSON-переклад { "key": "value" } dir: translations # Директорія JSON-файлів (обов'язково) android — Android strings.xml dir: app/src/main/res # Директорія res/ для Android (обов'язково) yaml — YAML-переклади ключ/значення dir: translations # Директорія YAML-файлів (обов'язково) markdown — Переклад документів Markdown dir: translations # Коренева директорія; файли у translations/LANG/ (обов'язково) properties — Переклади Java .properties dir: translations # Директорія .properties-файлів (обов'язково) flutter — Flutter ARB (Application Resource Bundle) dir: lib/l10n # Директорія ARB-файлів (обов'язково) ЗАГАЛЬНІ ПАРАМЕТРИ (для всіх типів цілей) languages: [ru, de] # Перевизначення глобального списку мов prompt: "Custom translation..." # Перевизначення запиту для AI-перекладу ПРИКЛАДИ # Shell-скрипти з gettext source_lang: en languages: [ru, de, fr] targets: - name: myapp type: gettext sources: [scripts, lib] keywords: [gettext, eval_gettext] # Go-проєкт із функціями-обгортками targets: - name: myapp type: gettext sources: [.] keywords: [T, N] # Документація + код targets: - name: code type: gettext sources: [src] - name: docs type: po4a po4a_config: docs/po4a.cfg # Веб-додаток i18next targets: - name: frontend type: i18next dir: public/translations # Додаток Flutter targets: - name: app type: flutter dir: lib/l10n # Java-додаток із .properties targets: - name: app type: properties dir: src/main/resources
