Repository: minios-linux/lokit
Catalog: po/*.po
Languages: ar, de, es, fr, it, ja, pl, pt_br, ru, tr, uk

source: You can now use: lokit translate --provider custom-openai --model MODEL_NAME
ar: يمكنك الآن استخدام: lokit translate --provider custom-openai --model MODEL_NAME
de: Sie können jetzt verwenden: lokit translate --provider custom-openai --model MODEL_NAME
es: Ahora puedes usar: lokit translate --provider custom-openai --model MODEL_NAME
fr: Vous pouvez maintenant utiliser : lokit translate --provider custom-openai --model MODEL_NAME
it: Ora puoi usare: lokit translate --provider custom-openai --model MODEL_NAME
ja: 次のコマンドが利用可能になりました: lokit translate --provider custom-openai --model MODEL_NAME
pl: Możesz teraz użyć: lokit translate --provider custom-openai --model MODEL_NAME
pt_br: Agora você pode usar: lokit translate --provider custom-openai --model MODEL_NAME
ru: Теперь вы можете использовать: lokit translate --provider custom-openai --model MODEL_NAME
tr: Artık şunu kullanabilirsiniz: lokit translate --provider custom-openai --model MODEL_NAME
uk: Тепер ви можете використовувати: lokit translate --provider custom-openai --model MODEL_NAME

source: Remove stored credentials
ar: إزالة بيانات الاعتماد المخزنة
de: Gespeicherte Anmeldedaten entfernen
es: Eliminar credenciales guardadas
fr: Supprimer les identifiants enregistrés
it: Rimuovi credenziali salvate
ja: 保存済み認証情報の削除
pl: Usuń zapisane dane logowania
pt_br: Remover credenciais salvas
ru: Удалить сохранённые учётные данные
tr: Kayıtlı kimlik bilgilerini kaldır
uk: Видалити збережені облікові дані

source: Remove stored credentials for one or all providers. If --provider is not specified, credentials for ALL providers are removed. Examples: lokit auth logout Remove all credentials lokit auth logout --provider copilot Remove only Copilot OAuth lokit auth logout --provider google Remove only Google API key lokit auth logout --provider gemini Remove only Gemini OAuth
ar: إزالة بيانات الاعتماد المحفوظة لمزود واحد أو للجميع. إذا لم يتم تحديد --provider، سيتم إزالة بيانات الاعتماد لجميع المزودين. أمثلة: lokit auth logout إزالة جميع بيانات الاعتماد lokit auth logout --provider copilot إزالة مصادقة Copilot فقط lokit auth logout --provider google إزالة مفتاح Google فقط lokit auth logout --provider gemini إزالة مصادقة Gemini فقط
de: Gespeicherte Zugangsdaten für einen oder alle Anbieter entfernen. Wenn --provider nicht angegeben ist, werden Zugangsdaten für ALLE Anbieter entfernt. Beispiele: lokit auth logout Alle Zugangsdaten entfernen lokit auth logout --provider copilot Nur Copilot OAuth entfernen lokit auth logout --provider google Nur Google API-Schlüssel entfernen lokit auth logout --provider gemini Nur Gemini OAuth entfernen
es: Elimina credenciales guardadas para uno o todos los proveedores. Si no se especifica --provider, se eliminan las credenciales de TODOS los proveedores. Ejemplos: lokit auth logout Eliminar todas las credenciales lokit auth logout --provider copilot Eliminar solo OAuth de Copilot lokit auth logout --provider google Eliminar solo clave API de Google lokit auth logout --provider gemini Eliminar solo OAuth de Gemini
fr: Supprimez les identifiants stockés pour un ou tous les fournisseurs. Si --provider n'est pas spécifié, les identifiants de TOUS les fournisseurs sont supprimés. Exemples : lokit auth logout Supprimer tous les identifiants lokit auth logout --provider copilot Supprimer uniquement Copilot OAuth lokit auth logout --provider google Supprimer uniquement la clé API Google lokit auth logout --provider gemini Supprimer uniquement Gemini OAuth
it: Rimuovi le credenziali salvate per uno o tutti i provider. Se --provider non è specificato, vengono rimosse le credenziali per TUTTI i provider. Esempi: lokit auth logout Rimuovi tutte le credenziali lokit auth logout --provider copilot Rimuovi solo OAuth Copilot lokit auth logout --provider google Rimuovi solo chiave API Google lokit auth logout --provider gemini Rimuovi solo OAuth Gemini
ja: 1つまたは全プロバイダーの保存済み認証情報を削除します。 --providerを指定しない場合、すべてのプロバイダーの認証情報が削除されます。 使用例: lokit auth logout すべての認証情報を削除 lokit auth logout --provider copilot Copilot OAuthのみ削除 lokit auth logout --provider google Google APIキーのみ削除 lokit auth logout --provider gemini Gemini OAuthのみ削除
pl: Usuń zapisane poświadczenia dla jednego lub wszystkich dostawców. Jeśli --provider nie jest podany, poświadczenia dla WSZYSTKICH dostawców zostaną usunięte. Przykłady: lokit auth logout Usuń wszystkie poświadczenia lokit auth logout --provider copilot Usuń tylko Copilot OAuth lokit auth logout --provider google Usuń tylko klucz API Google lokit auth logout --provider gemini Usuń tylko Gemini OAuth
pt_br: Remova credenciais salvas de um ou todos os provedores. Se --provider não for especificado, as credenciais de TODOS os provedores serão removidas. Exemplos: lokit auth logout Remove todas as credenciais lokit auth logout --provider copilot Remove apenas o OAuth do Copilot lokit auth logout --provider google Remove apenas a chave de API do Google lokit auth logout --provider gemini Remove apenas o OAuth do Gemini
ru: Удалить сохранённые учетные данные для одного или всех провайдеров. Если параметр --provider не указан, будут удалены данные для ВСЕХ провайдеров. Примеры: lokit auth logout Удалить все учетные данные lokit auth logout --provider copilot Удалить только Copilot OAuth lokit auth logout --provider google Удалить только API-ключ Google lokit auth logout --provider gemini Удалить только Gemini OAuth
tr: Bir veya tüm sağlayıcılar için kayıtlı kimlik bilgilerini kaldırın. --provider belirtilmezse, TÜM sağlayıcılar için kimlik bilgileri kaldırılır. Örnekler: lokit auth logout Tüm kimlik bilgilerini kaldır lokit auth logout --provider copilot Sadece Copilot OAuth'u kaldır lokit auth logout --provider google Sadece Google API anahtarını kaldır lokit auth logout --provider gemini Sadece Gemini OAuth'u kaldır
uk: Видалити збережені облікові дані для одного або всіх провайдерів. Якщо --provider не вказано, видаляються дані для ВСІХ провайдерів. Приклади: lokit auth logout Видалити всі облікові дані lokit auth logout --provider copilot Видалити лише Copilot OAuth lokit auth logout --provider google Видалити лише API-ключ Google lokit auth logout --provider gemini Видалити лише Gemini OAuth

source: Failed to remove Copilot credentials: %v
ar: فشل إزالة بيانات اعتماد Copilot: %v
de: Copilot-Anmeldedaten konnten nicht entfernt werden: %v
es: No se pudieron eliminar las credenciales de Copilot: %v
fr: Échec de la suppression des identifiants Copilot : %v
it: Rimozione delle credenziali Copilot non riuscita: %v
ja: Copilot の認証情報の削除に失敗しました: %v
pl: Nie udało się usunąć danych logowania Copilot: %v
pt_br: Falha ao remover credenciais do Copilot: %v
ru: Не удалось удалить учётные данные Copilot: %v
tr: Copilot kimlik bilgileri kaldırılamadı: %v
uk: Не вдалося видалити облікові дані Copilot: %v

source: Show version information
ar: عرض معلومات الإصدار
de: Versionsinformationen anzeigen
es: Mostrar información de la versión
fr: Afficher les informations de version
it: Mostra informazioni sulla versione
ja: バージョン情報を表示
pl: Pokaż informacje o wersji
pt_br: Exibir informações da versão
ru: Показать информацию о версии
tr: Sürüm bilgisini göster
uk: Показати інформацію про версію

source: Copilot credentials removed
ar: تمت إزالة بيانات اعتماد Copilot
de: Copilot-Anmeldedaten entfernt
es: Credenciales de Copilot eliminadas
fr: Identifiants Copilot supprimés
it: Credenziali Copilot rimosse
ja: Copilot の認証情報を削除しました
pl: Dane logowania Copilot usunięte
pt_br: Credenciais do Copilot removidas
ru: Учётные данные Copilot удалены
tr: Copilot kimlik bilgileri kaldırıldı
uk: Облікові дані Copilot видалено

source: Failed to remove Gemini credentials: %v
ar: فشل إزالة بيانات اعتماد Gemini: %v
de: Gemini-Anmeldedaten konnten nicht entfernt werden: %v
es: No se pudieron eliminar las credenciales de Gemini: %v
fr: Échec de la suppression des identifiants Gemini : %v
it: Rimozione delle credenziali Gemini non riuscita: %v
ja: Gemini の認証情報の削除に失敗しました: %v
pl: Nie udało się usunąć danych logowania Gemini: %v
pt_br: Falha ao remover credenciais do Gemini: %v
ru: Не удалось удалить учётные данные Gemini: %v
tr: Gemini kimlik bilgileri kaldırılamadı: %v
uk: Не вдалося видалити облікові дані Gemini: %v

source: Gemini credentials removed
ar: تمت إزالة بيانات اعتماد Gemini
de: Gemini-Anmeldedaten entfernt
es: Credenciales de Gemini eliminadas
fr: Identifiants Gemini supprimés
it: Credenziali Gemini rimosse
ja: Gemini の認証情報を削除しました
pl: Dane logowania Gemini usunięte
pt_br: Credenciais do Gemini removidas
ru: Учётные данные Gemini удалены
tr: Gemini kimlik bilgileri kaldırıldı
uk: Облікові дані Gemini видалено

source: Failed to remove %s credentials: %v
ar: فشل إزالة بيانات اعتماد %s: %v
de: %s-Anmeldedaten konnten nicht entfernt werden: %v
es: No se pudieron eliminar las credenciales de %s: %v
fr: Échec de la suppression des identifiants %s : %v
it: Rimozione delle credenziali %s non riuscita: %v
ja: %s の認証情報の削除に失敗しました: %v
pl: Nie udało się usunąć danych logowania %s: %v
pt_br: Falha ao remover credenciais de %s: %v
ru: Не удалось удалить учётные данные %s: %v
tr: %s kimlik bilgileri kaldırılamadı: %v
uk: Не вдалося видалити облікові дані %s: %v

source: Display version, commit hash, and build date.
ar: عرض الإصدار، رمز الالتزام، وتاريخ البناء.
de: Version, Commit-Hash und Build-Datum anzeigen.
es: Mostrar versión, hash de commit y fecha de compilación.
fr: Afficher la version, le hash du commit et la date de compilation.
it: Visualizza versione, commit hash e data di build.
ja: バージョン、コミットハッシュ、ビルド日を表示します。
pl: Wyświetl wersję, hash commita i datę kompilacji.
pt_br: Exibe versão, hash do commit e data de build.
ru: Показать версию, хеш коммита и дату сборки.
tr: Sürüm, commit hash ve derleme tarihini görüntüle.
uk: Показати версію, хеш коміту та дату збірки.

source: %s credentials removed
ar: تمت إزالة بيانات اعتماد %s
de: %s-Anmeldedaten entfernt
es: Credenciales de %s eliminadas
fr: Identifiants %s supprimés
it: Credenziali %s rimosse
ja: %s の認証情報を削除しました
pl: Dane logowania %s usunięte
pt_br: Credenciais de %s removidas
ru: Учётные данные %s удалены
tr: %s kimlik bilgileri kaldırıldı
uk: Облікові дані %s видалено

source: Unknown provider '%s'. Run 'lokit auth list' to see providers.
ar: موفر غير معروف '%s'. شغّل 'lokit auth list' لعرض الموفرين.
de: Unbekannter Provider '%s'. Führen Sie 'lokit auth list' aus, um die verfügbaren Provider anzuzeigen.
es: Proveedor desconocido '%s'. Ejecuta 'lokit auth list' para ver los proveedores.
fr: Fournisseur inconnu '%s'. Exécutez 'lokit auth list' pour voir les fournisseurs.
it: Provider sconosciuto '%s'. Esegui 'lokit auth list' per vedere i provider.
ja: 不明なプロバイダー '%s' です。'lokit auth list' で利用可能なプロバイダーを確認できます。
pl: Nieznany dostawca '%s'. Uruchom 'lokit auth list', aby zobaczyć dostępnych dostawców.
pt_br: Provedor desconhecido '%s'. Execute 'lokit auth list' para ver os provedores.
ru: Неизвестный провайдер '%s'. Выполните 'lokit auth list', чтобы увидеть список провайдеров.
tr: Bilinmeyen sağlayıcı '%s'. Sağlayıcıları görmek için 'lokit auth list' komutunu çalıştırın.
uk: Невідомий провайдер '%s'. Виконайте 'lokit auth list', щоб переглянути список провайдерів.

source: lokit version %s
ar: إصدار lokit %s
es: lokit versión %s
it: lokit versione %s
ja: lokit バージョン %s
pl: lokit wersja %s
pt_br: lokit versão %s
ru: lokit версия %s
tr: lokit sürüm %s
uk: lokit версія %s

source: All stored credentials removed
ar: تمت إزالة جميع بيانات الاعتماد المخزنة
de: Alle gespeicherten Anmeldedaten entfernt
es: Todas las credenciales guardadas han sido eliminadas
fr: Tous les identifiants enregistrés ont été supprimés
it: Tutte le credenziali salvate sono state rimosse
ja: すべての保存済み認証情報を削除しました
pl: Wszystkie zapisane dane logowania zostały usunięte
pt_br: Todas as credenciais salvas foram removidas
ru: Все сохранённые учётные данные удалены
tr: Tüm kayıtlı kimlik bilgileri kaldırıldı
uk: Всі збережені облікові дані видалено

source: commit:
ar: الالتزام:
ja: コミット:
ru: коммит:
uk: коміт:

source: Provider to logout (default: all)
ar: المزود المطلوب تسجيل الخروج منه (الافتراضي: الجميع)
de: Anbieter zum Abmelden (Standard: alle)
es: Proveedor para cerrar sesión (predeterminado: todos)
fr: Fournisseur à déconnecter (défaut : tous)
it: Provider da disconnettere (predefinito: tutti)
ja: ログアウトするプロバイダー（デフォルト: 全て）
pl: Dostawca do wylogowania (domyślnie: wszyscy)
pt_br: Provedor para logout (padrão: todos)
ru: Провайдер для выхода (по умолчанию: все)
tr: Çıkış yapılacak sağlayıcı (varsayılan: tümü)
uk: Провайдер для виходу (за замовчуванням: всі)

source: built:
ar: تم البناء:
de: gebaut:
es: compilado:
fr: compilé :
it: build:
ja: ビルド日時:
pl: zbudowano:
pt_br: build:
ru: собрано:
tr: derlendi:
uk: зібрано:

source: Show stored credentials and status
ar: عرض بيانات الاعتماد المخزنة والحالة
de: Gespeicherte Anmeldedaten und Status anzeigen
es: Mostrar credenciales guardadas y estado
fr: Afficher les identifiants enregistrés et leur statut
it: Mostra credenziali salvate e stato
ja: 保存済み認証情報とステータスを表示
pl: Pokaż zapisane dane logowania i status
pt_br: Mostrar credenciais salvas e status
ru: Показать сохранённые учётные данные и их статус
tr: Kayıtlı kimlik bilgilerini ve durumunu göster
uk: Показати збережені облікові дані та статус

source: Stored Credentials
ar: بيانات الاعتماد المخزنة
de: Gespeicherte Anmeldedaten
es: Credenciales guardadas
fr: Identifiants enregistrés
it: Credenziali salvate
ja: 保存済み認証情報
pl: Zapisane dane logowania
pt_br: Credenciais Salvas
ru: Сохранённые учётные данные
tr: Kayıtlı Kimlik Bilgileri
uk: Збережені облікові дані

source: OAuth Providers
ar: مزودو OAuth
de: OAuth-Anbieter
es: Proveedores OAuth
fr: Fournisseurs OAuth
it: Provider OAuth
ja: OAuthプロバイダー
pl: Dostawcy OAuth
pt_br: Provedores OAuth
ru: OAuth-провайдеры
tr: OAuth Sağlayıcıları
uk: OAuth-провайдери

source: API Key Providers
ar: مزودو مفاتيح API
de: API-Key-Anbieter
es: Proveedores con clave API
fr: Fournisseurs par clé API
it: Provider Chiave API
ja: APIキー型プロバイダー
pl: Dostawcy klucza API
pt_br: Provedores com chave de API
ru: Провайдеры с API-ключом
tr: API Anahtarı Sağlayıcıları
uk: Провайдери API-ключів

source: ✓ configured
ar: ✓ تم الإعداد
de: ✓ konfiguriert
es: ✓ configurado
fr: ✓ configuré
it: ✓ configurato
ja: ✓ 設定済み
pl: ✓ skonfigurowano
pt_br: ✓ configurado
ru: ✓ настроено
tr: ✓ yapılandırıldı
uk: ✓ налаштовано

source: endpoint:
ar: نقطة النهاية:
de: Endpunkt:
fr: point de terminaison :
ja: エンドポイント:
tr: uç nokta:

source: no key
ar: لا يوجد مفتاح
de: kein Schlüssel
es: sin clave
fr: aucune clé
it: nessuna chiave
ja: キーなし
pl: brak klucza
pt_br: sem chave
ru: нет ключа
tr: anahtar yok
uk: немає ключа

source: not configured
ar: غير مُكوَّن
de: nicht konfiguriert
es: no configurado
fr: non configuré
it: non configurato
ja: 未設定
pl: nie skonfigurowano
pt_br: não configurado
ru: не настроено
tr: yapılandırılmadı
uk: не налаштовано

source: Environment Variables
ar: متغيرات البيئة
de: Umgebungsvariablen
es: Variables de entorno
fr: Variables d'environnement
it: Variabili d'ambiente
ja: 環境変数
pl: Zmienne środowiskowe
pt_br: Variáveis de Ambiente
ru: Переменные окружения
tr: Ortam Değişkenleri
uk: Змінні середовища

source: not set
ar: غير مضبوط
de: nicht gesetzt
es: no establecido
fr: non défini
it: non impostato
ja: 未設定
pl: nie ustawiono
pt_br: não definido
ru: не задано
tr: atanmamış
uk: не встановлено

source: Scanning for source files in: %s
ar: جارٍ البحث عن ملفات المصدر في: %s
de: Suche nach Quelldateien in: %s
es: Buscando archivos fuente en: %s
fr: Analyse des fichiers sources dans : %s
it: Scansione dei file sorgente in: %s
ja: ソースファイルをスキャン中: %s
pl: Skanowanie plików źródłowych w: %s
pt_br: Procurando arquivos-fonte em: %s
ru: Сканирование исходных файлов в: %s
tr: Kaynak dosyalar taranıyor: %s
uk: Сканування вихідних файлів у: %s

source: scanning sources: %w
ar: جاري فحص المصادر: %w
de: Quellen werden gescannt: %w
es: escaneando fuentes: %w
fr: analyse des sources : %w
it: scansione delle sorgenti: %w
ja: ソースのスキャン中: %w
pl: skanowanie źródeł: %w
pt_br: escaneando fontes: %w
ru: сканирование источников: %w
tr: Kaynaklar taranıyor: %w
uk: сканування джерел: %w

source: no source files found (supported: %s)
ar: لم يتم العثور على ملفات مصدر (المدعومة: %s)
de: Keine Quelldateien gefunden (unterstützt: %s)
es: no se encontraron archivos fuente (soportados: %s)
fr: aucun fichier source trouvé (pris en charge : %s)
it: nessun file sorgente trovato (supportati: %s)
ja: ソースファイルが見つかりません（対応: %s）
pl: nie znaleziono plików źródłowych (obsługiwane: %s)
pt_br: nenhum arquivo de origem encontrado (suportados: %s)
ru: нет исходных файлов (поддерживаются: %s)
tr: Kaynak dosya bulunamadı (desteklenen: %s)
uk: не знайдено вихідних файлів (підтримуються: %s)

source: Found %d source files (%s)
ar: تم العثور على %d ملف مصدر (%s)
de: %d Quelldateien gefunden (%s)
es: Se encontraron %d archivos fuente (%s)
fr: %d fichiers sources trouvés (%s)
it: Trovati %d file sorgente (%s)
ja: %d 件のソースファイルを検出しました（%s）
pl: Znaleziono %d plików źródłowych (%s)
pt_br: Encontrados %d arquivos-fonte (%s)
ru: Найдено исходных файлов: %d (%s)
tr: %d kaynak dosyası bulundu (%s)
uk: Знайдено %d вихідних файлів (%s)

source: Extracting from %d Go files (AST, keywords: %s)...
ar: استخراج من %d ملف Go (AST، كلمات مفتاحية: %s)...
de: Extrahiere aus %d Go-Dateien (AST, Schlüsselwörter: %s)...
es: Extrayendo de %d archivos Go (AST, palabras clave: %s)...
fr: Extraction depuis %d fichiers Go (AST, mots-clés : %s)...
it: Estrazione da %d file Go (AST, parole chiave: %s)...
ja: %d 件のGoファイルから抽出中（AST、キーワード: %s）...
pl: Ekstrakcja z %d plików Go (AST, słowa kluczowe: %s)...
pt_br: Extraindo de %d arquivos Go (AST, palavras-chave: %s)...
ru: Извлечение из %d Go-файлов (AST, ключевые слова: %s)...
tr: %d Go dosyasından çıkarılıyor (AST, anahtar kelimeler: %s)...
uk: Витягнення з %d Go-файлів (AST, ключові слова: %s)...

source: Extracting from %d Go files with xgotext...
ar: استخراج من %d ملف Go باستخدام xgotext...
de: Extrahiere aus %d Go-Dateien mit xgotext...
es: Extrayendo de %d archivos Go con xgotext...
fr: Extraction depuis %d fichiers Go avec xgotext...
it: Estrazione da %d file Go con xgotext...
ja: %d 件のGoファイルからxgotextで抽出中...
pl: Ekstrakcja z %d plików Go przy użyciu xgotext...
pt_br: Extraindo de %d arquivos Go com xgotext...
ru: Извлечение из %d Go-файлов с помощью xgotext...
tr: %d Go dosyasından xgotext ile çıkarılıyor...
uk: Витягнення з %d Go-файлів за допомогою xgotext...

source: Extracting from %d non-Go files with xgettext...
ar: استخراج من %d ملف غير Go باستخدام xgettext...
de: Extrahiere aus %d Nicht-Go-Dateien mit xgettext...
es: Extrayendo de %d archivos que no son Go con xgettext...
fr: Extraction depuis %d fichiers non-Go avec xgettext...
it: Estrazione da %d file non-Go con xgettext...
ja: %d 件の非Goファイルからxgettextで抽出中...
pl: Ekstrakcja z %d nie-Go plików przy użyciu xgettext...
pt_br: Extraindo de %d arquivos não-Go com xgettext...
ru: Извлечение из %d не-Go-файлов с помощью xgettext...
tr: %d Go olmayan dosyadan xgettext ile çıkarılıyor...
uk: Витягнення з %d не-Go-файлів за допомогою xgettext...

source: Show project info and translation statistics
ar: عرض معلومات المشروع وإحصائيات الترجمة
de: Projektinfo und Übersetzungsstatistiken anzeigen
es: Mostrar información del proyecto y estadísticas de traducción
fr: Afficher les informations du projet et les statistiques de traduction
it: Mostra informazioni sul progetto e statistiche di traduzione
ja: プロジェクト情報と翻訳統計を表示
pl: Pokaż informacje o projekcie i statystyki tłumaczeń
pt_br: Mostrar informações do projeto e estatísticas de tradução
ru: Показать информацию о проекте и статистику переводов
tr: Proje bilgisini ve çeviri istatistiklerini göster
uk: Показати інформацію про проєкт і статистику перекладу

source: xgettext extraction failed: %w
ar: فشل استخراج xgettext: %w
de: xgettext-Extraktion fehlgeschlagen: %w
es: falló la extracción con xgettext: %w
fr: échec de l'extraction xgettext : %w
it: estrazione xgettext non riuscita: %w
ja: xgettextによる抽出に失敗しました: %w
pl: błąd ekstrakcji xgettext: %w
pt_br: extração xgettext falhou: %w
ru: ошибка извлечения xgettext: %w
tr: xgettext çıkarımı başarısız: %w
uk: помилка витягу xgettext: %w

source: Show auto-detected project structure and translation statistics. Displays project type (gettext, po4a, i18next, android), file structure, detected languages, and per-language translation progress. For projects configured via lokit.yaml, shows each target separately. Does not modify any files.
ar: عرض هيكل المشروع المكتشف تلقائيًا وإحصائيات الترجمة. يعرض نوع المشروع (gettext، po4a، i18next، android)، هيكل الملفات، اللغات المكتشفة، وتقدم الترجمة لكل لغة. للمشاريع المضبوطة عبر lokit.yaml، يعرض كل هدف على حدة. لا يتم تعديل أي ملفات.
de: Automatisch erkannte Projektstruktur und Übersetzungsstatistiken anzeigen. Zeigt Projekttyp (gettext, po4a, i18next, android), Dateistruktur, erkannte Sprachen und Übersetzungsfortschritt pro Sprache. Für Projekte, die über lokit.yaml konfiguriert sind, werden die einzelnen Ziele separat angezeigt. Es werden keine Dateien verändert.
es: Mostrar la estructura del proyecto auto-detectada y estadísticas de traducción. Muestra el tipo de proyecto (gettext, po4a, i18next, android), estructura de archivos, idiomas detectados y progreso de traducción por idioma. Para proyectos configurados vía lokit.yaml, muestra cada target por separado. No modifica ningún archivo.
fr: Afficher la structure du projet détectée automatiquement et les statistiques de traduction. Affiche le type de projet (gettext, po4a, i18next, android), la structure des fichiers, les langues détectées et l'avancement de la traduction par langue. Pour les projets configurés via lokit.yaml, affiche chaque cible séparément. Ne modifie aucun fichier.
it: Mostra la struttura del progetto rilevata automaticamente e le statistiche di traduzione. Visualizza il tipo di progetto (gettext, po4a, i18next, android), la struttura dei file, le lingue rilevate e l'avanzamento della traduzione per lingua. Per i progetti configurati tramite lokit.yaml, mostra ogni target separatamente. Non modifica alcun file.
ja: 自動検出されたプロジェクト構成と翻訳統計を表示します。 プロジェクトタイプ（gettext、po4a、i18next、android）、ファイル構成、 検出された言語、言語ごとの翻訳進捗を表示します。 lokit.yamlで設定されたプロジェクトの場合、各ターゲットごとに表示します。 ファイルの変更は行いません。
pl: Pokaż automatycznie wykrytą strukturę projektu i statystyki tłumaczeń. Wyświetla typ projektu (gettext, po4a, i18next, android), strukturę plików, wykryte języki oraz postęp tłumaczeń dla każdego języka. Dla projektów skonfigurowanych przez lokit.yaml pokazuje każdy cel osobno. Nie modyfikuje żadnych plików.
pt_br: Mostrar estrutura do projeto auto-detectada e estatísticas de tradução. Exibe o tipo de projeto (gettext, po4a, i18next, android), estrutura de arquivos, idiomas detectados e progresso de tradução por idioma. Para projetos configurados via lokit.yaml, mostra cada alvo separadamente. Não modifica nenhum arquivo.
ru: Показать автоматически определённую структуру проекта и статистику перевода. Отображает тип проекта (gettext, po4a, i18next, android), структуру файлов, обнаруженные языки и прогресс перевода по каждому языку. Для проектов, настроенных через lokit.yaml, показывает каждую цель отдельно. Не изменяет файлы.
tr: Otomatik algılanan proje yapısını ve çeviri istatistiklerini göster. Proje tipini (gettext, po4a, i18next, android), dosya yapısını, tespit edilen dilleri ve dil başına çeviri ilerlemesini gösterir. lokit.yaml ile yapılandırılmış projelerde her hedef ayrı ayrı gösterilir. Hiçbir dosyada değişiklik yapmaz.
uk: Показати автоматично визначену структуру проєкту та статистику перекладу. Відображає тип проєкту (gettext, po4a, i18next, android), структуру файлів, виявлені мови та прогрес перекладу по кожній мові. Для проєктів з lokit.yaml показує кожну ціль окремо. Файли не змінюються.
