Repository: minios-linux/lokit
Catalog: po/*.po
Languages: ar, de, es, fr, it, ja, pl, pt_br, ru, tr, uk

source: Languages to init (comma-separated, default: all from config)
ar: اللغات المطلوب تهيئتها (مفصولة بفواصل، الافتراضي: جميع اللغات من الإعدادات)
de: Zu initialisierende Sprachen (kommagetrennt, Standard: alle aus der Konfiguration)
es: Idiomas a inicializar (separados por coma, predeterminado: todos desde la configuración)
fr: Langues à initialiser (séparées par des virgules, défaut : toutes depuis la config)
it: Lingue da inizializzare (separate da virgola, predefinito: tutte da config)
ja: 初期化対象言語（カンマ区切り、デフォルト: 設定ファイルの全言語）
pl: Języki do inicjalizacji (oddzielone przecinkami, domyślnie: wszystkie z konfiguracji)
pt_br: Idiomas para inicializar (separados por vírgula, padrão: todos do config)
ru: Языки для инициализации (через запятую, по умолчанию: все из конфигурации)
tr: Başlatılacak diller (virgülle ayrılmış, varsayılan: yapılandırmadan tümü)
uk: Мови для ініціалізації (через кому, за замовчуванням: всі з конфігурації)

source: Android targets do not require init — use 'lokit translate' directly.
ar: أهداف Android لا تتطلب التهيئة — استخدم 'lokit translate' مباشرة.
de: Android-Ziele benötigen keine Initialisierung — verwenden Sie direkt 'lokit translate'.
es: Los targets de Android no requieren inicialización; usa 'lokit translate' directamente.
fr: Les cibles Android ne nécessitent pas d'init — utilisez directement 'lokit translate'.
it: I target Android non richiedono l'inizializzazione — usa direttamente 'lokit translate'.
ja: Androidターゲットは初期化不要です — 直接 'lokit translate' をご利用ください。
pl: Cele Android nie wymagają inicjalizacji — użyj bezpośrednio 'lokit translate'.
pt_br: Alvos Android não requerem init — use 'lokit translate' diretamente.
ru: Для Android-целей инициализация не требуется — используйте 'lokit translate' напрямую.
tr: Android hedeflerinde başlatma gerekmez — doğrudan 'lokit translate' komutunu kullanın.
uk: Для цілей Android ініціалізація не потрібна — використовуйте 'lokit translate' напряму.

source: Cannot find source YAML file for language %q in %s
ar: تعذر العثور على ملف YAML المصدر للغة %q في %s
de: Kann YAML-Quelldatei für Sprache %q in %s nicht finden
es: No se puede encontrar el archivo YAML de origen para el idioma %q en %s
fr: Impossible de trouver le fichier source YAML pour la langue %q dans %s
it: Impossibile trovare il file YAML sorgente per la lingua %q in %s
ja: 言語 %q 用のソースYAMLファイルが %s に見つかりません
pl: Nie można znaleźć pliku źródłowego YAML dla języka %q w %s
pt_br: Não foi possível encontrar o arquivo YAML de origem para o idioma %q em %s
ru: Не удалось найти исходный YAML-файл для языка %q в %s
tr: Dil %q için kaynak YAML dosyası %s içinde bulunamadı
uk: Не вдалося знайти вихідний YAML-файл для мови %q у %s

source: Expected: %s
ar: المتوقع: %s
de: Erwartet: %s
es: Esperado: %s
fr: Attendu : %s
it: Atteso: %s
ja: 期待値: %s
pl: Oczekiwano: %s
pt_br: Esperado: %s
ru: Ожидалось: %s
tr: Beklenen: %s
uk: Очікується: %s

source: Cannot read source YAML file %s: %v
ar: تعذر قراءة ملف YAML المصدر %s: %v
de: Kann YAML-Quelldatei %s nicht lesen: %v
es: No se puede leer el archivo YAML de origen %s: %v
fr: Impossible de lire le fichier source YAML %s : %v
it: Impossibile leggere il file YAML sorgente %s: %v
ja: ソースYAMLファイル %s を読み込めません: %v
pl: Nie można odczytać pliku źródłowego YAML %s: %v
pt_br: Não foi possível ler o arquivo YAML de origem %s: %v
ru: Не удалось прочитать исходный YAML-файл %s: %v
tr: Kaynak YAML dosyası %s okunamıyor: %v
uk: Не вдалося прочитати вихідний YAML-файл %s: %v

source: Source language (%s): %d keys
ar: لغة المصدر (%s): %d مفتاح
de: Quellsprache (%s): %d Schlüssel
es: Idioma de origen (%s): %d claves
fr: Langue source (%s) : %d clés
it: Lingua sorgente (%s): %d chiavi
ja: ソース言語（%s）：%dキー
pl: Język źródłowy (%s): %d kluczy
pt_br: Idioma de origem (%s): %d chaves
ru: Исходный язык (%s): %d ключей
tr: Kaynak dil (%s): %d anahtar
uk: Мова джерела (%s): %d ключів

source: Creating directory %s: %v
ar: إنشاء المجلد %s: %v
de: Erstelle Verzeichnis %s: %v
es: Creando directorio %s: %v
fr: Création du répertoire %s : %v
it: Creazione directory %s: %v
ja: ディレクトリ %s を作成中: %v
pl: Tworzenie katalogu %s: %v
pt_br: Criando diretório %s: %v
ru: Создание директории %s: %v
tr: Dizin oluşturuluyor %s: %v
uk: Створення директорії %s: %v

source: Creating %s: %v
ar: جاري إنشاء %s: %v
de: %s wird erstellt: %v
es: Creando %s: %v
fr: Création de %s : %v
it: Creazione di %s: %v
ja: %s を作成中: %v
pl: Tworzenie %s: %v
pt_br: Criando %s: %v
ru: Создание %s: %v
tr: %s oluşturuluyor: %v
uk: Створення %s: %v

source: Created: %s (%d keys)
ar: تم الإنشاء: %s (%d مفاتيح)
de: Erstellt: %s (%d Schlüssel)
es: Creado: %s (%d claves)
fr: Créé : %s (%d clés)
it: Creato: %s (%d chiavi)
ja: 作成済み: %s（%d キー）
pl: Utworzono: %s (%d kluczy)
pt_br: Criado: %s (%d chaves)
ru: Создано: %s (%d ключей)
tr: Oluşturuldu: %s (%d anahtar)
uk: Створено: %s (%d ключів)

source: Reading %s: %v
ar: جاري قراءة %s: %v
de: %s wird gelesen: %v
es: Leyendo %s: %v
fr: Lecture de %s : %v
it: Lettura di %s: %v
ja: %s を読み込み中: %v
pl: Odczytywanie %s: %v
pt_br: Lendo %s: %v
ru: Чтение %s: %v
tr: %s okunuyor: %v
uk: Зчитування %s: %v

source: Writing %s: %v
ar: جاري الكتابة %s: %v
de: %s wird geschrieben: %v
es: Escribiendo %s: %v
fr: Écriture de %s : %v
it: Scrittura di %s: %v
ja: %s を書き込み中: %v
pl: Zapisywanie %s: %v
pt_br: Gravando %s: %v
ru: Запись %s: %v
tr: %s yazılıyor: %v
uk: Запис %s: %v

source: Updated: %s
ar: تم التحديث: %s
de: Aktualisiert: %s
es: Actualizado: %s
fr: Mis à jour : %s
it: Aggiornato: %s
ja: 更新済み: %s
pl: Zaktualizowano: %s
pt_br: Atualizado: %s
ru: Обновлено: %s
tr: Güncellendi: %s
uk: Оновлено: %s

source: YAML init: %d created, %d updated
ar: تهيئة YAML: تم إنشاء %d، تم تحديث %d
de: YAML-Init: %d erstellt, %d aktualisiert
es: YAML init: %d creados, %d actualizados
fr: Initialisation YAML : %d créé, %d mis à jour
it: YAML init: %d creati, %d aggiornati
ja: YAML初期化: %d件作成、%d件更新
pl: Inicjalizacja YAML: utworzono %d, zaktualizowano %d
pt_br: YAML init: %d criado, %d atualizado
ru: Инициализация YAML: создано — %d, обновлено — %d
tr: YAML başlatma: %d oluşturuldu, %d güncellendi
uk: YAML ініціалізація: створено %d, оновлено %d

source: Cannot read source language file %s: %v
ar: تعذر قراءة ملف لغة المصدر %s: %v
de: Quelldatei der Sprache %s kann nicht gelesen werden: %v
es: No se puede leer el archivo de idioma fuente %s: %v
fr: Impossible de lire le fichier de langue source %s : %v
it: Impossibile leggere il file della lingua sorgente %s: %v
ja: ソース言語ファイル %s を読み込めません: %v
pl: Nie można odczytać pliku języka źródłowego %s: %v
pt_br: Não foi possível ler o arquivo de idioma fonte %s: %v
ru: Не удалось прочитать файл исходного языка %s: %v
tr: Kaynak dil dosyası %s okunamıyor: %v
uk: Не вдалося прочитати файл мовного джерела %s: %v

source: Updating %s: %v
ar: جاري تحديث %s: %v
de: %s wird aktualisiert: %v
es: Actualizando %s: %v
fr: Mise à jour de %s : %v
it: Aggiornamento di %s: %v
ja: %s を更新中: %v
pl: Aktualizowanie %s: %v
pt_br: Atualizando %s: %v
ru: Обновление %s: %v
tr: %s güncelleniyor: %v
uk: Оновлення %s: %v

source: Updated: %s (+%d new keys)
ar: تم التحديث: %s (+%d مفاتيح جديدة)
de: Aktualisiert: %s (+%d neue Schlüssel)
es: Actualizado: %s (+%d claves nuevas)
fr: Mis à jour : %s (+%d nouvelles clés)
it: Aggiornato: %s (+%d nuove chiavi)
ja: 更新済み: %s（新規 %d キー追加）
pl: Zaktualizowano: %s (+%d nowych kluczy)
pt_br: Atualizado: %s (+%d novas chaves)
ru: Обновлено: %s (+%d новых ключей)
tr: Güncellendi: %s (+%d yeni anahtar)
uk: Оновлено: %s (+%d нових ключів)

source: %s: up to date
ar: %s: محدّث
de: %s: aktuell
es: %s: actualizado
fr: %s : à jour
it: %s: aggiornato
ja: %s: 最新です
pl: %s: aktualne
pt_br: %s: atualizado
ru: %s: актуально
tr: %s: güncel
uk: %s: актуально

source: Summary: %d created, %d updated
ar: الملخص: %d تم إنشاؤها، %d تم تحديثها
de: Übersicht: %d erstellt, %d aktualisiert
es: Resumen: %d creados, %d actualizados
fr: Résumé : %d créés, %d mis à jour
it: Riepilogo: %d creati, %d aggiornati
ja: 概要: %d 件作成、%d 件更新
pl: Podsumowanie: %d utworzonych, %d zaktualizowanych
pt_br: Resumo: %d criado(s), %d atualizado(s)
ru: Итого: создано — %d, обновлено — %d
tr: Özet: %d oluşturuldu, %d güncellendi
uk: Підсумок: %d створено, %d оновлено

source: Init complete!
ar: تم اكتمال التهيئة!
de: Initialisierung abgeschlossen!
es: ¡Inicialización completa!
fr: Initialisation terminée !
it: Inizializzazione completata!
ja: 初期化が完了しました！
pl: Inicjalizacja zakończona!
pt_br: Inicialização concluída!
ru: Инициализация завершена!
tr: Başlatma tamamlandı!
uk: Ініціалізацію завершено!

source: pandoc not found, skipping manpage generation from markdown
ar: لم يتم العثور على pandoc، سيتم تخطي توليد صفحة الدليل من markdown
de: pandoc nicht gefunden, Manpage-Generierung aus Markdown wird übersprungen
es: pandoc no encontrado, omitiendo la generación de manpage desde markdown
fr: pandoc non trouvé, génération de la page de manuel depuis le markdown ignorée
it: pandoc non trovato, generazione della manpage da markdown saltata
ja: pandoc が見つかりません。Markdown からの man ページ生成をスキップします
pl: Nie znaleziono pandoc, pomijam generowanie manpage z markdown
pt_br: pandoc não encontrado, pulando a geração do manpage a partir do markdown
ru: pandoc не найден, пропускаем генерацию man-страницы из markdown
tr: pandoc bulunamadı, markdown'dan man sayfası oluşturma atlanıyor
uk: pandoc не знайдено, пропускаю генерацію man-сторінки з markdown

source: failed to list markdown files: %w
ar: فشل في سرد ملفات markdown: %w
de: Fehler beim Auflisten der Markdown-Dateien: %w
es: no se pudo listar archivos markdown: %w
fr: impossible de lister les fichiers markdown : %w
it: impossibile elencare i file markdown: %w
ja: Markdownファイルの一覧取得に失敗しました: %w
pl: nie udało się wylistować plików markdown: %w
pt_br: falha ao listar arquivos markdown: %w
ru: не удалось получить список файлов Markdown: %w
tr: Markdown dosyalarını listeleme başarısız: %w
uk: не вдалося отримати список файлів Markdown: %w

source: Generating %s from %s
ar: جاري التوليد %s من %s
de: %s wird aus %s generiert
es: Generando %s desde %s
fr: Génération de %s à partir de %s
it: Generazione di %s da %s
ja: %s を %s から生成中
pl: Generowanie %s z %s
pt_br: Gerando %s a partir de %s
ru: Генерация %s из %s
tr: %s, %s üzerinden oluşturuluyor
uk: Генерую %s з %s

source: pandoc failed for %s: %w
ar: فشل pandoc لـ %s: %w
de: Pandoc-Fehler für %s: %w
es: pandoc falló para %s: %w
fr: échec de pandoc pour %s : %w
it: pandoc non riuscito per %s: %w
ja: pandocの実行に失敗しました（%s）: %w
pl: pandoc nie powiódł się dla %s: %w
pt_br: pandoc falhou para %s: %w
ru: ошибка pandoc для %s: %w
tr: pandoc %s için başarısız oldu: %w
uk: помилка Pandoc для %s: %w

source: Failed to post-process %s: %v
ar: فشل في المعالجة اللاحقة لـ %s: %v
de: %s konnte nicht nachbearbeitet werden: %v
es: Error al postprocesar %s: %v
fr: Échec du post-traitement de %s : %v
it: Impossibile post-processare %s: %v
ja: %s の後処理に失敗しました: %v
pl: Nie udało się przetworzyć %s: %v
pt_br: Falha ao pós-processar %s: %v
ru: Не удалось выполнить постобработку %s: %v
tr: %s sonrası işlem başarısız: %v
uk: Не вдалося обробити %s: %v

source: Generated %d manpage(s) from markdown
ar: تم توليد %d صفحة دليل من markdown
de: %d Manpage(s) aus Markdown generiert
es: Se generaron %d manpage(s) desde markdown
fr: %d page(s) de manuel générée(s) depuis le markdown
it: Generate %d manpage da markdown
ja: Markdown から %d 件の man ページを生成しました
pl: Wygenerowano %d manpage z markdown
pt_br: Gerado(s) %d manpage(s) a partir do markdown
ru: Сгенерировано %d man-страниц из markdown
tr: Markdown'dan %d man sayfası oluşturuldu
uk: Згенеровано %d man-сторінок з markdown

source: po4a is not installed. Install with: sudo apt install po4a
ar: po4a غير مثبت. قم بالتثبيت عبر: sudo apt install po4a
de: po4a ist nicht installiert. Installieren Sie es mit: sudo apt install po4a
es: po4a no está instalado. Instala con: sudo apt install po4a
fr: po4a n'est pas installé. Installez-le avec : sudo apt install po4a
it: po4a non è installato. Installa con: sudo apt install po4a
ja: po4a がインストールされていません。インストールするには: sudo apt install po4a
pl: po4a nie jest zainstalowane. Zainstaluj poleceniem: sudo apt install po4a
pt_br: po4a não está instalado. Instale com: sudo apt install po4a
ru: po4a не установлен. Установите с помощью: sudo apt install po4a
tr: po4a yüklü değil. Kurmak için: sudo apt install po4a
uk: po4a не встановлено. Встановіть командою: sudo apt install po4a

source: Failed to generate manpages from markdown: %v
ar: فشل في توليد صفحات الدليل من markdown: %v
de: Manpages konnten nicht aus Markdown generiert werden: %v
es: No se pudo generar manpages desde markdown: %v
fr: Échec de la génération des pages de manuel depuis le markdown : %v
it: Impossibile generare le manpage da markdown: %v
ja: Markdown から man ページの生成に失敗しました: %v
pl: Nie udało się wygenerować manpage z markdown: %v
pt_br: Falha ao gerar manpages a partir do markdown: %v
ru: Не удалось сгенерировать man-страницы из markdown: %v
tr: Markdown'dan man sayfası oluşturulamadı: %v
uk: Не вдалося згенерувати man-сторінки з markdown: %v

source: Continuing anyway, po4a might fail if source files don't exist
ar: سيتم المتابعة على أي حال، قد يفشل po4a إذا لم تكن ملفات المصدر موجودة
de: Fortsetzung trotzdem, po4a könnte fehlschlagen, wenn Quelldateien fehlen
es: Continuando de todas formas, po4a podría fallar si los archivos fuente no existen
fr: Poursuite de l'exécution, po4a peut échouer si les fichiers sources sont absents
it: Si continua comunque, po4a potrebbe fallire se i file sorgente non esistono
ja: このまま続行しますが、ソースファイルが存在しない場合は po4a が失敗する可能性があります
pl: Kontynuuję mimo to, po4a może się nie powieść, jeśli pliki źródłowe nie istnieją
pt_br: Continuando mesmo assim, po4a pode falhar se os arquivos de origem não existirem
ru: Продолжаем работу, po4a может завершиться с ошибкой, если исходные файлы отсутствуют
tr: Yine de devam ediliyor, kaynak dosyalar yoksa po4a başarısız olabilir
uk: Продовжуємо, po4a може не спрацювати, якщо вихідні файли відсутні

source: Running po4a --no-translations %s ...
ar: تشغيل po4a --no-translations %s ...
de: Führe po4a --no-translations %s aus ...
es: Ejecutando po4a --no-translations %s ...
fr: Exécution de po4a --no-translations %s ...
it: Esecuzione di po4a --no-translations %s ...
ja: po4a --no-translations %s を実行中...
pl: Uruchamianie po4a --no-translations %s ...
pt_br: Executando po4a --no-translations %s ...
ru: Выполняется po4a --no-translations %s ...
tr: po4a --no-translations %s çalıştırılıyor ...
uk: Виконую po4a --no-translations %s ...

source: po4a failed: %v
ar: فشل po4a: %v
de: po4a fehlgeschlagen: %v
es: po4a falló: %v
fr: Échec de po4a : %v
it: po4a non riuscito: %v
ja: po4a の実行に失敗しました: %v
pl: po4a zakończyło się błędem: %v
pt_br: po4a falhou: %v
ru: Ошибка po4a: %v
tr: po4a başarısız oldu: %v
uk: po4a завершився з помилкою: %v

source: po4a updated POT and PO files
ar: قام po4a بتحديث ملفات POT و PO
de: po4a hat POT- und PO-Dateien aktualisiert
es: po4a actualizó los archivos POT y PO
fr: po4a a mis à jour les fichiers POT et PO
it: po4a ha aggiornato i file POT e PO
ja: po4a が POT および PO ファイルを更新しました
pl: po4a zaktualizowało pliki POT i PO
pt_br: po4a atualizou os arquivos POT e PO
ru: po4a обновил файлы POT и PO
tr: po4a POT ve PO dosyalarını güncelledi
uk: po4a оновив файли POT та PO

source: Updating PO files for: %s
ar: تحديث ملفات PO لـ: %s
de: PO-Dateien werden aktualisiert für: %s
es: Actualizando archivos PO para: %s
fr: Mise à jour des fichiers PO pour : %s
it: Aggiornamento dei file PO per: %s
ja: %s の PO ファイルを更新中
pl: Aktualizowanie plików PO dla: %s
pt_br: Atualizando arquivos PO para: %s
ru: Обновление PO-файлов для: %s
tr: Şunun için PO dosyaları güncelleniyor: %s
uk: Оновлення PO-файлів для: %s

source: Creating directory for %s: %v
ar: جاري إنشاء مجلد لـ %s: %v
de: Verzeichnis für %s wird erstellt: %v
es: Creando directorio para %s: %v
fr: Création du répertoire pour %s : %v
it: Creazione della directory per %s: %v
ja: %s 用のディレクトリを作成中: %v
pl: Tworzenie katalogu dla %s: %v
pt_br: Criando diretório para %s: %v
ru: Создание директории для %s: %v
tr: %s için dizin oluşturuluyor: %v
uk: Створення директорії для %s: %v

source: Created: %s
ar: تم الإنشاء: %s
de: Erstellt: %s
es: Creado: %s
fr: Créé : %s
it: Creato: %s
ja: 作成済み: %s
pl: Utworzono: %s
pt_br: Criado: %s
ru: Создано: %s
tr: Oluşturuldu: %s
uk: Створено: %s

source: Translate files using AI
ar: ترجمة الملفات باستخدام الذكاء الاصطناعي
de: Dateien mit KI übersetzen
es: Traducir archivos usando IA
fr: Traduire des fichiers avec l'IA
it: Traduci file utilizzando l'AI
ja: AI を使ってファイルを翻訳
pl: Tłumacz pliki za pomocą AI
pt_br: Traduzir arquivos usando IA
ru: Перевод файлов с помощью ИИ
tr: Dosyaları yapay zekâ ile çevir
uk: Перекладайте файли за допомогою AI
