Repository: minios-linux/lokit
Catalog: po/*.po
Languages: ar, de, es, fr, it, ja, pl, pt_br, ru, tr, uk

source: Go extraction failed: %v
ar: فشل استخراج Go: %v
de: Go-Extraktion fehlgeschlagen: %v
es: Error en la extracción de Go: %v
fr: Échec de l'extraction Go : %v
it: Estrazione Go non riuscita: %v
ja: Goファイルの抽出に失敗しました: %v
pl: Błąd ekstrakcji Go: %v
pt_br: Falha na extração Go: %v
ru: Ошибка извлечения из Go: %v
tr: Go çıkarımı başarısız: %v
uk: Помилка витягнення з Go: %v

source: Continuing with xgettext results only
ar: المتابعة بنتائج xgettext فقط
de: Es wird nur mit den xgettext-Ergebnissen fortgefahren
es: Continuando solo con los resultados de xgettext
fr: Poursuite uniquement avec les résultats de xgettext
it: Continuo solo con i risultati di xgettext
ja: xgettextの結果のみで続行します
pl: Kontynuowanie tylko z wynikami xgettext
pt_br: Continuando apenas com os resultados do xgettext
ru: Продолжаем только с результатами xgettext
tr: Sadece xgettext sonuçlarıyla devam ediliyor
uk: Продовжуємо лише з результатами xgettext

source: Merging POT files...
ar: جاري دمج ملفات POT...
de: POT-Dateien werden zusammengeführt...
es: Combinando archivos POT...
fr: Fusion des fichiers POT...
it: Unione dei file POT...
ja: POTファイルをマージ中...
pl: Scalanie plików POT...
pt_br: Mesclando arquivos POT...
ru: Объединение файлов POT...
tr: POT dosyaları birleştiriliyor...
uk: Об’єднання POT-файлів...

source: merging POT files: %w
ar: جاري دمج ملفات POT: %w
de: POT-Dateien werden zusammengeführt: %w
es: fusionando archivos POT: %w
fr: fusion des fichiers POT : %w
it: unione file POT: %w
ja: POTファイルのマージ中: %w
pl: scalanie plików POT: %w
pt_br: mesclando arquivos POT: %w
ru: слияние файлов POT: %w
tr: POT dosyaları birleştiriliyor: %w
uk: злиття POT-файлів: %w

source: extraction failed: %w
ar: فشل الاستخراج: %w
de: Extraktion fehlgeschlagen: %w
es: falló la extracción: %w
fr: échec de l'extraction : %w
it: estrazione non riuscita: %w
ja: 抽出に失敗しました: %w
pl: błąd ekstrakcji: %w
pt_br: falha na extração: %w
ru: ошибка извлечения: %w
tr: çıkarma başarısız: %w
uk: помилка витягу: %w

source: Go extraction failed: %w
ar: فشل استخراج Go: %w
de: Go-Extraktion fehlgeschlagen: %w
es: Falló la extracción Go: %w
fr: échec de l'extraction Go : %w
it: estrazione Go non riuscita: %w
ja: Go抽出に失敗しました: %w
pl: Błąd ekstrakcji Go: %w
pt_br: Extração Go falhou: %w
ru: ошибка извлечения Go: %w
tr: Go çıkarımı başarısız: %w
uk: помилка витягу Go: %w

source: Extracted %d strings to %s
ar: تم استخراج %d سلسلة إلى %s
de: %d Zeichenketten nach %s extrahiert
es: Se extrajeron %d cadenas a %s
fr: %d chaînes extraites vers %s
it: Estratte %d stringhe in %s
ja: %d 件の文字列を %s に抽出しました
pl: Wyodrębniono %d ciągów do %s
pt_br: Extraídas %d strings para %s
ru: Извлечено %d строк в %s
tr: %d metin %s dosyasına çıkarıldı
uk: Витягнуто %d рядків у %s

source: Extracted strings to %s
ar: تم استخراج السلاسل إلى %s
de: Zeichenketten nach %s extrahiert
es: Cadenas extraídas a %s
fr: Chaînes extraites vers %s
it: Stringhe estratte in %s
ja: 文字列を %s に抽出しました
pl: Wyodrębniono ciągi do %s
pt_br: Strings extraídas para %s
ru: Строки извлечены в %s
tr: Metinler %s dosyasına çıkarıldı
uk: Витягнуто рядки у %s

source: No POT template found, running extraction...
ar: لم يتم العثور على قالب POT، جاري تنفيذ الاستخراج...
de: Keine POT-Vorlage gefunden, Extraktion wird gestartet...
es: No se encontró plantilla POT, ejecutando extracción...
fr: Aucun modèle POT trouvé, lancement de l'extraction...
it: Nessun template POT trovato, avvio estrazione...
ja: POTテンプレートが見つかりません。抽出を実行します...
pl: Nie znaleziono szablonu POT, uruchamianie ekstrakcji...
pt_br: Nenhum template POT encontrado, iniciando extração...
ru: POT-шаблон не найден, запускается извлечение...
tr: POT şablonu bulunamadı, çıkarım başlatılıyor...
uk: POT-шаблон не знайдено, запускаємо витягнення...

source: Auto-extraction failed: %v
ar: فشل الاستخراج التلقائي: %v
de: Auto-Extraktion fehlgeschlagen: %v
es: La extracción automática falló: %v
fr: Échec de l'auto-extraction : %v
it: Estrazione automatica non riuscita: %v
ja: 自動抽出に失敗しました: %v
pl: Automatyczna ekstrakcja nie powiodła się: %v
pt_br: Falha na extração automática: %v
ru: Автоматическое извлечение не удалось: %v
tr: Otomatik çıkarım başarısız: %v
uk: Автовитягнення не вдалося: %v

source: Cannot auto-create %s: extraction produced no POT template
ar: تعذر إنشاء %s تلقائيًا: لم ينتج الاستخراج قالب POT
de: %s kann nicht automatisch erstellt werden: Extraktion hat keine POT-Vorlage erzeugt
es: No se puede crear automáticamente %s: la extracción no generó una plantilla POT
fr: Impossible de créer automatiquement %s : l'extraction n'a produit aucun modèle POT
it: Impossibile creare automaticamente %s: l’estrazione non ha prodotto alcun template POT
ja: %s を自動作成できません: 抽出結果にPOTテンプレートがありません
pl: Nie można automatycznie utworzyć %s: ekstrakcja nie wygenerowała szablonu POT
pt_br: Não foi possível criar %s automaticamente: a extração não gerou um template POT
ru: Не удалось автоматически создать %s: извлечение не дало POT-шаблон
tr: %s otomatik oluşturulamıyor: çıkarım sonucu POT şablonu üretilmedi
uk: Не вдалося автоматично створити %s: витягнення не дало POT-шаблону

source: Check that source files contain translatable strings (_(), N_(), etc.)
ar: تأكد من أن ملفات المصدر تحتوي على سلاسل قابلة للترجمة (_(), N_()، إلخ)
de: Stellen Sie sicher, dass die Quelldateien übersetzbare Zeichenketten enthalten (_(), N_(), usw.)
es: Verifica que los archivos fuente contengan cadenas traducibles (_(), N_(), etc.)
fr: Vérifiez que les fichiers sources contiennent des chaînes à traduire (_(), N_(), etc.)
it: Verifica che i file sorgente contengano stringhe traducibili (_(), N_(), ecc.)
ja: ソースファイルに翻訳対象の文字列（_(), N_() など）が含まれているかご確認ください
pl: Upewnij się, że pliki źródłowe zawierają tłumaczone ciągi (_(), N_() itp.)
pt_br: Verifique se os arquivos-fonte contêm strings traduzíveis (_(), N_(), etc.)
ru: Проверьте, что исходные файлы содержат переводимые строки (_(), N_() и т.д.)
tr: Kaynak dosyaların çevrilebilir metinler içerdiğinden emin olun (_(), N_() vb.)
uk: Перевірте, що у вихідних файлах є рядки для перекладу (_(), N_() тощо)

source: Cannot read POT template %s: %v
ar: تعذر قراءة قالب POT %s: %v
de: POT-Vorlage %s kann nicht gelesen werden: %v
es: No se puede leer la plantilla POT %s: %v
fr: Impossible de lire le modèle POT %s : %v
it: Impossibile leggere il template POT %s: %v
ja: POTテンプレート %s を読み込めません: %v
pl: Nie można odczytać szablonu POT %s: %v
pt_br: Não foi possível ler o template POT %s: %v
ru: Не удалось прочитать POT-шаблон %s: %v
tr: POT şablonu %s okunamıyor: %v
uk: Не вдалося прочитати POT-шаблон %s: %v

source: Auto-created %s from %s (%d entries)
ar: تم إنشاء %s تلقائيًا من %s (%d مدخلة)
de: %s automatisch aus %s erstellt (%d Einträge)
es: Creado automáticamente %s desde %s (%d entradas)
fr: %s créé automatiquement à partir de %s (%d entrées)
it: Creato automaticamente %s da %s (%d voci)
ja: %s を %s から自動作成しました（%d 件）
pl: Automatycznie utworzono %s z %s (%d wpisów)
pt_br: Criado automaticamente %s a partir de %s (%d entradas)
ru: Автоматически создан %s из %s (%d элементов)
tr: %s, %s dosyasından otomatik oluşturuldu (%d kayıt)
uk: Автоматично створено %s з %s (%d записів)

source: check provider documentation
ar: راجع توثيق المزود
de: Siehe Anbieterdokumentation
es: consulta la documentación del proveedor
fr: voir la documentation du fournisseur
it: consulta la documentazione del provider
ja: プロバイダーのドキュメントを確認してください
pl: sprawdź dokumentację dostawcy
pt_br: verifique a documentação do provedor
ru: см. документацию провайдера
tr: sağlayıcı dokümantasyonuna bakın
uk: перевірте документацію провайдера

source: --model is required for provider '%s' Example models for %s: %s Usage: --provider %s --model MODEL_NAME
ar: --model مطلوب للمزود '%s' نماذج مقترحة لـ %s: %s الاستخدام: --provider %s --model MODEL_NAME
de: --model ist für Anbieter '%s' erforderlich Beispielmodelle für %s: %s Verwendung: --provider %s --model MODELLNAME
es: --model es obligatorio para el proveedor '%s' Modelos de ejemplo para %s: %s Uso: --provider %s --model NOMBRE_DEL_MODELO
fr: --model est requis pour le fournisseur '%s' Exemples de modèles pour %s : %s Utilisation : --provider %s --model NOM_DU_MODÈLE
it: --model è obbligatorio per il provider '%s' Modelli di esempio per %s: %s Utilizzo: --provider %s --model MODEL_NAME
ja: --modelはプロバイダー「%s」で必須です %sの例: %s 使用方法: --provider %s --model MODEL_NAME
pl: --model jest wymagany dla dostawcy '%s' Przykładowe modele dla %s: %s Użycie: --provider %s --model NAZWA_MODELU
pt_br: --model é obrigatório para o provedor '%s' Modelos de exemplo para %s: %s Uso: --provider %s --model NOME_DO_MODELO
ru: --model обязателен для провайдера '%s' Примеры моделей для %s: %s Использование: --provider %s --model MODEL_NAME
tr: --model, '%s' sağlayıcısı için gereklidir %s için örnek modeller: %s Kullanım: --provider %s --model MODEL_ADI
uk: --model обов'язковий для провайдера '%s' Приклади моделей для %s: %s Використання: --provider %s --model MODEL_NAME

source: Config error: %v
ar: خطأ في التهيئة: %v
de: Konfigurationsfehler: %v
es: Error de configuración: %v
fr: Erreur de configuration : %v
it: Errore di configurazione: %v
ja: 設定エラー: %v
pl: Błąd konfiguracji: %v
pt_br: Erro de configuração: %v
ru: Ошибка конфигурации: %v
tr: Yapılandırma hatası: %v
uk: Помилка конфігурації: %v

source: provider 'google' requires an API key or Gemini OAuth login Option 1: Store an API key: lokit auth login --provider google Option 2: Login with Google OAuth (free tier: 60 req/min): lokit auth login --provider gemini Option 3: Pass key directly: --api-key YOUR_KEY or export GOOGLE_API_KEY=YOUR_KEY Get an API key from: https://aistudio.google.com/apikey
ar: المزود 'google' يتطلب مفتاح API أو تسجيل دخول Gemini OAuth الخيار 1: تخزين مفتاح API: lokit auth login --provider google الخيار 2: تسجيل الدخول عبر Google OAuth (المستوى المجاني: 60 طلب/دقيقة): lokit auth login --provider gemini الخيار 3: تمرير المفتاح مباشرة: --api-key YOUR_KEY أو export GOOGLE_API_KEY=YOUR_KEY احصل على مفتاح API من: https://aistudio.google.com/apikey
de: Provider 'google' benötigt einen API-Schlüssel oder Gemini-OAuth-Login Option 1: API-Schlüssel speichern: lokit auth login --provider google Option 2: Mit Google OAuth einloggen (Free-Tier: 60 Anfragen/min): lokit auth login --provider gemini Option 3: Schlüssel direkt übergeben: --api-key IHR_SCHLÜSSEL oder export GOOGLE_API_KEY=IHR_SCHLÜSSEL API-Schlüssel erhalten unter: https://aistudio.google.com/apikey
es: El proveedor 'google' requiere una clave API o inicio de sesión con Gemini OAuth Opción 1: Almacenar una clave API: lokit auth login --provider google Opción 2: Iniciar sesión con Google OAuth (nivel gratuito: 60 req/min): lokit auth login --provider gemini Opción 3: Pasar la clave directamente: --api-key TU_CLAVE o export GOOGLE_API_KEY=TU_CLAVE Obtén una clave API en: https://aistudio.google.com/apikey
fr: Le fournisseur 'google' nécessite une clé API ou une connexion Gemini OAuth Option 1 : Stocker une clé API : lokit auth login --provider google Option 2 : Connexion via Google OAuth (gratuit : 60 req/min) : lokit auth login --provider gemini Option 3 : Passer la clé directement : --api-key VOTRE_CLÉ ou export GOOGLE_API_KEY=VOTRE_CLÉ Obtenez une clé API sur : https://aistudio.google.com/apikey
it: Il provider 'google' richiede una chiave API o l'accesso OAuth Gemini Opzione 1: Salva una chiave API: lokit auth login --provider google Opzione 2: Accedi con Google OAuth (free tier: 60 richieste/min): lokit auth login --provider gemini Opzione 3: Passa la chiave direttamente: --api-key LA_TUA_CHIAVE oppure esporta GOOGLE_API_KEY=LA_TUA_CHIAVE Ottieni una chiave API da: https://aistudio.google.com/apikey
ja: provider 'google' にはAPIキーまたはGemini OAuthログインが必要です 方法1: APIキーを保存: lokit auth login --provider google 方法2: Google OAuthでログイン（無料枠: 60回/分）: lokit auth login --provider gemini 方法3: キーを直接渡す: --api-key YOUR_KEY または export GOOGLE_API_KEY=YOUR_KEY APIキー取得先: https://aistudio.google.com/apikey
pl: dostawca 'google' wymaga klucza API lub logowania przez Gemini OAuth Opcja 1: Zapisz klucz API: lokit auth login --provider google Opcja 2: Zaloguj się przez Google OAuth (darmowy limit: 60 żądań/min): lokit auth login --provider gemini Opcja 3: Przekaż klucz bezpośrednio: --api-key TWÓJ_KLUCZ lub eksportuj GOOGLE_API_KEY=TWÓJ_KLUCZ Uzyskaj klucz API: https://aistudio.google.com/apikey
pt_br: provedor 'google' requer uma chave de API ou login OAuth do Gemini Opção 1: Armazene uma chave de API: lokit auth login --provider google Opção 2: Faça login com Google OAuth (gratuito: 60 req/min): lokit auth login --provider gemini Opção 3: Passe a chave diretamente: --api-key SUA_CHAVE ou export GOOGLE_API_KEY=SUA_CHAVE Obtenha uma chave de API em: https://aistudio.google.com/apikey
ru: Провайдер 'google' требует API-ключ или вход через Gemini OAuth Вариант 1: Сохранить API-ключ: lokit auth login --provider google Вариант 2: Войти через Google OAuth (бесплатно: 60 запросов/мин): lokit auth login --provider gemini Вариант 3: Передать ключ напрямую: --api-key ВАШ_КЛЮЧ или export GOOGLE_API_KEY=ВАШ_КЛЮЧ Получить API-ключ: https://aistudio.google.com/apikey
tr: ‘google’ sağlayıcısı için API anahtarı veya Gemini OAuth girişi gereklidir Seçenek 1: API anahtarı kaydedin: lokit auth login --provider google Seçenek 2: Google OAuth ile giriş yapın (ücretsiz katman: 60 istek/dakika): lokit auth login --provider gemini Seçenek 3: Anahtarı doğrudan iletin: --api-key YOUR_KEY veya export GOOGLE_API_KEY=YOUR_KEY API anahtarı almak için: https://aistudio.google.com/apikey
uk: Провайдер 'google' потребує API-ключ або Gemini OAuth-авторизацію Варіант 1: Зберегти API-ключ: lokit auth login --provider google Варіант 2: Авторизуватись через Google OAuth (безкоштовний тариф: 60 запитів/хв): lokit auth login --provider gemini Варіант 3: Передати ключ напряму: --api-key YOUR_KEY або експортувати GOOGLE_API_KEY=YOUR_KEY Отримати API-ключ: https://aistudio.google.com/apikey

source: provider 'gemini' requires Google OAuth login Login with your Google account: lokit auth login --provider gemini This uses Gemini Code Assist (free tier: 60 req/min). For API key access, use --provider google instead.
ar: المزود 'gemini' يتطلب تسجيل دخول Google OAuth سجّل دخولك بحساب Google: lokit auth login --provider gemini يستخدم هذا Gemini Code Assist (60 طلب/دقيقة مجانًا). للوصول عبر مفتاح API، استخدم --provider google بدلاً من ذلك.
de: Anbieter 'gemini' benötigt Google OAuth-Login Mit Ihrem Google-Konto anmelden: lokit auth login --provider gemini Dies nutzt Gemini Code Assist (kostenloses Kontingent: 60 Anfragen/Min). Für API-Key-Zugang verwenden Sie stattdessen --provider google.
es: el proveedor 'gemini' requiere inicio de sesión con Google OAuth Inicia sesión con tu cuenta de Google: lokit auth login --provider gemini Esto utiliza Gemini Code Assist (nivel gratuito: 60 req/min). Para acceso por clave API, usa --provider google.
fr: le fournisseur 'gemini' nécessite une connexion Google OAuth Connectez-vous avec votre compte Google : lokit auth login --provider gemini Cela utilise Gemini Code Assist (gratuit : 60 req/min). Pour l'accès par clé API, utilisez --provider google à la place.
it: il provider 'gemini' richiede login OAuth Google Accedi con il tuo account Google: lokit auth login --provider gemini Utilizza Gemini Code Assist (tier gratuito: 60 req/min). Per accesso tramite chiave API, usa --provider google.
ja: プロバイダー「gemini」にはGoogle OAuthログインが必要です Googleアカウントでログイン: lokit auth login --provider gemini Gemini Code Assist（無料枠: 60リクエスト/分）を利用します。 APIキー利用は--provider googleを指定してください。
pl: dostawca 'gemini' wymaga logowania przez Google OAuth Zaloguj się na swoje konto Google: lokit auth login --provider gemini To korzysta z Gemini Code Assist (darmowy limit: 60 żądań/min). Aby użyć klucza API, wybierz --provider google.
pt_br: o provedor 'gemini' requer login via Google OAuth Faça login com sua conta Google: lokit auth login --provider gemini Isso utiliza o Gemini Code Assist (limite gratuito: 60 req/min). Para acesso via chave de API, use --provider google.
ru: провайдер 'gemini' требует вход через Google OAuth Войдите с помощью аккаунта Google: lokit auth login --provider gemini Используется Gemini Code Assist (бесплатный тариф: 60 req/min). Для доступа по API-ключу используйте --provider google.
tr: 'gemini' sağlayıcısı için Google OAuth girişi gereklidir Google hesabınızla giriş yapın: lokit auth login --provider gemini Bu, Gemini Code Assist'i kullanır (ücretsiz katman: 60 istek/dak). API anahtarı erişimi için, bunun yerine --provider google kullanın.
uk: провайдер 'gemini' вимагає авторизацію через Google OAuth Увійдіть через Google-акаунт: lokit auth login --provider gemini Використовується Gemini Code Assist (безкоштовний тариф: 60 запитів/хв). Для доступу через API-ключ використовуйте --provider google.

source: provider 'groq' requires an API key Option 1: Store your API key: lokit auth login --provider groq Option 2: Pass key directly: --api-key YOUR_KEY or export GROQ_API_KEY=YOUR_KEY Get a free API key from: https://console.groq.com/keys
ar: المزود 'groq' يتطلب مفتاح API الخيار 1: تخزين مفتاح API الخاص بك: lokit auth login --provider groq الخيار 2: تمرير المفتاح مباشرة: --api-key YOUR_KEY أو export GROQ_API_KEY=YOUR_KEY احصل على مفتاح API مجاني من: https://console.groq.com/keys
de: Provider 'groq' benötigt einen API-Schlüssel Option 1: API-Schlüssel speichern: lokit auth login --provider groq Option 2: Schlüssel direkt übergeben: --api-key IHR_SCHLÜSSEL oder export GROQ_API_KEY=IHR_SCHLÜSSEL Kostenlosen API-Schlüssel erhalten unter: https://console.groq.com/keys
es: El proveedor 'groq' requiere una clave API Opción 1: Almacenar tu clave API: lokit auth login --provider groq Opción 2: Pasar la clave directamente: --api-key TU_CLAVE o export GROQ_API_KEY=TU_CLAVE Obtén una clave API gratuita en: https://console.groq.com/keys
fr: Le fournisseur 'groq' nécessite une clé API Option 1 : Stocker votre clé API : lokit auth login --provider groq Option 2 : Passer la clé directement : --api-key VOTRE_CLÉ ou export GROQ_API_KEY=VOTRE_CLÉ Obtenez une clé API gratuite sur : https://console.groq.com/keys
it: Il provider 'groq' richiede una chiave API Opzione 1: Salva la tua chiave API: lokit auth login --provider groq Opzione 2: Passa la chiave direttamente: --api-key LA_TUA_CHIAVE oppure esporta GROQ_API_KEY=LA_TUA_CHIAVE Ottieni una chiave API gratuita da: https://console.groq.com/keys
ja: provider 'groq' にはAPIキーが必要です 方法1: APIキーを保存: lokit auth login --provider groq 方法2: キーを直接渡す: --api-key YOUR_KEY または export GROQ_API_KEY=YOUR_KEY 無料APIキー取得先: https://console.groq.com/keys
pl: dostawca 'groq' wymaga klucza API Opcja 1: Zapisz swój klucz API: lokit auth login --provider groq Opcja 2: Przekaż klucz bezpośrednio: --api-key TWÓJ_KLUCZ lub eksportuj GROQ_API_KEY=TWÓJ_KLUCZ Uzyskaj darmowy klucz API: https://console.groq.com/keys
pt_br: provedor 'groq' requer uma chave de API Opção 1: Armazene sua chave de API: lokit auth login --provider groq Opção 2: Passe a chave diretamente: --api-key SUA_CHAVE ou export GROQ_API_KEY=SUA_CHAVE Obtenha uma chave de API gratuita em: https://console.groq.com/keys
ru: Провайдер 'groq' требует API-ключ Вариант 1: Сохранить ваш API-ключ: lokit auth login --provider groq Вариант 2: Передать ключ напрямую: --api-key ВАШ_КЛЮЧ или export GROQ_API_KEY=ВАШ_КЛЮЧ Получить бесплатный API-ключ: https://console.groq.com/keys
tr: 'groq' sağlayıcısı için API anahtarı gereklidir Seçenek 1: API anahtarınızı kaydedin: lokit auth login --provider groq Seçenek 2: Anahtarı doğrudan iletin: --api-key YOUR_KEY veya export GROQ_API_KEY=YOUR_KEY Ücretsiz API anahtarı almak için: https://console.groq.com/keys
uk: Провайдер 'groq' потребує API-ключ Варіант 1: Зберегти ваш API-ключ: lokit auth login --provider groq Варіант 2: Передати ключ напряму: --api-key YOUR_KEY або експортувати GROQ_API_KEY=YOUR_KEY Отримати безкоштовний API-ключ: https://console.groq.com/keys

source: provider 'copilot' requires GitHub Copilot authentication Login with your GitHub account: lokit auth login --provider copilot This uses GitHub Copilot (requires active Copilot subscription).
ar: المزود 'copilot' يتطلب مصادقة GitHub Copilot سجّل دخولك بحساب GitHub: lokit auth login --provider copilot يستخدم هذا GitHub Copilot (يتطلب اشتراك Copilot نشط).
de: Anbieter 'copilot' benötigt GitHub Copilot-Authentifizierung Mit Ihrem GitHub-Konto anmelden: lokit auth login --provider copilot Dies nutzt GitHub Copilot (aktives Copilot-Abo erforderlich).
es: el proveedor 'copilot' requiere autenticación de GitHub Copilot Inicia sesión con tu cuenta de GitHub: lokit auth login --provider copilot Esto utiliza GitHub Copilot (requiere suscripción activa a Copilot).
fr: le fournisseur 'copilot' nécessite une authentification GitHub Copilot Connectez-vous avec votre compte GitHub : lokit auth login --provider copilot Cela utilise GitHub Copilot (abonnement Copilot actif requis).
it: il provider 'copilot' richiede autenticazione GitHub Copilot Accedi con il tuo account GitHub: lokit auth login --provider copilot Utilizza GitHub Copilot (richiede abbonamento Copilot attivo).
ja: プロバイダー「copilot」にはGitHub Copilot認証が必要です GitHubアカウントでログイン: lokit auth login --provider copilot GitHub Copilot（有効なサブスクリプションが必要）を利用します。
pl: dostawca 'copilot' wymaga uwierzytelnienia GitHub Copilot Zaloguj się na swoje konto GitHub: lokit auth login --provider copilot To korzysta z GitHub Copilot (wymagana aktywna subskrypcja Copilot).
pt_br: o provedor 'copilot' requer autenticação no GitHub Copilot Faça login com sua conta GitHub: lokit auth login --provider copilot Isso utiliza o GitHub Copilot (requer assinatura ativa do Copilot).
ru: провайдер 'copilot' требует авторизацию GitHub Copilot Войдите с помощью аккаунта GitHub: lokit auth login --provider copilot Используется GitHub Copilot (требуется активная подписка Copilot).
tr: 'copilot' sağlayıcısı için GitHub Copilot kimlik doğrulaması gereklidir GitHub hesabınızla giriş yapın: lokit auth login --provider copilot Bu, GitHub Copilot'u kullanır (aktif Copilot aboneliği gerektirir).
uk: провайдер 'copilot' вимагає авторизацію GitHub Copilot Увійдіть через GitHub-акаунт: lokit auth login --provider copilot Використовується GitHub Copilot (потрібна активна підписка Copilot).
