Repository: minios-linux/lokit
Catalog: po/*.po
Languages: ar, de, es, fr, it, ja, pl, pt_br, ru, tr, uk

source: %s: PO file not found at %s
ar: %s: ملف PO غير موجود في %s
de: %s: PO-Datei nicht gefunden unter %s
es: %s: archivo PO no encontrado en %s
fr: %s : fichier PO non trouvé à %s
it: %s: file PO non trovato in %s
ja: %s: PO ファイルが %s に見つかりません
pl: %s: plik PO nie znaleziony w %s
pt_br: %s: arquivo PO não encontrado em %s
ru: %s: PO-файл не найден по пути %s
tr: %s: PO dosyası %s konumunda bulunamadı
uk: %s: PO-файл не знайдено за адресою %s

source: Use "%s [command] --help" for more information about a command.
ar: استخدم "%s [الأمر] --help" لمزيد من المعلومات حول الأمر.
de: Verwenden Sie "%s [Befehl] --help" für weitere Informationen zu einem Befehl.
es: Usa "%s [comando] --help" para obtener más información sobre un comando.
fr: Utilisez « %s [commande] --help » pour plus d’informations sur une commande.
it: Usa "%s [comando] --help" per maggiori informazioni su un comando.
ja: コマンドの詳細については「%s [command] --help」をご利用ください。
pl: Użyj "%s [komenda] --help", aby uzyskać więcej informacji o poleceniu.
pt_br: Use "%s [comando] --help" para mais informações sobre um comando.
ru: Используйте «%s [команда] --help» для получения дополнительной информации о команде.
tr: "%s [komut] --help" yazarak bir komut hakkında daha fazla bilgi alabilirsiniz.
uk: Використовуйте "%s [command] --help" для отримання додаткової інформації про команду.

source: Using documentation-specific translation prompt (groff/man markup preservation)
ar: يتم استخدام مطالبة ترجمة خاصة بالتوثيق (الحفاظ على تنسيق groff/man)
de: Verwende dokumentationsspezifischen Übersetzungs-Prompt (groff/man Markup-Erhaltung)
es: Usando prompt de traducción específico para documentación (preservación de marcado groff/man)
fr: Utilisation du prompt de traduction spécifique à la documentation (préservation du balisage groff/man)
it: Utilizzo di prompt di traduzione specifico per la documentazione (preservazione markup groff/man)
ja: ドキュメント専用の翻訳プロンプトを使用中（groff/man マークアップ保持）
pl: Używam promptu tłumaczeniowego dedykowanego dokumentacji (z zachowaniem składni groff/man)
pt_br: Usando prompt de tradução específico para documentação (preservação de marcação groff/man)
ru: Используется специальная подсказка для перевода документации (с сохранением groff/man-разметки)
tr: Dokümantasyon için özel çeviri komut istemi kullanılıyor (groff/man biçimlendirmesi korunacak)
uk: Використовується спеціальний підказ для перекладу документації (збереження groff/man-розмітки)

source: PO files missing, running po4a initialization...
ar: ملفات PO مفقودة، جارٍ تشغيل تهيئة po4a...
de: PO-Dateien fehlen, po4a-Initialisierung wird ausgeführt...
es: Faltan archivos PO, ejecutando inicialización de po4a...
fr: Fichiers PO manquants, lancement de l'initialisation po4a...
it: File PO mancanti, esecuzione dell'inizializzazione po4a...
ja: POファイルがありません。po4aの初期化を実行します...
pl: Brak plików PO, uruchamianie inicjalizacji po4a...
pt_br: Arquivos PO ausentes, executando inicialização do po4a...
ru: PO-файлы отсутствуют, запуск инициализации po4a...
tr: PO dosyaları eksik, po4a başlatılıyor...
uk: PO-файли відсутні, запуск ініціалізації po4a...

source: Usage:
ar: الاستخدام:
de: Verwendung:
es: Uso:
fr: Utilisation :
it: Utilizzo:
ja: 使用法:
pl: Użycie:
pt_br: Uso:
ru: Использование:
tr: Kullanım:
uk: Використання:

source: auto-init failed: %v
ar: فشلت التهيئة التلقائية: %v
de: Automatische Initialisierung fehlgeschlagen: %v
es: la inicialización automática falló: %v
fr: l'initialisation automatique a échoué : %v
it: inizializzazione automatica fallita: %v
ja: 自動初期化に失敗しました: %v
pl: automatyczna inicjalizacja nie powiodła się: %v
pt_br: inicialização automática falhou: %v
ru: автоинициализация не удалась: %v
tr: otomatik başlatma başarısız: %v
uk: автоініціалізація не вдалася: %v

source: [%s] No PO file for %s at %s, skipping
ar: [%s] لا يوجد ملف PO لـ %s في %s، تخطي
de: [%s] Keine PO-Datei für %s unter %s, übersprungen
es: [%s] No hay archivo PO para %s en %s, omitiendo
fr: [%s] Pas de fichier PO pour %s dans %s, ignoré
it: [%s] Nessun file PO per %s in %s, saltato
ja: [%s] %s のPOファイルが %s にありません、スキップします
pl: [%s] Brak pliku PO dla %s w %s, pomijanie
pt_br: [%s] Nenhum arquivo PO para %s em %s, pulando
ru: [%s] Нет PO-файла для %s в %s, пропуск
tr: [%s] %s için %s konumunda PO dosyası yok, atlanıyor
uk: [%s] Немає PO-файлу для %s у %s, пропуск

source: Aliases:
ar: الأسماء المستعارة:
de: Aliasse:
es: Alias:
fr: Alias :
it: Alias:
ja: エイリアス:
pl: Aliasy:
pt_br: Apelidos:
ru: Псевдонимы:
tr: Takma adlar:
uk: Псевдоніми:

source: Translations dir: %s
ar: مجلد الترجمات: %s
de: Übersetzungsverzeichnis: %s
es: Directorio de traducciones: %s
fr: Dossier des traductions : %s
it: Directory traduzioni: %s
ja: 翻訳ディレクトリ: %s
pl: Katalog tłumaczeń: %s
pt_br: Diretório de traduções: %s
ru: Каталог переводов: %s
tr: Çeviri dizini: %s
uk: Директорія перекладів: %s

source: Examples:
ar: أمثلة:
de: Beispiele:
es: Ejemplos:
fr: Exemples :
it: Esempi:
ja: 例:
pl: Przykłady:
pt_br: Exemplos:
ru: Примеры:
tr: Örnekler:
uk: Приклади:

source: Available Commands:
ar: الأوامر المتاحة:
de: Verfügbare Befehle:
es: Comandos disponibles:
fr: Commandes disponibles :
it: Comandi disponibili:
ja: 利用可能なコマンド:
pl: Dostępne polecenia:
pt_br: Comandos disponíveis:
ru: Доступные команды:
tr: Kullanılabilir Komutlar:
uk: Доступні команди:

source: Res dir: %s
ar: مجلد الموارد: %s
de: Res-Verzeichnis: %s
es: Directorio Res: %s
fr: Dossier res : %s
it: Directory risorse: %s
ja: Res ディレクトリ: %s
pl: Katalog res: %s
pt_br: Diretório Res: %s
ru: Каталог ресурсов: %s
tr: Res dizini: %s
uk: Res директорія: %s

source: cannot read source strings.xml %s: %w
ar: تعذر قراءة ملف strings.xml المصدر %s: %w
de: Kann source strings.xml %s nicht lesen: %w
es: no se puede leer strings.xml de origen %s: %w
fr: impossible de lire le strings.xml source %s : %w
it: impossibile leggere strings.xml sorgente %s: %w
ja: ソースstrings.xmlの読み込みに失敗しました %s: %w
pl: nie można odczytać pliku źródłowego strings.xml %s: %w
pt_br: não foi possível ler o strings.xml de origem %s: %w
ru: невозможно прочитать исходный strings.xml %s: %w
tr: Kaynak strings.xml dosyası okunamıyor %s: %w
uk: неможливо прочитати вихідний strings.xml %s: %w

source: Source strings: %d
ar: سلاسل المصدر: %d
de: Quellstrings: %d
es: Cadenas fuente: %d
fr: Chaînes sources : %d
it: Stringhe di origine: %d
ja: ソース文字列: %d
pl: Ciągi źródłowe: %d
pt_br: Strings de origem: %d
ru: Исходные строки: %d
tr: Kaynak dizgiler: %d
uk: Рядки джерела: %d

source: %s (%s): %d strings to translate (file will be auto-created)
ar: %s (%s): %d سلسلة بحاجة للترجمة (سيتم إنشاء الملف تلقائيًا)
de: %s (%s): %d zu übersetzende Strings (Datei wird automatisch erstellt)
es: %s (%s): %d cadenas por traducir (el archivo se creará automáticamente)
fr: %s (%s) : %d chaînes à traduire (le fichier sera créé automatiquement)
it: %s (%s): %d stringhe da tradurre (il file verrà creato automaticamente)
ja: %s (%s): 翻訳対象の文字列が %d 件あります（ファイルは自動作成されます）
pl: %s (%s): %d ciągów do przetłumaczenia (plik zostanie utworzony automatycznie)
pt_br: %s (%s): %d strings para traduzir (arquivo será criado automaticamente)
ru: %s (%s): %d строк для перевода (файл будет создан автоматически)
tr: %s (%s): Çevrilecek %d dizgi (dosya otomatik oluşturulacak)
uk: %s (%s): %d рядків для перекладу (файл буде створено автоматично)

source: Additional Commands:
ar: أوامر إضافية:
de: Weitere Befehle:
es: Comandos adicionales:
fr: Commandes supplémentaires :
it: Comandi aggiuntivi:
ja: 追加コマンド:
pl: Dodatkowe polecenia:
pt_br: Comandos adicionais:
ru: Дополнительные команды:
tr: Ek Komutlar:
uk: Додаткові команди:

source: Flags:
ar: الخيارات:
es: Opciones:
fr: Options :
it: Opzioni:
ja: フラグ:
pl: Opcje:
pt_br: Opções:
ru: Флаги:
tr: Seçenekler:
uk: Прапорці:

source: Auto-creating %s with %d strings
ar: يتم إنشاء %s تلقائيًا مع %d سلسلة
de: %s wird automatisch mit %d Strings erstellt
es: Creando automáticamente %s con %d cadenas
fr: Création automatique de %s avec %d chaînes
it: Creazione automatica di %s con %d stringhe
ja: %s を %d 件の文字列で自動作成中
pl: Automatyczne tworzenie %s z %d ciągami
pt_br: Criando automaticamente %s com %d strings
ru: Автоматически создаётся %s с %d строками
tr: %s otomatik olarak %d dizgiyle oluşturuluyor
uk: Автоматичне створення %s з %d рядками

source: Added %d new strings to %s
ar: تمت إضافة %d سلسلة جديدة إلى %s
de: %d neue Strings zu %s hinzugefügt
es: Se añadieron %d nuevas cadenas a %s
fr: %d nouvelles chaînes ajoutées à %s
it: Aggiunte %d nuove stringhe a %s
ja: %d 件の新しい文字列を %s に追加しました
pl: Dodano %d nowych ciągów do %s
pt_br: Adicionadas %d novas strings em %s
ru: Добавлено %d новых строк в %s
tr: %d yeni dizgi %s dosyasına eklendi
uk: Додано %d нових рядків до %s

source: Global Flags:
ar: الخيارات العامة:
de: Globale Flags:
es: Opciones globales:
fr: Options globales :
it: Opzioni globali:
ja: グローバルフラグ:
pl: Opcje globalne:
pt_br: Opções globais:
ru: Глобальные флаги:
tr: Genel Seçenekler:
uk: Глобальні прапорці:

source: Additional help topics:
ar: مواضيع مساعدة إضافية:
de: Weitere Hilfethemen:
es: Temas de ayuda adicionales:
fr: Rubriques d'aide supplémentaires :
it: Argomenti di aiuto aggiuntivi:
ja: 追加のヘルプトピック:
pl: Dodatkowe tematy pomocy:
pt_br: Tópicos de ajuda adicionais:
ru: Дополнительные разделы справки:
tr: Ek yardım konuları:
uk: Додаткові розділи довідки:

source: All UI translations are complete!
ar: جميع ترجمات واجهة المستخدم مكتملة!
de: Alle UI-Übersetzungen sind abgeschlossen!
es: ¡Todas las traducciones de la interfaz están completas!
fr: Toutes les traductions de l’interface sont terminées !
it: Tutte le traduzioni dell’interfaccia sono complete!
ja: すべてのUI翻訳が完了しました！
pl: Wszystkie tłumaczenia interfejsu użytkownika są gotowe!
pt_br: Todas as traduções da interface estão completas!
ru: Все переводы интерфейса завершены!
tr: Tüm arayüz çevirileri tamamlandı!
uk: Усі переклади інтерфейсу завершено!

source: Parallel: disabled (sequential)
ar: المعالجة المتوازية: معطلة (تسلسلية)
de: Parallel: deaktiviert (sequenziell)
es: Paralelo: deshabilitado (secuencial)
fr: Parallèle : désactivé (séquentiel)
it: Parallelo: disabilitato (sequenziale)
ja: 並列処理: 無効（順次実行）
pl: Równoległość: wyłączona (sekwencyjnie)
pt_br: Paralelo: desativado (sequencial)
ru: Параллельно: отключено (последовательно)
tr: Paralel: devre dışı (sıralı)
uk: Паралельно: вимкнено (послідовно)

source: Source keys (%s): %d
ar: مفاتيح المصدر (%s): %d
de: Quellschlüssel (%s): %d
es: Claves fuente (%s): %d
fr: Clés sources (%s) : %d
it: Chiavi di origine (%s): %d
ja: ソースキー（%s）: %d
pl: Klucze źródłowe (%s): %d
pt_br: Chaves de origem (%s): %d
ru: Исходные ключи (%s): %d
tr: Kaynak anahtarlar (%s): %d
uk: Ключі джерела (%s): %d

source: Translating UI strings: %s
ar: يتم ترجمة سلاسل واجهة المستخدم: %s
de: UI-Strings werden übersetzt: %s
es: Traduciendo cadenas de la interfaz: %s
fr: Traduction des chaînes de l’interface : %s
it: Traduzione delle stringhe UI: %s
ja: UI文字列を翻訳中: %s
pl: Tłumaczenie ciągów interfejsu: %s
pt_br: Traduzindo strings da interface: %s
ru: Переводим строки интерфейса: %s
tr: Arayüz dizgileri çevriliyor: %s
uk: Переклад рядків інтерфейсу: %s

source: Help about any command
ar: مساعدة حول أي أمر
de: Hilfe zu jedem Befehl
es: Ayuda sobre cualquier comando
fr: Aide sur n’importe quelle commande
it: Guida su qualsiasi comando
ja: 任意のコマンドに関するヘルプ
pl: Pomoc dotycząca dowolnej komendy
pt_br: Ajuda sobre qualquer comando
ru: Справка по любой команде
tr: Herhangi bir komut hakkında yardım
uk: Довідка щодо будь-якої команди

source: Help provides help for any command in the application. Simply type %s help [path to command] for full details.
ar: توفر المساعدة شرحًا لأي أمر في التطبيق. ببساطة اكتب %s help [مسار الأمر] للحصول على التفاصيل الكاملة.
de: Die Hilfe bietet Unterstützung zu jedem Befehl in der Anwendung. Geben Sie einfach %s help [Pfad zum Befehl] ein, um alle Details zu erhalten.
es: La ayuda proporciona información sobre cualquier comando de la aplicación. Simplemente escribe %s help [ruta al comando] para ver los detalles completos.
fr: L’aide fournit des informations sur chaque commande de l’application. Tapez simplement %s help [chemin vers la commande] pour plus de détails.
it: La guida fornisce assistenza per qualsiasi comando dell'applicazione. Digita semplicemente %s help [percorso del comando] per tutti i dettagli.
ja: Helpはアプリケーション内の任意のコマンドに関するヘルプを提供します。 詳細は %s help [コマンドへのパス] と入力してください。
pl: Pomoc udostępnia informacje o każdej komendzie w aplikacji. Wpisz po prostu %s help [ścieżka do komendy], aby uzyskać szczegóły.
pt_br: A ajuda fornece informações sobre qualquer comando no aplicativo. Basta digitar %s help [caminho do comando] para ver todos os detalhes.
ru: Справка предоставляет информацию по любой команде приложения. Просто введите %s help [путь к команде] для подробностей.
tr: Help, uygulamadaki herhangi bir komut için yardım sağlar. Tüm detaylar için sadece %s help [komut yolu] yazmanız yeterli.
uk: Довідка надає інформацію про будь-яку команду в застосунку. Просто введіть %s help [шлях до команди] для повної інформації.

source: %s: recipe translations directory not found
ar: %s: لم يتم العثور على مجلد ترجمات الوصفات
de: %s: Verzeichnis für Rezeptübersetzungen nicht gefunden
es: %s: directorio de traducciones de recetas no encontrado
fr: %s : répertoire des traductions de recettes introuvable
it: %s: directory delle traduzioni delle ricette non trovata
ja: %s: レシピ翻訳ディレクトリが見つかりません
pl: %s: nie znaleziono katalogu z tłumaczeniami przepisów
pt_br: %s: diretório de traduções de receitas não encontrado
ru: %s: директория переводов рецептов не найдена
tr: %s: tarif çeviri dizini bulunamadı
uk: %s: директорію перекладів рецептів не знайдено

source: %s: %d recipe files need translation
ar: %s: %d ملف وصفة بحاجة للترجمة
de: %s: %d Rezeptdateien müssen übersetzt werden
es: %s: %d archivos de recetas necesitan traducción
fr: %s : %d fichiers de recettes à traduire
it: %s: %d file ricetta da tradurre
ja: %s: 翻訳が必要なレシピファイルが %d 件あります
pl: %s: %d plików z przepisami wymaga tłumaczenia
pt_br: %s: %d arquivos de receita precisam ser traduzidos
ru: %s: требуется перевести %d файлов рецептов
tr: %s: %d tarif dosyasının çevrilmesi gerekiyor
uk: %s: потрібно перекласти %d файлів рецептів

source: No blog posts found in %s
ar: لم يتم العثور على منشورات مدونة في %s
de: Keine Blogbeiträge in %s gefunden
es: No se encontraron publicaciones de blog en %s
fr: Aucun article de blog trouvé dans %s
it: Nessun post trovato in %s
ja: %s にブログ記事が見つかりません
pl: Nie znaleziono wpisów bloga w %s
pt_br: Nenhuma postagem de blog encontrada em %s
ru: В %s не найдено ни одной записи блога
tr: %s içinde blog yazısı bulunamadı
uk: Не знайдено жодного блогу в %s

source: %s: %d blog post(s) need translation
ar: %s: %d منشور مدونة بحاجة للترجمة
de: %s: %d Blogbeitrag/Beiträge müssen übersetzt werden
es: %s: %d publicación(es) de blog necesitan traducción
fr: %s : %d article(s) de blog à traduire
it: %s: %d post del blog da tradurre
ja: %s: 翻訳が必要なブログ記事が %d 件あります
pl: %s: %d wpis(ów) bloga wymaga tłumaczenia
pt_br: %s: %d postagem(ns) de blog precisam de tradução
ru: %s: требуется перевести %d запись(ей) блога
tr: %s: %d blog yazısının çevirisi gerekiyor
uk: %s: потрібно перекласти %d публікацій блогу

source: %s: all blog posts translated
ar: %s: جميع منشورات المدونة تمت ترجمتها
de: %s: alle Blogbeiträge übersetzt
es: %s: todas las publicaciones de blog traducidas
fr: %s : tous les articles de blog sont traduits
it: %s: tutti i post del blog sono stati tradotti
ja: %s: すべてのブログ記事が翻訳されました
pl: %s: wszystkie wpisy bloga przetłumaczone
pt_br: %s: todas as postagens do blog traduzidas
ru: %s: все записи блога переведены
tr: %s: tüm blog yazıları çevrildi
uk: %s: усі пости блогу перекладено

source: Auto-creating %s with %d keys
ar: يتم إنشاء %s تلقائيًا مع %d مفتاح
de: %s wird automatisch mit %d Schlüsseln erstellt
es: Creando automáticamente %s con %d claves
fr: Création automatique de %s avec %d clés
it: Creazione automatica di %s con %d chiavi
ja: %s を %d 件のキーで自動作成中
pl: Automatyczne tworzenie %s z %d kluczami
pt_br: Criando automaticamente %s com %d chaves
ru: Автоматически создаётся %s с %d ключами
tr: %s otomatik olarak %d anahtarla oluşturuluyor
uk: Автоматичне створення %s з %d ключами

source: Translation interrupted, partial progress saved
ar: تم إيقاف الترجمة، تم حفظ التقدم الجزئي
de: Übersetzung unterbrochen, Fortschritt teilweise gespeichert
es: Traducción interrumpida, progreso parcial guardado
fr: Traduction interrompue, progression partielle enregistrée
it: Traduzione interrotta, progresso parziale salvato
ja: 翻訳が中断されました。進捗は一部保存されています
pl: Tłumaczenie przerwane, zapisano częściowy postęp
pt_br: Tradução interrompida, progresso parcial salvo
ru: Перевод прерван, частичный прогресс сохранён
tr: Çeviri yarıda kesildi, kısmi ilerleme kaydedildi
uk: Переклад перервано, частковий прогрес збережено

source: UI translation failed: %v
ar: فشل ترجمة واجهة المستخدم: %v
de: UI-Übersetzung fehlgeschlagen: %v
es: Error en la traducción de la interfaz: %v
fr: Échec de la traduction de l’interface : %v
it: Traduzione UI non riuscita: %v
ja: UI翻訳に失敗しました: %v
pl: Tłumaczenie interfejsu nie powiodło się: %v
pt_br: Falha na tradução da interface: %v
ru: Ошибка перевода интерфейса: %v
tr: Arayüz çevirisi başarısız: %v
uk: Помилка перекладу інтерфейсу: %v

source: Translating recipe metadata...
ar: يتم ترجمة بيانات وصفة التعريف...
de: Rezept-Metadaten werden übersetzt...
es: Traduciendo metadatos de recetas...
fr: Traduction des métadonnées de recettes...
it: Traduzione dei metadati delle ricette...
ja: レシピのメタデータを翻訳中...
pl: Tłumaczenie metadanych przepisu...
pt_br: Traduzindo metadados das receitas...
ru: Переводим метаданные рецептов...
tr: Tarif meta verileri çevriliyor...
uk: Переклад метаданих рецептів...

source: Cannot read recipe directory for %s: %v
ar: تعذر قراءة مجلد الوصفات لـ %s: %v
de: Rezeptverzeichnis für %s kann nicht gelesen werden: %v
es: No se puede leer el directorio de recetas para %s: %v
fr: Impossible de lire le répertoire de recettes pour %s : %v
it: Impossibile leggere la directory delle ricette per %s: %v
ja: %s のレシピディレクトリが読み込めません: %v
pl: Nie można odczytać katalogu z przepisami dla %s: %v
pt_br: Não foi possível ler o diretório de receitas para %s: %v
ru: Не удалось прочитать директорию рецептов для %s: %v
tr: %s için tarif dizini okunamıyor: %v
uk: Не вдалося прочитати директорію рецептів для %s: %v

source: %s: all recipe translations complete
ar: %s: جميع ترجمات الوصفات مكتملة
de: %s: alle Rezeptübersetzungen abgeschlossen
es: %s: todas las traducciones de recetas completas
fr: %s : toutes les traductions de recettes sont terminées
it: %s: tutte le traduzioni delle ricette completate
ja: %s: すべてのレシピ翻訳が完了しました
pl: %s: wszystkie tłumaczenia przepisów zakończone
pt_br: %s: todas as traduções de receitas concluídas
ru: %s: все переводы рецептов завершены
tr: %s: tüm tarif çevirileri tamamlandı
uk: %s: усі переклади рецептів завершено

source: %s (%s): %d recipe files to translate
ar: %s (%s): %d ملف وصفة بحاجة للترجمة
de: %s (%s): %d Rezeptdateien zu übersetzen
es: %s (%s): %d archivos de recetas por traducir
fr: %s (%s) : %d fichiers de recettes à traduire
it: %s (%s): %d file ricetta da tradurre
ja: %s (%s): 翻訳対象のレシピファイルが %d 件あります
pl: %s (%s): %d plików z przepisami do przetłumaczenia
pt_br: %s (%s): %d arquivos de receita para traduzir
ru: %s (%s): %d файлов рецептов для перевода
tr: %s (%s): Çevrilecek %d tarif dosyası
uk: %s (%s): %d файлів рецептів для перекладу

source: Unknown help topic %q
ar: موضوع المساعدة غير معروف %q
de: Unbekanntes Hilfethema %q
es: Tema de ayuda desconocido %q
fr: Sujet d’aide inconnu : %q
it: Argomento di aiuto sconosciuto %q
ja: 不明なヘルプトピック %q
pl: Nieznany temat pomocy %q
pt_br: Tópico de ajuda desconhecido %q
ru: Неизвестная тема справки %q
tr: Bilinmeyen yardım konusu %q
uk: Невідома тема довідки %q

source: Recipe translation failed for %s: %v
ar: فشلت ترجمة الوصفة لـ %s: %v
de: Rezeptübersetzung für %s fehlgeschlagen: %v
es: Error al traducir la receta %s: %v
fr: Échec de la traduction de la recette pour %s : %v
it: Traduzione della ricetta non riuscita per %s: %v
ja: %s のレシピ翻訳に失敗しました: %v
pl: Tłumaczenie przepisu nie powiodło się dla %s: %v
pt_br: Falha na tradução da receita para %s: %v
ru: Ошибка перевода рецепта для %s: %v
tr: %s için tarif çevirisi başarısız oldu: %v
uk: Помилка перекладу рецепта для %s: %v

source: Translating blog posts...
ar: يتم ترجمة منشورات المدونة...
de: Blogbeiträge werden übersetzt...
es: Traduciendo publicaciones de blog...
fr: Traduction des articles de blog...
it: Traduzione dei post del blog...
ja: ブログ記事を翻訳中...
pl: Tłumaczenie wpisów bloga...
pt_br: Traduzindo postagens do blog...
ru: Переводим записи блога...
tr: Blog yazıları çevriliyor...
uk: Переклад публікацій блогу...

source: Cannot read source blog post %s: %v
ar: تعذر قراءة منشور المدونة المصدر %s: %v
de: Quell-Blogbeitrag %s kann nicht gelesen werden: %v
es: No se puede leer la publicación de blog fuente %s: %v
fr: Impossible de lire l’article de blog source %s : %v
it: Impossibile leggere il post del blog di origine %s: %v
ja: ソースブログ記事 %s が読み込めません: %v
pl: Nie można odczytać źródłowego wpisu bloga %s: %v
pt_br: Não foi possível ler a postagem de blog de origem %s: %v
ru: Не удалось прочитать исходную запись блога %s: %v
tr: Kaynak blog yazısı %s okunamıyor: %v
uk: Не вдалося прочитати вихідний пост блогу %s: %v

source: Error parsing %s, will recreate: %v
ar: خطأ في تحليل %s، سيتم إعادة الإنشاء: %v
de: Fehler beim Parsen von %s, wird neu erstellt: %v
es: Error al analizar %s, se recreará: %v
fr: Erreur lors de l’analyse de %s, recréation prévue : %v
it: Errore nell’analisi di %s, verrà ricreato: %v
ja: %s の解析エラー、再作成します: %v
pl: Błąd podczas przetwarzania %s, zostanie odtworzony: %v
pt_br: Erro ao analisar %s, será recriado: %v
ru: Ошибка разбора %s, будет пересоздано: %v
tr: %s ayrıştırılırken hata oluştu, yeniden oluşturulacak: %v
uk: Помилка розбору %s, буде створено заново: %v

source: %s: all blog posts translated
ar: %s: جميع منشورات المدونة تمت ترجمتها
de: %s: alle Blogbeiträge übersetzt
es: %s: todas las publicaciones de blog traducidas
fr: %s : tous les articles de blog sont traduits
it: %s: tutti i post del blog sono stati tradotti
ja: %s: すべてのブログ記事が翻訳されました
pl: %s: wszystkie wpisy bloga przetłumaczone
pt_br: %s: todas as postagens do blog traduzidas
ru: %s: все записи блога переведены
tr: %s: tüm blog yazıları çevrildi
uk: %s: усі пости блогу перекладено

source: %s (%s): %d blog post(s) to translate
ar: %s (%s): %d منشور مدونة بحاجة للترجمة
de: %s (%s): %d Blogbeitrag/Beiträge zu übersetzen
es: %s (%s): %d publicación(es) de blog por traducir
fr: %s (%s) : %d article(s) de blog à traduire
it: %s (%s): %d post del blog da tradurre
ja: %s (%s): 翻訳対象のブログ記事が %d 件あります
pl: %s (%s): %d wpis(ów) bloga do przetłumaczenia
pt_br: %s (%s): %d postagem(ns) de blog para traduzir
ru: %s (%s): %d запись(ей) блога для перевода
tr: %s (%s): Çevrilecek %d blog yazısı
uk: %s (%s): %d публікацій блогу для перекладу

source: Project root directory
ar: دليل جذر المشروع
de: Projekt-Stammverzeichnis
es: Directorio raíz del proyecto
fr: Répertoire racine du projet
it: Directory root del progetto
ja: プロジェクトルートディレクトリ
pl: Katalog główny projektu
pt_br: Diretório raiz do projeto
ru: Корневая директория проекта
tr: Proje kök dizini
uk: Коренева директорія проєкту
