Repository: minios-linux/lokit
Catalog: po/*.po
Languages: ar, de, es, fr, it, ja, pl, pt_br, ru, tr, uk

source: Authentication failed: %v
ar: فشلت المصادقة: %v
de: Authentifizierung fehlgeschlagen: %v
es: Error de autenticación: %v
fr: Échec de l’authentification : %v
it: Autenticazione non riuscita: %v
ja: 認証に失敗しました: %v
pl: Uwierzytelnianie nie powiodło się: %v
pt_br: Falha na autenticação: %v
ru: Ошибка аутентификации: %v
tr: Kimlik doğrulama başarısız: %v
uk: Помилка автентифікації: %v

source: help for %s
ar: مساعدة لـ %s
de: Hilfe für %s
es: ayuda para %s
fr: aide pour %s
it: guida per %s
ja: %s のヘルプ
pl: pomoc dla %s
pt_br: ajuda para %s
ru: справка по %s
tr: %s için yardım
uk: довідка для %s

source: Copilot authentication successful!
ar: تمت مصادقة Copilot بنجاح!
de: Copilot-Authentifizierung erfolgreich!
es: ¡Autenticación de Copilot exitosa!
fr: Authentification Copilot réussie !
it: Autenticazione Copilot riuscita!
ja: Copilot の認証に成功しました！
pl: Uwierzytelnianie Copilot zakończone sukcesem!
pt_br: Autenticação do Copilot realizada com sucesso!
ru: Аутентификация Copilot прошла успешно!
tr: Copilot kimlik doğrulaması başarılı!
uk: Copilot автентифікація успішна!

source: You can now use: lokit translate --provider copilot --model gpt-4o
ar: يمكنك الآن استخدام: lokit translate --provider copilot --model gpt-4o
de: Sie können jetzt verwenden: lokit translate --provider copilot --model gpt-4o
es: Ahora puedes usar: lokit translate --provider copilot --model gpt-4o
fr: Vous pouvez maintenant utiliser : lokit translate --provider copilot --model gpt-4o
it: Ora puoi usare: lokit translate --provider copilot --model gpt-4o
ja: 次のコマンドが利用可能になりました: lokit translate --provider copilot --model gpt-4o
pl: Możesz teraz użyć: lokit translate --provider copilot --model gpt-4o
pt_br: Agora você pode usar: lokit translate --provider copilot --model gpt-4o
ru: Теперь вы можете использовать: lokit translate --provider copilot --model gpt-4o
tr: Artık şunu kullanabilirsiniz: lokit translate --provider copilot --model gpt-4o
uk: Тепер ви можете використовувати: lokit translate --provider copilot --model gpt-4o

source: Google Gemini Authentication
ar: مصادقة Google Gemini
de: Google Gemini-Authentifizierung
es: Autenticación de Google Gemini
fr: Authentification Google Gemini
it: Autenticazione Google Gemini
ja: Google Gemini 認証
pl: Uwierzytelnianie Google Gemini
pt_br: Autenticação Google Gemini
ru: Аутентификация Google Gemini
tr: Google Gemini Kimlik Doğrulama
uk: Автентифікація Google Gemini

source: Opening browser for Google sign-in...
ar: يتم فتح المتصفح لتسجيل الدخول إلى Google...
de: Browser wird für die Google-Anmeldung geöffnet...
es: Abriendo el navegador para iniciar sesión con Google...
fr: Ouverture du navigateur pour la connexion Google...
it: Apertura del browser per l'accesso a Google...
ja: Google サインインのためにブラウザを開いています...
pl: Otwieranie przeglądarki w celu logowania do Google...
pt_br: Abrindo o navegador para login no Google...
ru: Открывается браузер для входа в Google...
tr: Google hesabınızla giriş yapmak için tarayıcı açılıyor...
uk: Відкриваємо браузер для входу через Google...

source: If the browser doesn't open, visit:
ar: إذا لم يفتح المتصفح، قم بزيارة:
de: Falls sich der Browser nicht öffnet, besuchen Sie:
es: Si el navegador no se abre, visita:
fr: Si le navigateur ne s'ouvre pas, rendez-vous sur :
it: Se il browser non si apre, visita:
ja: ブラウザが自動で開かない場合は、こちらにアクセスしてください:
pl: Jeśli przeglądarka się nie otworzy, odwiedź:
pt_br: Se o navegador não abrir, acesse:
ru: Если браузер не открылся, перейдите по адресу:
tr: Eğer tarayıcı açılmazsa şu adresi ziyaret edin:
uk: Якщо браузер не відкрився, перейдіть за адресою:

source: Gemini authentication successful!
ar: تمت مصادقة Gemini بنجاح!
de: Gemini-Authentifizierung erfolgreich!
es: ¡Autenticación de Gemini exitosa!
fr: Authentification Gemini réussie !
it: Autenticazione Gemini riuscita!
ja: Gemini の認証に成功しました！
pl: Uwierzytelnianie Gemini zakończone sukcesem!
pt_br: Autenticação Gemini realizada com sucesso!
ru: Аутентификация Gemini прошла успешно!
tr: Gemini kimlik doğrulama başarılı!
uk: Успішна автентифікація Gemini!

source: Token was saved but cannot be loaded
ar: تم حفظ الرمز المميز ولكن تعذر تحميله
de: Token wurde gespeichert, kann aber nicht geladen werden
es: El token se guardó pero no se puede cargar
fr: Le jeton a été enregistré mais ne peut pas être chargé
it: Il token è stato salvato ma non può essere caricato
ja: トークンは保存されましたが、読み込めません
pl: Token został zapisany, ale nie można go załadować
pt_br: O token foi salvo, mas não pode ser carregado
ru: Токен сохранён, но не удалось загрузить
tr: Token kaydedildi ancak yüklenemiyor
uk: Токен збережено, але не вдалося завантажити

source: Gemini Code Assist requires a GCP project ID to work in your region.
ar: يتطلب Gemini Code Assist رقم تعريف مشروع GCP ليعمل في منطقتك.
de: Gemini Code Assist benötigt eine GCP-Projekt-ID, um in Ihrer Region zu funktionieren.
es: Gemini Code Assist requiere un ID de proyecto de GCP para funcionar en tu región.
fr: Gemini Code Assist nécessite un ID de projet GCP pour fonctionner dans votre région.
it: Gemini Code Assist richiede un ID progetto GCP per funzionare nella tua regione.
ja: Gemini Code Assist をご利用の地域で使うには GCP プロジェクト ID が必要です。
pl: Gemini Code Assist wymaga identyfikatora projektu GCP, aby działać w Twoim regionie.
pt_br: O Gemini Code Assist requer um ID de projeto GCP para funcionar na sua região.
ru: Для работы Gemini Code Assist в вашем регионе требуется указать идентификатор проекта GCP.
tr: Gemini Code Assist, bölgenizde çalışabilmesi için bir GCP proje kimliği gerektirir.
uk: Для роботи Gemini Code Assist у вашому регіоні потрібен ідентифікатор проєкту GCP.

source: Find your project ID at: https://console.cloud.google.com
ar: ابحث عن رقم تعريف مشروعك على: https://console.cloud.google.com
de: Ihre Projekt-ID finden Sie unter: https://console.cloud.google.com
es: Encuentra tu ID de proyecto en: https://console.cloud.google.com
fr: Trouvez votre ID de projet sur : https://console.cloud.google.com
it: Trova il tuo ID progetto su: https://console.cloud.google.com
ja: プロジェクト ID は以下で確認できます: https://console.cloud.google.com
pl: Znajdź swój identyfikator projektu na: https://console.cloud.google.com
pt_br: Encontre seu ID de projeto em: https://console.cloud.google.com
ru: Найдите свой идентификатор проекта здесь: https://console.cloud.google.com
tr: Proje kimliğinizi buradan bulabilirsiniz: https://console.cloud.google.com
uk: Знайдіть свій ідентифікатор проєкту тут: https://console.cloud.google.com

source: (Create a project if you don't have one, then enable the Gemini API)
ar: (أنشئ مشروعًا إذا لم يكن لديك واحد، ثم فعّل Gemini API)
de: (Erstellen Sie ein Projekt, falls Sie noch keines haben, und aktivieren Sie anschließend die Gemini API)
es: (Crea un proyecto si no tienes uno, luego habilita la API de Gemini)
fr: (Créez un projet si vous n'en avez pas, puis activez l'API Gemini)
it: (Crea un progetto se non ne hai uno, poi abilita la Gemini API)
ja: （プロジェクトがない場合は作成し、Gemini API を有効化してください）
pl: (Utwórz projekt, jeśli jeszcze go nie masz, a następnie włącz Gemini API)
pt_br: (Crie um projeto se ainda não tiver, depois ative a API Gemini)
ru: (Создайте проект, если его ещё нет, затем включите Gemini API)
tr: (Bir projeniz yoksa oluşturun, ardından Gemini API'sini etkinleştirin)
uk: (Створіть проєкт, якщо у вас його ще немає, потім увімкніть Gemini API)

source: GCP Project ID (or press Enter to skip):
ar: معرّف مشروع GCP (أو اضغط Enter للتخطي):
de: GCP-Projekt-ID (oder Enter zum Überspringen):
es: ID de proyecto GCP (o pulsa Enter para omitir):
fr: ID projet GCP (ou Entrée pour ignorer) :
it: ID Progetto GCP (o premi Invio per saltare):
ja: GCPプロジェクトID（スキップする場合はEnter）:
pl: ID projektu GCP (lub naciśnij Enter, aby pominąć):
pt_br: ID do projeto GCP (ou pressione Enter para pular):
ru: ID проекта GCP (или нажмите Enter для пропуска):
tr: GCP Proje Kimliği (atlamak için Enter'a basın):
uk: GCP Project ID (або натисніть Enter для пропуску):

source: Code Assist setup failed: %v
ar: فشل إعداد Code Assist: %v
de: Code Assist-Setup fehlgeschlagen: %v
es: Error al configurar Code Assist: %v
fr: Échec de la configuration de Code Assist : %v
it: Configurazione di Code Assist non riuscita: %v
ja: Code Assist のセットアップに失敗しました: %v
pl: Nie udało się skonfigurować Code Assist: %v
pt_br: Falha na configuração do Code Assist: %v
ru: Не удалось настроить Code Assist: %v
tr: Code Assist kurulumu başarısız oldu: %v
uk: Не вдалося налаштувати Code Assist: %v

source: Project ID saved. You can try again later.
ar: تم حفظ رقم تعريف المشروع. يمكنك المحاولة مرة أخرى لاحقًا.
de: Projekt-ID gespeichert. Sie können es später erneut versuchen.
es: ID de proyecto guardado. Puedes intentarlo de nuevo más tarde.
fr: ID de projet enregistré. Vous pouvez réessayer plus tard.
it: ID progetto salvato. Puoi riprovare più tardi.
ja: プロジェクト ID を保存しました。後でもう一度お試しください。
pl: Identyfikator projektu zapisany. Możesz spróbować ponownie później.
pt_br: ID do projeto salvo. Você pode tentar novamente mais tarde.
ru: Идентификатор проекта сохранён. Вы можете попробовать снова позже.
tr: Proje kimliği kaydedildi. Daha sonra tekrar deneyebilirsiniz.
uk: Ідентифікатор проєкту збережено. Ви можете спробувати ще раз пізніше.

source: Code Assist project configured!
ar: تم تكوين مشروع Code Assist!
de: Code Assist-Projekt konfiguriert!
es: ¡Proyecto de Code Assist configurado!
fr: Projet Code Assist configuré !
it: Progetto Code Assist configurato!
ja: Code Assist プロジェクトが設定されました！
pl: Projekt Code Assist skonfigurowany!
pt_br: Projeto do Code Assist configurado!
ru: Проект для Code Assist настроен!
tr: Code Assist projesi yapılandırıldı!
uk: Проєкт для Code Assist налаштовано!

source: Skipped. You can set it later with:
ar: تم التخطي. يمكنك تعيينه لاحقًا باستخدام:
de: Übersprungen. Sie können dies später festlegen mit:
es: Omitido. Puedes configurarlo más tarde con:
fr: Ignoré. Vous pourrez le définir plus tard avec :
it: Saltato. Puoi impostarlo in seguito con:
ja: スキップしました。後から以下のコマンドで設定できます:
pl: Pominięto. Możesz ustawić to później za pomocą:
pt_br: Pulado. Você pode configurar depois com:
ru: Пропущено. Вы можете задать его позже с помощью:
tr: Atlandı. Daha sonra şu komutla ayarlayabilirsiniz:
uk: Пропущено. Ви можете налаштувати це пізніше за допомогою:

source: OAuth login succeeded but Code Assist onboarding failed.
ar: تم تسجيل الدخول عبر OAuth بنجاح لكن فشل إعداد Code Assist.
de: OAuth-Anmeldung war erfolgreich, aber das Code Assist-Onboarding ist fehlgeschlagen.
es: El inicio de sesión por OAuth fue exitoso pero la configuración de Code Assist falló.
fr: Connexion OAuth réussie mais l'intégration de Code Assist a échoué.
it: Accesso OAuth riuscito ma onboarding di Code Assist non riuscito.
ja: OAuth ログインには成功しましたが、Code Assist のオンボーディングに失敗しました。
pl: Logowanie OAuth powiodło się, ale onboarding Code Assist nie powiódł się.
pt_br: Login OAuth realizado com sucesso, mas a configuração do Code Assist falhou.
ru: OAuth-вход выполнен успешно, но настройка Code Assist не завершена.
tr: OAuth ile giriş başarılı ancak Code Assist kurulumu başarısız oldu.
uk: Вхід через OAuth пройшов успішно, але налаштування Code Assist не вдалося.

source: This will be retried automatically on first translate.
ar: سيتم إعادة المحاولة تلقائيًا عند أول ترجمة.
de: Dies wird beim ersten Übersetzen automatisch erneut versucht.
es: Esto se reintentará automáticamente al primer uso de translate.
fr: Cela sera réessayé automatiquement lors de la première traduction.
it: Il tentativo verrà ripetuto automaticamente al primo translate.
ja: 最初の翻訳時に自動で再試行されます。
pl: Zostanie to automatycznie ponowione przy pierwszym tłumaczeniu.
pt_br: Isso será tentado novamente automaticamente na primeira tradução.
ru: Попытка будет автоматически повторена при первом переводе.
tr: Bu işlem ilk çeviride otomatik olarak tekrar denenecek.
uk: Це буде автоматично повторено під час першого перекладу.

source: You can now use: lokit translate --provider gemini --model gemini-2.5-flash
ar: يمكنك الآن استخدام: lokit translate --provider gemini --model gemini-2.5-flash
de: Sie können jetzt verwenden: lokit translate --provider gemini --model gemini-2.5-flash
es: Ahora puedes usar: lokit translate --provider gemini --model gemini-2.5-flash
fr: Vous pouvez maintenant utiliser : lokit translate --provider gemini --model gemini-2.5-flash
it: Ora puoi usare: lokit translate --provider gemini --model gemini-2.5-flash
ja: 次のコマンドが利用可能になりました: lokit translate --provider gemini --model gemini-2.5-flash
pl: Możesz teraz użyć: lokit translate --provider gemini --model gemini-2.5-flash
pt_br: Agora você pode usar: lokit translate --provider gemini --model gemini-2.5-flash
ru: Теперь вы можете использовать: lokit translate --provider gemini --model gemini-2.5-flash
tr: Artık şunu kullanabilirsiniz: lokit translate --provider gemini --model gemini-2.5-flash
uk: Тепер ви можете використовувати: lokit translate --provider gemini --model gemini-2.5-flash

source: (no API key needed when authenticated via OAuth)
ar: (لا حاجة لمفتاح API عند المصادقة عبر OAuth)
de: (Kein API-Schlüssel erforderlich, wenn Sie über OAuth authentifiziert sind)
es: (no se necesita clave API si estás autenticado por OAuth)
fr: (aucune clé API nécessaire si authentifié via OAuth)
it: (nessuna API key necessaria se autenticato tramite OAuth)
ja: （OAuth で認証済みの場合、API キーは不要です）
pl: (nie jest wymagany klucz API przy uwierzytelnieniu przez OAuth)
pt_br: (não é necessário chave de API quando autenticado via OAuth)
ru: (API-ключ не требуется при аутентификации через OAuth)
tr: (OAuth ile kimlik doğrulandıysa API anahtarı gerekmez)
uk: (API-ключ не потрібен при автентифікації через OAuth)

source: %s — API Key Setup
ar: %s — إعداد مفتاح API
de: %s — API-Schlüssel-Einrichtung
es: %s — Configuración de clave API
fr: %s — Configuration de la clé API
it: %s — Configurazione API Key
ja: %s — API キー設定
pl: %s — Konfiguracja klucza API
pt_br: %s — Configuração da chave de API
ru: %s — настройка API-ключа
tr: %s — API Anahtarı Kurulumu
uk: %s — налаштування API-ключа

source: Get your API key from: %s%s%s
ar: احصل على مفتاح API الخاص بك من: %s%s%s
de: Ihren API-Schlüssel erhalten Sie unter: %s%s%s
es: Obtén tu clave API en: %s%s%s
fr: Récupérez votre clé API sur : %s%s%s
it: Recupera la tua API key da: %s%s%s
ja: API キーは以下から取得してください: %s%s%s
pl: Pobierz swój klucz API z: %s%s%s
pt_br: Obtenha sua chave de API em: %s%s%s
ru: Получите свой API-ключ по адресу: %s%s%s
tr: API anahtarınızı buradan alın: %s%s%s
uk: Отримайте свій API-ключ тут: %s%s%s

source: Current key
ar: المفتاح الحالي
de: Aktueller Schlüssel
es: Clave actual
fr: Clé actuelle
it: Chiave attuale
ja: 現在のキー
pl: Aktualny klucz
pt_br: Chave atual
ru: Текущий ключ
tr: Mevcut anahtar
uk: Поточний ключ

source: Enter new key to replace, or press Enter to keep:
ar: أدخل مفتاحًا جديدًا للاستبدال، أو اضغط Enter للاحتفاظ بالحالي:
de: Neuen Schlüssel eingeben, oder Enter zum Beibehalten:
es: Introduce la nueva clave para reemplazar, o pulsa Enter para mantener:
fr: Saisissez la nouvelle clé à remplacer, ou Entrée pour conserver :
it: Inserisci nuova chiave da sostituire, o premi Invio per mantenere:
ja: 新しいキーを入力（変更しない場合はEnter）:
pl: Wprowadź nowy klucz do podmiany lub naciśnij Enter, aby zachować:
pt_br: Digite a nova chave para substituir, ou pressione Enter para manter:
ru: Введите новый ключ для замены или нажмите Enter, чтобы оставить:
tr: Değiştirilecek yeni anahtarı girin veya mevcut kalması için Enter'a basın:
uk: Введіть новий ключ для заміни або натисніть Enter, щоб залишити:

source: Enter API key:
ar: أدخل مفتاح API:
de: API-Schlüssel eingeben:
es: Introduce la clave API:
fr: Saisissez la clé API :
it: Inserisci chiave API:
ja: APIキーを入力してください:
pl: Wprowadź klucz API:
pt_br: Digite a chave de API:
ru: Введите API-ключ:
tr: API anahtarını girin:
uk: Введіть API-ключ:

source: Keeping existing key
ar: الاحتفاظ بالمفتاح الحالي
de: Vorhandener Schlüssel wird beibehalten
es: Manteniendo la clave existente
fr: Conservation de la clé existante
it: Mantenimento della chiave esistente
ja: 既存のキーを保持します
pl: Zachowano istniejący klucz
pt_br: Mantendo a chave existente
ru: Используется существующий ключ
tr: Mevcut anahtar korunuyor
uk: Зберігаємо існуючий ключ

source: No API key provided
ar: لم يتم تقديم مفتاح API
de: Kein API-Schlüssel angegeben
es: No se proporcionó clave API
fr: Aucune clé API fournie
it: Nessuna API key fornita
ja: API キーが指定されていません
pl: Nie podano klucza API
pt_br: Nenhuma chave de API fornecida
ru: API-ключ не указан
tr: API anahtarı girilmedi
uk: API-ключ не вказано

source: Failed to save API key: %v
ar: فشل حفظ مفتاح API: %v
de: API-Schlüssel konnte nicht gespeichert werden: %v
es: No se pudo guardar la clave API: %v
fr: Échec de l'enregistrement de la clé API : %v
it: Salvataggio della API key non riuscito: %v
ja: API キーの保存に失敗しました: %v
pl: Nie udało się zapisać klucza API: %v
pt_br: Falha ao salvar a chave de API: %v
ru: Не удалось сохранить API-ключ: %v
tr: API anahtarı kaydedilemedi: %v
uk: Не вдалося зберегти API-ключ: %v

source: %s API key saved!
ar: تم حفظ مفتاح API لـ%s!
de: %s API-Schlüssel gespeichert!
es: ¡Clave API de %s guardada!
fr: Clé API %s enregistrée !
it: %s API key salvata!
ja: %s の API キーを保存しました！
pl: %s Klucz API zapisany!
pt_br: Chave de API %s salva!
ru: %s API-ключ сохранён!
tr: %s API anahtarı kaydedildi!
uk: %s API-ключ збережено!

source: You can now use: %s
ar: يمكنك الآن استخدام: %s
de: Sie können jetzt verwenden: %s
es: Ahora puedes usar: %s
fr: Vous pouvez maintenant utiliser : %s
it: Ora puoi usare: %s
ja: 次のコマンドが利用可能になりました: %s
pl: Możesz teraz użyć: %s
pt_br: Agora você pode usar: %s
ru: Теперь вы можете использовать: %s
tr: Artık şunu kullanabilirsiniz: %s
uk: Тепер ви можете використовувати: %s

source: Custom OpenAI-Compatible Endpoint
ar: نقطة نهاية مخصصة متوافقة مع OpenAI
de: Benutzerdefinierter OpenAI-kompatibler Endpoint
es: Endpoint personalizado compatible con OpenAI
fr: Point de terminaison OpenAI compatible personnalisé
it: Endpoint personalizzato compatibile OpenAI
ja: カスタム OpenAI 互換エンドポイント
pl: Własny endpoint zgodny z OpenAI
pt_br: Endpoint personalizado compatível com OpenAI
ru: Пользовательский OpenAI-совместимый endpoint
tr: Özel OpenAI-Uyumlu Uç Nokta
uk: Користувацький сумісний з OpenAI endpoint

source: Current endpoint
ar: نقطة النهاية الحالية
de: Aktueller Endpoint
es: Endpoint actual
fr: Point de terminaison actuel
it: Endpoint attuale
ja: 現在のエンドポイント
pl: Aktualny endpoint
pt_br: Endpoint atual
ru: Текущий endpoint
tr: Mevcut uç nokta
uk: Поточний endpoint

source: Enter new endpoint URL, or press Enter to keep:
ar: أدخل عنوان نقطة نهاية جديد، أو اضغط Enter للاحتفاظ بالحالي:
de: Neue Endpunkt-URL eingeben, oder Enter zum Beibehalten:
es: Introduce la nueva URL del endpoint, o pulsa Enter para mantener:
fr: Saisissez la nouvelle URL du point de terminaison, ou Entrée pour conserver :
it: Inserisci nuovo URL endpoint, o premi Invio per mantenere:
ja: 新しいエンドポイントURLを入力（変更しない場合はEnter）:
pl: Wprowadź nowy URL endpointu lub naciśnij Enter, aby zachować:
pt_br: Digite a nova URL do endpoint, ou pressione Enter para manter:
ru: Введите новый URL endpoint или нажмите Enter, чтобы оставить:
tr: Yeni uç nokta URL'si girin veya mevcut kalması için Enter'a basın:
uk: Введіть новий URL endpoint або натисніть Enter, щоб залишити:

source: Enter endpoint URL (e.g., https://api.example.com/v1):
ar: أدخل عنوان نقطة النهاية (مثال: https://api.example.com/v1):
de: Endpunkt-URL eingeben (z. B. https://api.example.com/v1):
es: Introduce la URL del endpoint (ej., https://api.example.com/v1):
fr: Saisissez l'URL du point de terminaison (ex. : https://api.example.com/v1) :
it: Inserisci URL endpoint (es. https://api.example.com/v1):
ja: エンドポイントURLを入力（例: https://api.example.com/v1）:
pl: Podaj URL endpointu (np. https://api.example.com/v1):
pt_br: Digite a URL do endpoint (ex: https://api.exemplo.com/v1):
ru: Введите URL endpoint (например, https://api.example.com/v1):
tr: Uç nokta URL'si girin (örn. https://api.example.com/v1):
uk: Введіть URL endpoint (наприклад, https://api.example.com/v1):

source: Endpoint URL is required
ar: عنوان URL لنقطة النهاية مطلوب
de: Endpoint-URL ist erforderlich
es: Se requiere la URL del endpoint
fr: L'URL du point de terminaison est requise
it: URL dell'endpoint richiesto
ja: エンドポイント URL は必須です
pl: Wymagany jest adres URL endpointu
pt_br: URL do endpoint é obrigatório
ru: Требуется указать URL endpoint
tr: Uç nokta URL'si gerekli
uk: Потрібно вказати URL endpoint

source: Enter new API key, or press Enter to keep (leave empty for none):
ar: أدخل مفتاح API جديد، أو اضغط Enter للاحتفاظ بالحالي (اتركه فارغًا إذا لا يوجد):
de: Neuen API-Schlüssel eingeben, oder Enter zum Beibehalten (leer lassen für keinen):
es: Introduce la nueva clave API, o pulsa Enter para mantener (deja vacío para ninguna):
fr: Saisissez la nouvelle clé API, ou Entrée pour conserver (laisser vide pour aucune) :
it: Inserisci nuova chiave API, o premi Invio per mantenere (lascia vuoto per nessuna):
ja: 新しいAPIキーを入力（未設定の場合は空欄のままEnter）:
pl: Wprowadź nowy klucz API lub naciśnij Enter, aby zachować (pozostaw puste, aby usunąć):
pt_br: Digite a nova chave de API, ou pressione Enter para manter (deixe em branco para nenhuma):
ru: Введите новый API-ключ или нажмите Enter, чтобы оставить (оставьте пустым для отсутствия):
tr: Yeni API anahtarını girin veya mevcut kalması için Enter'a basın (hiçbiri için boş bırakın):
uk: Введіть новий API-ключ або натисніть Enter, щоб залишити (залиште порожнім для відсутності):

source: Enter API key (or press Enter if not required):
ar: أدخل مفتاح API (أو اضغط Enter إذا لم يكن مطلوبًا):
de: API-Schlüssel eingeben (oder Enter, falls nicht erforderlich):
es: Introduce la clave API (o pulsa Enter si no es requerida):
fr: Saisissez la clé API (ou Entrée si non requise) :
it: Inserisci chiave API (o premi Invio se non richiesta):
ja: APIキーを入力（不要な場合はEnter）:
pl: Podaj klucz API (lub naciśnij Enter, jeśli nie jest wymagany):
pt_br: Digite a chave de API (ou pressione Enter se não for necessário):
ru: Введите API-ключ (или нажмите Enter, если не требуется):
tr: API anahtarını girin (gerekli değilse Enter'a basın):
uk: Введіть API-ключ (або натисніть Enter, якщо не потрібен):

source: Failed to save credentials: %v
ar: فشل حفظ بيانات الاعتماد: %v
de: Anmeldedaten konnten nicht gespeichert werden: %v
es: No se pudieron guardar las credenciales: %v
fr: Échec de l'enregistrement des identifiants : %v
it: Salvataggio delle credenziali non riuscito: %v
ja: 認証情報の保存に失敗しました: %v
pl: Nie udało się zapisać danych logowania: %v
pt_br: Falha ao salvar as credenciais: %v
ru: Не удалось сохранить учётные данные: %v
tr: Kimlik bilgileri kaydedilemedi: %v
uk: Не вдалося зберегти облікові дані: %v

source: Custom OpenAI endpoint saved!
ar: تم حفظ نقطة نهاية OpenAI المخصصة!
de: Benutzerdefinierter OpenAI-Endpoint gespeichert!
es: ¡Endpoint personalizado de OpenAI guardado!
fr: Point de terminaison OpenAI personnalisé enregistré !
it: Endpoint OpenAI personalizzato salvato!
ja: カスタム OpenAI エンドポイントを保存しました！
pl: Własny endpoint OpenAI zapisany!
pt_br: Endpoint OpenAI personalizado salvo!
ru: Пользовательский OpenAI endpoint сохранён!
tr: Özel OpenAI uç noktası kaydedildi!
uk: Користувацький OpenAI endpoint збережено!
