Repository: minios-linux/lokit
Catalog: po/*.po
Languages: ar, de, es, fr, it, ja, pl, pt_br, ru, tr, uk

source: provider 'custom-openai' requires an endpoint URL Option 1: Configure via auth: lokit auth login --provider custom-openai Option 2: Pass directly: --base-url https://api.example.com/v1
ar: المزود 'custom-openai' يتطلب عنوان نقطة نهاية الخيار 1: ضبط عبر auth: lokit auth login --provider custom-openai الخيار 2: تمرير مباشرة: --base-url https://api.example.com/v1
de: Anbieter 'custom-openai' benötigt eine Endpunkt-URL Option 1: Über Auth konfigurieren: lokit auth login --provider custom-openai Option 2: Direkt übergeben: --base-url https://api.example.com/v1
es: el proveedor 'custom-openai' requiere una URL de endpoint Opción 1: Configura vía auth: lokit auth login --provider custom-openai Opción 2: Pásala directamente: --base-url https://api.example.com/v1
fr: le fournisseur 'custom-openai' nécessite une URL de point de terminaison Option 1 : Configurer via auth : lokit auth login --provider custom-openai Option 2 : Passer directement : --base-url https://api.example.com/v1
it: il provider 'custom-openai' richiede un URL endpoint Opzione 1: Configura tramite auth: lokit auth login --provider custom-openai Opzione 2: Passa direttamente: --base-url https://api.example.com/v1
ja: プロバイダー「custom-openai」にはエンドポイントURLが必要です 方法1: 認証で設定: lokit auth login --provider custom-openai 方法2: 直接指定: --base-url https://api.example.com/v1
pl: dostawca 'custom-openai' wymaga URL endpointu Opcja 1: Skonfiguruj przez auth: lokit auth login --provider custom-openai Opcja 2: Przekaż bezpośrednio: --base-url https://api.example.com/v1
pt_br: o provedor 'custom-openai' requer uma URL de endpoint Opção 1: Configure via auth: lokit auth login --provider custom-openai Opção 2: Passe diretamente: --base-url https://api.exemplo.com/v1
ru: провайдер 'custom-openai' требует URL endpoint Вариант 1: Настроить через auth: lokit auth login --provider custom-openai Вариант 2: Передать напрямую: --base-url https://api.example.com/v1
tr: 'custom-openai' sağlayıcısı için bir uç nokta URL'si gereklidir Seçenek 1: Kimlik doğrulama ile yapılandırın: lokit auth login --provider custom-openai Seçenek 2: Doğrudan iletin: --base-url https://api.example.com/v1
uk: провайдер 'custom-openai' вимагає URL endpoint Варіант 1: Налаштувати через auth: lokit auth login --provider custom-openai Варіант 2: Передати напряму: --base-url https://api.example.com/v1

source: provider 'ollama' requires Ollama server to be running Start Ollama with: ollama serve Install from: https://ollama.com Alternative providers: --provider copilot (GitHub Copilot, free) --provider google (requires API key)
ar: المزود 'ollama' يتطلب تشغيل خادم Ollama ابدأ Ollama باستخدام: ollama serve قم بالتثبيت من: https://ollama.com مزودون بديلون: --provider copilot (GitHub Copilot، مجاني) --provider google (يتطلب مفتاح API)
de: Anbieter 'ollama' benötigt laufenden Ollama-Server Ollama starten mit: ollama serve Download unter: https://ollama.com Alternative Anbieter: --provider copilot (GitHub Copilot, kostenlos) --provider google (API-Schlüssel erforderlich)
es: el proveedor 'ollama' requiere que el servidor Ollama esté en ejecución Inicia Ollama con: ollama serve Instala desde: https://ollama.com Proveedores alternativos: --provider copilot (GitHub Copilot, gratis) --provider google (requiere clave API)
fr: le fournisseur 'ollama' nécessite que le serveur Ollama soit en cours d'exécution Démarrez Ollama avec : ollama serve Installer depuis : https://ollama.com Fournisseurs alternatifs : --provider copilot (GitHub Copilot, gratuit) --provider google (clé API requise)
it: il provider 'ollama' richiede che il server Ollama sia in esecuzione Avvia Ollama con: ollama serve Installa da: https://ollama.com Provider alternativi: --provider copilot (GitHub Copilot, gratis) --provider google (richiede chiave API)
ja: プロバイダー「ollama」はOllamaサーバーの起動が必要です Ollamaの起動: ollama serve インストール: https://ollama.com 他のプロバイダー例: --provider copilot （GitHub Copilot、無料） --provider google （APIキーが必要）
pl: dostawca 'ollama' wymaga uruchomionego serwera Ollama Uruchom Ollama poleceniem: ollama serve Pobierz z: https://ollama.com Alternatywni dostawcy: --provider copilot (GitHub Copilot, darmowe) --provider google (wymaga klucza API)
pt_br: o provedor 'ollama' requer que o servidor Ollama esteja em execução Inicie o Ollama com: ollama serve Instale em: https://ollama.com Provedores alternativos: --provider copilot (GitHub Copilot, gratuito) --provider google (requer chave de API)
ru: провайдер 'ollama' требует запущенный сервер Ollama Запустите Ollama командой: ollama serve Скачать: https://ollama.com Альтернативные провайдеры: --provider copilot (GitHub Copilot, бесплатно) --provider google (требуется API-ключ)
tr: 'ollama' sağlayıcısı için Ollama sunucusunun çalışıyor olması gerekir Ollama'yı başlatmak için: ollama serve Kurulum: https://ollama.com Alternatif sağlayıcılar: --provider copilot (GitHub Copilot, ücretsiz) --provider google (API anahtarı gerektirir)
uk: провайдер 'ollama' вимагає запущений сервер Ollama Запустіть Ollama командою: ollama serve Завантажити: https://ollama.com Альтернативні провайдери: --provider copilot (GitHub Copilot, безкоштовно) --provider google (потрібен API-ключ)

source: No lokit.yaml found in %s
ar: لم يتم العثور على lokit.yaml في %s
de: Keine lokit.yaml in %s gefunden
es: No se encontró lokit.yaml en %s
fr: Aucun lokit.yaml trouvé dans %s
it: Nessun lokit.yaml trovato in %s
ja: %s にlokit.yamlが見つかりません
pl: Nie znaleziono pliku lokit.yaml w %s
pt_br: Nenhum lokit.yaml encontrado em %s
ru: Файл lokit.yaml не найден в %s
tr: %s içinde lokit.yaml bulunamadı
uk: Не знайдено lokit.yaml у %s

source: Create a lokit.yaml configuration file. See 'lokit init --help' for format reference.
ar: أنشئ ملف إعدادات lokit.yaml. راجع 'lokit init --help' لمرجع التنسيق.
de: Erstelle eine lokit.yaml-Konfigurationsdatei. Siehe 'lokit init --help' für Formatreferenz.
es: Crea un archivo de configuración lokit.yaml. Consulta 'lokit init --help' para referencia de formato.
fr: Créer un fichier de configuration lokit.yaml. Voir 'lokit init --help' pour le format.
it: Crea un file di configurazione lokit.yaml. Consulta 'lokit init --help' per il riferimento al formato.
ja: lokit.yaml設定ファイルを作成します。書式の参考は'lokit init --help'をご覧ください。
pl: Utwórz plik konfiguracyjny lokit.yaml. Zobacz 'lokit init --help' po szczegóły formatu.
pt_br: Crie um arquivo de configuração lokit.yaml. Veja 'lokit init --help' para referência de formato.
ru: Создайте конфигурационный файл lokit.yaml. Формат смотрите в 'lokit init --help'.
tr: Bir lokit.yaml yapılandırma dosyası oluşturun. Format referansı için 'lokit init --help' komutuna bakın.
uk: Створіть конфігураційний файл lokit.yaml. Формат дивіться у 'lokit init --help'.

source: cannot find source YAML file for language %q in %s
ar: تعذر العثور على ملف YAML المصدر للغة %q في %s
de: Kann YAML-Quelldatei für Sprache %q in %s nicht finden
es: no se puede encontrar el archivo YAML de origen para el idioma %q en %s
fr: impossible de trouver le fichier source YAML pour la langue %q dans %s
it: impossibile trovare il file YAML sorgente per la lingua %q in %s
ja: 言語 %q 用のソースYAMLファイルが %s に見つかりません
pl: nie można znaleźć pliku źródłowego YAML dla języka %q w %s
pt_br: não foi possível encontrar o arquivo YAML de origem para o idioma %q em %s
ru: не удалось найти исходный YAML-файл для языка %q в %s
tr: Dil %q için kaynak YAML dosyası %s içinde bulunamıyor
uk: Не вдалося знайти вихідний YAML-файл для мови %q у %s

source: cannot read source YAML %s: %w
ar: تعذر قراءة ملف YAML المصدر %s: %w
de: Kann YAML-Quelle %s nicht lesen: %w
es: no se puede leer el YAML de origen %s: %w
fr: impossible de lire le fichier source YAML %s : %w
it: impossibile leggere il file YAML sorgente %s: %w
ja: ソースYAML %s を読み込めません: %w
pl: nie można odczytać pliku źródłowego YAML %s: %w
pt_br: não foi possível ler o YAML de origem %s: %w
ru: не удалось прочитать исходный YAML %s: %w
tr: Kaynak YAML %s okunamıyor: %w
uk: Не вдалося прочитати вихідний YAML %s: %w

source: Project
ar: المشروع
de: Projekt
es: Proyecto
fr: Projet
it: Progetto
ja: プロジェクト
pl: Projekt
pt_br: Projeto
ru: Проект
tr: Proje
uk: Проєкт

source: Config
ar: التهيئة
de: Konfiguration
es: Configuración
fr: Configuration
it: Configurazione
ja: 設定
pl: Konfiguracja
pt_br: Configuração
ru: Конфиг
tr: Yapılandırma
uk: Конфіг

source: Root
ar: الجذر
es: Raíz
fr: Racine
ja: ルート
pl: Katalog główny
pt_br: Raiz
ru: Корень
tr: Kök
uk: Корінь

source: No YAML files to translate
ar: لا توجد ملفات YAML للترجمة
de: Keine YAML-Dateien zum Übersetzen vorhanden
es: No hay archivos YAML para traducir
fr: Aucun fichier YAML à traduire
it: Nessun file YAML da tradurre
ja: 翻訳対象のYAMLファイルがありません
pl: Brak plików YAML do tłumaczenia
pt_br: Nenhum arquivo YAML para traduzir
ru: Нет YAML-файлов для перевода
tr: Çevrilecek YAML dosyası yok
uk: Немає YAML-файлів для перекладу

source: Source lang
ar: لغة المصدر
de: Quellsprache
es: Idioma fuente
fr: Langue source
it: Lingua sorgente
ja: ソース言語
pl: Język źródłowy
pt_br: Idioma de origem
ru: Исходный язык
tr: Kaynak dil
uk: Мова джерела

source: %s: %d/%d strings
ar: %s: %d/%d نص
es: %s: %d/%d cadenas
fr: %s : %d/%d chaînes
it: %s: %d/%d stringhe
ja: %s: %d/%d 件の文字列
pl: %s: %d/%d ciągów
ru: %s: %d/%d строк
tr: %s: %d/%d string
uk: %s: %d/%d рядків

source: Languages
ar: اللغات
de: Sprachen
es: Idiomas
fr: Langues
it: Lingue
ja: 言語
pl: Języki
pt_br: Idiomas
ru: Языки
tr: Diller
uk: Мови

source: Targets
ar: الأهداف
de: Ziele
es: Destinos
fr: Cibles
it: Destinazioni
ja: ターゲット
pl: Cele
pt_br: Destinos
ru: Цели
tr: Hedefler
uk: Цілі

source: Source segments
ar: مقاطع المصدر
de: Quellsegmente
es: Segmentos de origen
fr: Segments source
it: Segmenti sorgente
ja: ソースセグメント
pl: Segmenty źródłowe
pt_br: Segmentos de origem
ru: Исходные сегменты
tr: Kaynak segmentler
uk: Вихідні сегменти

source: Config resolve error: %v
ar: خطأ في حل التهيئة: %v
de: Fehler beim Auflösen der Konfiguration: %v
es: Error al resolver la configuración: %v
fr: Erreur de résolution de la configuration : %v
it: Errore nella risoluzione della configurazione: %v
ja: 設定の解決エラー: %v
pl: Błąd rozwiązywania konfiguracji: %v
pt_br: Erro ao resolver configuração: %v
ru: Ошибка разрешения конфигурации: %v
tr: Yapılandırma çözümleme hatası: %v
uk: Помилка розбору конфігурації: %v

source: Cannot find source Markdown files in %s
ar: تعذر العثور على ملفات Markdown المصدر في %s
de: Kann keine Markdown-Quelldateien in %s finden
es: No se pueden encontrar archivos Markdown de origen en %s
fr: Impossible de trouver les fichiers source Markdown dans %s
it: Impossibile trovare file Markdown sorgente in %s
ja: %s 内にソースMarkdownファイルが見つかりません
pl: Nie można znaleźć plików źródłowych Markdown w %s
pt_br: Não foi possível encontrar arquivos Markdown de origem em %s
ru: Не удалось найти исходные Markdown-файлы в %s
tr: %s içinde kaynak Markdown dosyaları bulunamadı
uk: Не вдалося знайти вихідні Markdown-файли у %s

source: Expected: %s/*.md
ar: المتوقع: %s/*.md
de: Erwartet: %s/*.md
es: Esperado: %s/*.md
fr: Attendu : %s/*.md
it: Atteso: %s/*.md
ja: 期待値: %s/*.md
pl: Oczekiwano: %s/*.md
pt_br: Esperado: %s/*.md
ru: Ожидалось: %s/*.md
tr: Beklenen: %s/*.md
uk: Очікується: %s/*.md

source: Source language (%s): %d files
ar: لغة المصدر (%s): %d ملف
de: Quellsprache (%s): %d Dateien
es: Idioma de origen (%s): %d archivos
fr: Langue source (%s) : %d fichiers
it: Lingua sorgente (%s): %d file
ja: ソース言語（%s）: %d ファイル
pl: Język źródłowy (%s): %d plików
pt_br: Idioma de origem (%s): %d arquivos
ru: Язык-источник (%s): %d файлов
tr: Kaynak dil (%s): %d dosya
uk: Мова оригіналу (%s): %d файлів

source: Cannot read source Markdown file %s: %v
ar: تعذر قراءة ملف Markdown المصدر %s: %v
de: Kann Markdown-Quelldatei %s nicht lesen: %v
es: No se puede leer el archivo Markdown de origen %s: %v
fr: Impossible de lire le fichier source Markdown %s : %v
it: Impossibile leggere il file Markdown sorgente %s: %v
ja: ソースMarkdownファイル %s を読み込めません: %v
pl: Nie można odczytać pliku źródłowego Markdown %s: %v
pt_br: Não foi possível ler o arquivo Markdown de origem %s: %v
ru: Не удалось прочитать исходный Markdown-файл %s: %v
tr: Kaynak Markdown dosyası %s okunamıyor: %v
uk: Не вдалося прочитати вихідний Markdown-файл %s: %v

source: Created: %s (%d segments)
ar: تم الإنشاء: %s (%d مقطع)
de: Erstellt: %s (%d Segmente)
es: Creado: %s (%d segmentos)
fr: Créé : %s (%d segments)
it: Creato: %s (%d segmenti)
ja: 作成済み: %s（%d セグメント）
pl: Utworzono: %s (%d segmentów)
pt_br: Criado: %s (%d segmentos)
ru: Создано: %s (%d сегментов)
tr: Oluşturuldu: %s (%d segment)
uk: Створено: %s (%d сегментів)

source: Markdown init: %d created, %d updated
ar: تهيئة Markdown: تم إنشاء %d، تم تحديث %d
de: Markdown-Init: %d erstellt, %d aktualisiert
es: Markdown init: %d creados, %d actualizados
fr: Initialisation Markdown : %d créé, %d mis à jour
it: Markdown init: %d creati, %d aggiornati
ja: Markdown初期化: %d件作成、%d件更新
pl: Inicjalizacja Markdown: utworzono %d, zaktualizowano %d
pt_br: Markdown init: %d criado, %d atualizado
ru: Инициализация Markdown: создано — %d, обновлено — %d
tr: Markdown başlatma: %d oluşturuldu, %d güncellendi
uk: Markdown ініціалізація: створено %d, оновлено %d

source: cannot find source Markdown files in %s
ar: تعذر العثور على ملفات Markdown المصدر في %s
de: Kann keine Markdown-Quelldateien in %s finden
es: no se pueden encontrar archivos Markdown de origen en %s
fr: impossible de trouver les fichiers source Markdown dans %s
it: impossibile trovare file Markdown sorgente in %s
ja: %s 内にソースMarkdownファイルが見つかりません
pl: nie można znaleźć plików źródłowych Markdown w %s
pt_br: não foi possível encontrar arquivos Markdown de origem em %s
ru: не удалось найти исходные Markdown-файлы в %s
tr: %s içinde kaynak Markdown dosyası bulunamıyor
uk: Не вдалося знайти вихідні Markdown-файли у %s

source: Source segments: %d (%d files)
ar: مقاطع المصدر: %d (%d ملف)
de: Quellsegmente: %d (%d Dateien)
es: Segmentos de origen: %d (%d archivos)
fr: Segments source : %d (%d fichiers)
it: Segmenti sorgente: %d (%d file)
ja: ソースセグメント: %d（%d ファイル）
pl: Segmenty źródłowe: %d (%d plików)
pt_br: Segmentos de origem: %d (%d arquivos)
ru: Исходные сегменты: %d (%d файлов)
tr: Kaynak segmentler: %d (%d dosya)
uk: Вихідні сегменти: %d (%d файлів)

source: %s (%s): %d segments to translate
ar: %s (%s): %d مقطع للترجمة
de: %s (%s): %d Segmente zu übersetzen
es: %s (%s): %d segmentos por traducir
fr: %s (%s) : %d segments à traduire
it: %s (%s): %d segmenti da tradurre
ja: %s（%s）: 翻訳対象セグメント %d件
pl: %s (%s): %d segmentów do tłumaczenia
pt_br: %s (%s): %d segmentos para traduzir
ru: %s (%s): %d сегментов для перевода
tr: %s (%s): Çevrilecek %d segment
uk: %s (%s): %d сегментів для перекладу

source: none detected
ar: لم يتم الكشف عن أي شيء
de: keine erkannt
es: ninguno detectado
fr: aucune détectée
it: nessuna rilevata
ja: 検出されませんでした
pl: nie wykryto
pt_br: nenhum detectado
ru: не обнаружено
tr: hiçbiri algılanmadı
uk: не виявлено

source: No Markdown files to translate
ar: لا توجد ملفات Markdown للترجمة
de: Keine Markdown-Dateien zum Übersetzen vorhanden
es: No hay archivos Markdown para traducir
fr: Aucun fichier Markdown à traduire
it: Nessun file Markdown da tradurre
ja: 翻訳対象のMarkdownファイルがありません
pl: Brak plików Markdown do tłumaczenia
pt_br: Nenhum arquivo Markdown para traduzir
ru: Нет Markdown-файлов для перевода
tr: Çevrilecek Markdown dosyası yok
uk: Немає Markdown-файлів для перекладу

source: %s: %d/%d segments
ar: %s: %d/%d مقطع
de: %s: %d/%d Segmente
es: %s: %d/%d segmentos
it: %s: %d/%d segmenti
ja: %s: %d/%d セグメント
pl: %s: %d/%d segmentów
pt_br: %s: %d/%d segmentos
ru: %s: %d/%d сегментов
tr: %s: %d/%d segment
uk: %s: %d/%d сегментів

source: Cannot find source .properties file: %s
ar: تعذر العثور على ملف .properties المصدر: %s
de: Kann .properties-Quelldatei nicht finden: %s
es: No se puede encontrar el archivo .properties de origen: %s
fr: Impossible de trouver le fichier source .properties : %s
it: Impossibile trovare file .properties sorgente: %s
ja: ソース.propertiesファイルが見つかりません: %s
pl: Nie można znaleźć pliku źródłowego .properties: %s
pt_br: Não foi possível encontrar arquivo .properties de origem: %s
ru: Не удалось найти исходный .properties-файл: %s
tr: Kaynak .properties dosyası bulunamadı: %s
uk: Не вдалося знайти вихідний .properties-файл: %s

source: Cannot read source .properties file %s: %v
ar: تعذر قراءة ملف .properties المصدر %s: %v
de: Kann .properties-Quelldatei %s nicht lesen: %v
es: No se puede leer el archivo .properties de origen %s: %v
fr: Impossible de lire le fichier source .properties %s : %v
it: Impossibile leggere il file .properties sorgente %s: %v
ja: ソース.propertiesファイル %s を読み込めません: %v
pl: Nie można odczytać pliku źródłowego .properties %s: %v
pt_br: Não foi possível ler o arquivo .properties de origem %s: %v
ru: Не удалось прочитать исходный .properties-файл %s: %v
tr: Kaynak .properties dosyası %s okunamıyor: %v
uk: Не вдалося прочитати вихідний .properties-файл %s: %v

source: Properties init: %d created, %d updated
ar: تهيئة Properties: تم إنشاء %d، تم تحديث %d
de: Properties-Init: %d erstellt, %d aktualisiert
es: Properties init: %d creados, %d actualizados
fr: Initialisation Properties : %d créé, %d mis à jour
it: Properties init: %d creati, %d aggiornati
ja: Properties初期化: %d件作成、%d件更新
pl: Inicjalizacja properties: utworzono %d, zaktualizowano %d
pt_br: Properties init: %d criado, %d atualizado
ru: Инициализация Properties: создано — %d, обновлено — %d
tr: Properties başlatma: %d oluşturuldu, %d güncellendi
uk: Properties ініціалізація: створено %d, оновлено %d

source: cannot read source .properties file %s: %w
ar: تعذر قراءة ملف .properties المصدر %s: %w
de: Kann .properties-Quelldatei %s nicht lesen: %w
es: no se puede leer el archivo .properties de origen %s: %w
fr: impossible de lire le fichier source .properties %s : %w
it: impossibile leggere il file .properties sorgente %s: %w
ja: ソース.propertiesファイル %s を読み込めません: %w
pl: nie można odczytać pliku źródłowego .properties %s: %w
pt_br: não foi possível ler o arquivo .properties de origem %s: %w
ru: не удалось прочитать исходный .properties-файл %s: %w
tr: Kaynak .properties dosyası %s okunamıyor: %w
uk: Не вдалося прочитати вихідний .properties-файл %s: %w

source: No .properties files to translate
ar: لا توجد ملفات .properties للترجمة
de: Keine .properties-Dateien zum Übersetzen vorhanden
es: No hay archivos .properties para traducir
fr: Aucun fichier .properties à traduire
it: Nessun file .properties da tradurre
ja: 翻訳対象の.propertiesファイルがありません
pl: Brak plików .properties do tłumaczenia
pt_br: Nenhum arquivo .properties para traduzir
ru: Нет .properties-файлов для перевода
tr: Çevrilecek .properties dosyası yok
uk: Немає .properties-файлів для перекладу

source: Cannot find source ARB file: %s
ar: تعذر العثور على ملف ARB المصدر: %s
de: Kann ARB-Quelldatei nicht finden: %s
es: No se puede encontrar el archivo ARB de origen: %s
fr: Impossible de trouver le fichier source ARB : %s
it: Impossibile trovare file ARB sorgente: %s
ja: ソースARBファイルが見つかりません: %s
pl: Nie można znaleźć pliku źródłowego ARB: %s
pt_br: Não foi possível encontrar arquivo ARB de origem: %s
ru: Не удалось найти исходный ARB-файл: %s
tr: Kaynak ARB dosyası bulunamadı: %s
uk: Не вдалося знайти вихідний ARB-файл: %s

source: Cannot read source ARB file %s: %v
ar: تعذر قراءة ملف ARB المصدر %s: %v
de: Kann ARB-Quelldatei %s nicht lesen: %v
es: No se puede leer el archivo ARB de origen %s: %v
fr: Impossible de lire le fichier source ARB %s : %v
it: Impossibile leggere il file ARB sorgente %s: %v
ja: ソースARBファイル %s を読み込めません: %v
pl: Nie można odczytać pliku źródłowego ARB %s: %v
pt_br: Não foi possível ler o arquivo ARB de origem %s: %v
ru: Не удалось прочитать исходный ARB-файл %s: %v
tr: Kaynak ARB dosyası %s okunamıyor: %v
uk: Не вдалося прочитати вихідний ARB-файл %s: %v

source: run 'lokit init'
ar: نفذ 'lokit init'
de: Führen Sie 'lokit init' aus
es: ejecuta 'lokit init'
fr: exécutez 'lokit init'
it: esegui 'lokit init'
ja: 'lokit init' を実行してください
pl: uruchom 'lokit init'
pt_br: execute 'lokit init'
ru: выполните 'lokit init'
tr: 'lokit init' komutunu çalıştırın
uk: виконайте 'lokit init'

source: not found
ar: غير موجود
de: nicht gefunden
es: no encontrado
fr: introuvable
it: non trovato
ja: 見つかりません
pl: nie znaleziono
pt_br: não encontrado
ru: не найдено
tr: bulunamadı
uk: не знайдено

source: Flutter ARB init: %d created, %d updated
ar: تهيئة Flutter ARB: تم إنشاء %d، تم تحديث %d
de: Flutter ARB-Init: %d erstellt, %d aktualisiert
es: Flutter ARB init: %d creados, %d actualizados
fr: Initialisation Flutter ARB : %d créé, %d mis à jour
it: Flutter ARB init: %d creati, %d aggiornati
ja: Flutter ARB初期化: %d件作成、%d件更新
pl: Inicjalizacja Flutter ARB: utworzono %d, zaktualizowano %d
pt_br: Flutter ARB init: %d criado, %d atualizado
ru: Инициализация Flutter ARB: создано — %d, обновлено — %d
tr: Flutter ARB başlatma: %d oluşturuldu, %d güncellendi
uk: Flutter ARB ініціалізація: створено %d, оновлено %d

source: Source strings
ar: سلاسل المصدر
de: Quellzeichenketten
es: Cadenas fuente
fr: Chaînes sources
it: Stringhe sorgente
ja: ソース文字列
pl: Ciągi źródłowe
pt_br: Strings de origem
ru: Исходные строки
tr: Kaynak metinler
uk: Рядки джерела

source: cannot read source ARB file %s: %w
ar: تعذر قراءة ملف ARB المصدر %s: %w
de: Kann ARB-Quelldatei %s nicht lesen: %w
es: no se puede leer el archivo ARB de origen %s: %w
fr: impossible de lire le fichier source ARB %s : %w
it: impossibile leggere il file ARB sorgente %s: %w
ja: ソースARBファイル %s を読み込めません: %w
pl: nie można odczytać pliku źródłowego ARB %s: %w
pt_br: não foi possível ler o arquivo ARB de origem %s: %w
ru: не удалось прочитать исходный ARB-файл %s: %w
tr: Kaynak ARB dosyası %s okunamıyor: %w
uk: Не вдалося прочитати вихідний ARB-файл %s: %w

source: Progress
ar: التقدم
de: Fortschritt
es: Progreso
fr: Progression
it: Avanzamento
ja: 進捗
pl: Postęp
pt_br: Progresso
ru: Прогресс
tr: İlerleme
uk: Прогрес

source: Lang
ar: اللغة
de: Sprache
es: Idioma
fr: Langue
it: Lingua
ja: 言語
pl: Język
pt_br: Idioma
ru: Язык
tr: Dil
uk: Мова

source: Done
ar: تم
de: Fertig
es: Listo
fr: Terminé
it: Completato
ja: 完了
pl: Zakończono
pt_br: Concluído
ru: Готово
tr: Tamamlandı
uk: Готово

source: Fuzzy
ar: غامض
es: Borroso
ja: ファジー
pl: Niepewne
ru: Неточный
tr: Belirsiz
uk: Нечіткий

source: Left
ar: متبقي
de: Offen
es: Restantes
fr: Restant
it: Residue
ja: 残り
pl: Pozostało
pt_br: Restante
ru: Осталось
tr: Kalan
uk: Залишилось

source: No ARB files to translate
ar: لا توجد ملفات ARB للترجمة
de: Keine ARB-Dateien zum Übersetzen vorhanden
es: No hay archivos ARB para traducir
fr: Aucun fichier ARB à traduire
it: Nessun file ARB da tradurre
ja: 翻訳対象のARBファイルがありません
pl: Brak plików ARB do tłumaczenia
pt_br: Nenhum arquivo ARB para traduzir
ru: Нет ARB-файлов для перевода
tr: Çevrilecek ARB dosyası yok
uk: Немає ARB-файлів для перекладу

source: missing
ar: مفقود
de: fehlt
es: faltante
fr: manquant
it: mancante
ja: 不足
pl: brakujące
pt_br: ausente
ru: отсутствует
tr: eksik
uk: відсутній

source: po4a config
ar: إعداد po4a
de: po4a-Konfiguration
es: configuración po4a
fr: config po4a
it: configurazione po4a
ja: po4a設定
pl: konfiguracja po4a
pt_br: configuração po4a
ru: конфиг po4a
tr: po4a yapılandırması
uk: конфіг po4a

source: Total
ar: الإجمالي
de: Gesamt
it: Totale
ja: 合計
pl: Łącznie
ru: Всего
tr: Toplam
uk: Всього

source: Translations
ar: الترجمات
de: Übersetzungen
es: Traducciones
fr: Traductions
it: Traduzioni
ja: 翻訳
pl: Tłumaczenia
pt_br: Traduções
ru: Переводы
tr: Çeviriler
uk: Переклади

source: Source
ar: المصدر
de: Quelle
es: Fuente
it: Sorgente
ja: ソース
pl: Źródło
pt_br: Fonte
ru: Исходный файл
tr: Kaynak
uk: Джерело
