Repository: minios-linux/lokit
Catalog: po/*.po
Languages: ar, de, es, fr, it, ja, pl, pt_br, ru, tr, uk

source: Source keys
ar: مفاتيح المصدر
de: Quellschlüssel
es: Claves de origen
fr: Clés source
it: Chiavi sorgente
ja: ソースキー
pl: Klucze źródłowe
pt_br: Chaves de origem
ru: Исходные ключи
tr: Kaynak anahtarları
uk: Ключі джерела

source: Blog Posts (%d posts)
ar: مشاركات المدونة (%d مشاركة)
de: Blog-Beiträge (%d Beiträge)
es: Entradas de blog (%d publicaciones)
fr: Articles de blog (%d articles)
it: Articoli del blog (%d post)
ja: ブログ投稿（%d件）
pl: Posty na blogu (%d postów)
pt_br: Posts do blog (%d posts)
ru: Посты в блоге (%d постов)
tr: Blog Yazıları (%d yazı)
uk: Блог-пости (%d постів)

source: Res dir
ar: دليل الموارد
de: Res-Verzeichnis
es: Directorio Res
fr: Dossier res
it: Cartella risorse
ja: Resディレクトリ
pl: Katalog res
pt_br: Diretório Res
ru: Папка ресурсов
tr: Res dizini
uk: Res директорія

source: parse error: %v
ar: خطأ في التحليل: %v
de: Parse-Fehler: %v
es: error de análisis: %v
fr: erreur d'analyse : %v
it: errore di parsing: %v
ja: パースエラー: %v
pl: błąd parsowania: %v
pt_br: erro de análise: %v
ru: ошибка разбора: %v
tr: ayrıştırma hatası: %v
uk: помилка парсингу: %v

source: parse error
ar: خطأ في التحليل
de: Parse-Fehler
es: error de análisis
fr: erreur d'analyse
it: errore di parsing
ja: パースエラー
pl: błąd parsowania
pt_br: erro de análise
ru: ошибка разбора
tr: ayrıştırma hatası
uk: помилка парсингу

source: No translatable strings found in %s
ar: لم يتم العثور على نصوص قابلة للترجمة في %s
de: Keine übersetzbaren Zeichenketten in %s gefunden
es: No se encontraron cadenas traducibles en %s
fr: Aucune chaîne traduisible trouvée dans %s
it: Nessuna stringa traducibile trovata in %s
ja: %s に翻訳可能な文字列が見つかりません
pl: Nie znaleziono tłumaczalnych ciągów w %s
pt_br: Nenhuma string traduzível encontrada em %s
ru: В %s не найдено строк для перевода
tr: %s içinde çevrilebilecek dize bulunamadı
uk: Не знайдено рядків для перекладу у %s

source: Translation Statistics
ar: إحصائيات الترجمة
de: Übersetzungsstatistik
es: Estadísticas de traducción
fr: Statistiques de traduction
it: Statistiche di traduzione
ja: 翻訳統計
pl: Statystyki tłumaczeń
pt_br: Estatísticas de Tradução
ru: Статистика перевода
tr: Çeviri İstatistikleri
uk: Статистика перекладу

source: Translation gaps:
ar: فجوات الترجمة:
de: Übersetzungslücken:
es: Brechas de traducción:
fr: Lacunes de traduction :
it: Lacune di traduzione:
ja: 未翻訳箇所：
pl: Braki w tłumaczeniach:
pt_br: Lacunas de tradução:
ru: Пробелы в переводе:
tr: Çeviri eksikleri:
uk: Прогалини в перекладі:

source: %d untranslated
ar: %d غير مترجمة
de: %d nicht übersetzt
es: %d sin traducir
fr: %d non traduit(s)
it: %d non tradotti
ja: %d件 未翻訳
pl: %d nieprzetłumaczonych
pt_br: %d não traduzido(s)
ru: %d не переведено
tr: %d çevrilmemiş
uk: %d не перекладено

source: %d fuzzy
ar: %d غامضة
ja: %d件 fuzzy
ru: %d нечетких

source: Documentation Statistics
ar: إحصائيات التوثيق
de: Dokumentationsstatistik
es: Estadísticas de documentación
fr: Statistiques de documentation
it: Statistiche documentazione
ja: ドキュメント統計
pl: Statystyki dokumentacji
pt_br: Estatísticas de Documentação
ru: Статистика документации
tr: Dokümantasyon İstatistikleri
uk: Статистика документації

source: No language files detected in %s
ar: لم يتم العثور على ملفات لغة في %s
de: Keine Sprachdateien in %s gefunden
es: No se detectaron archivos de idioma en %s
fr: Aucun fichier de langue détecté dans %s
it: Nessun file lingua rilevato in %s
ja: %s に言語ファイルが検出されませんでした
pl: Nie wykryto plików językowych w %s
pt_br: Nenhum arquivo de idioma detectado em %s
ru: В %s не обнаружено языковых файлов
tr: %s içinde dil dosyası tespit edilmedi
uk: Не виявлено мовних файлів у %s

source: UI Translation Statistics
ar: إحصائيات ترجمة واجهة المستخدم
de: UI-Übersetzungsstatistik
es: Estadísticas de traducción de la interfaz
fr: Statistiques de traduction de l’interface
it: Statistiche traduzione UI
ja: UI翻訳統計
pl: Statystyki tłumaczenia interfejsu
pt_br: Estatísticas de Tradução da UI
ru: Статистика перевода интерфейса
tr: Arayüz Çeviri İstatistikleri
uk: Статистика перекладу інтерфейсу

source: Invalid locked_pattern %q: %v
ar: locked_pattern غير صالح %q: %v
de: Ungültiges locked_pattern %q: %v
es: Patrón locked_pattern no válido %q: %v
fr: locked_pattern invalide %q : %v
it: locked_pattern non valido %q: %v
ja: 無効なlocked_pattern %q: %v
pl: Nieprawidłowy locked_pattern %q: %v
pt_br: locked_pattern inválido %q: %v
ru: Недопустимый locked_pattern %q: %v
tr: Geçersiz locked_pattern %q: %v
uk: Недійсний locked_pattern %q: %v

source: Recipe Translations
ar: ترجمات الوصفات
de: Rezeptübersetzungen
es: Traducciones de recetas
fr: Traductions de recettes
it: Traduzioni ricette
ja: レシピ翻訳
pl: Tłumaczenia przepisów
pt_br: Traduções de Receitas
ru: Переводы рецептов
tr: Tarif Çevirileri
uk: Переклади рецептів

source: Prepare translation files (extract strings, create/update PO)
ar: تحضير ملفات الترجمة (استخراج النصوص، إنشاء/تحديث ملفات PO)
de: Übersetzungsdateien vorbereiten (Strings extrahieren, PO erstellen/aktualisieren)
es: Preparar archivos de traducción (extraer cadenas, crear/actualizar PO)
fr: Préparer les fichiers de traduction (extraire les chaînes, créer/mettre à jour les PO)
it: Prepara i file di traduzione (estrai stringhe, crea/aggiorna PO)
ja: 翻訳ファイルの準備（文字列抽出、POファイルの作成・更新）
pl: Przygotuj pliki tłumaczeń (wyodrębnij ciągi, utwórz/aktualizuj PO)
pt_br: Preparar arquivos de tradução (extrair strings, criar/atualizar PO)
ru: Подготовить файлы перевода (извлечение строк, создание/обновление PO)
tr: Çeviri dosyalarını hazırla (dizeleri çıkar, PO dosyası oluştur/güncelle)
uk: Підготувати файли перекладу (витягти рядки, створити/оновити PO)
