Repository: minios-linux/lokit
Catalog: po/*.po
Languages: ar, de, es, fr, it, ja, pl, pt_br, ru, tr, uk

source: Blog post translation failed for %s: %v
ar: فشلت ترجمة منشور المدونة لـ %s: %v
de: Blogbeitragsübersetzung für %s fehlgeschlagen: %v
es: Error al traducir la publicación de blog %s: %v
fr: Échec de la traduction de l’article de blog pour %s : %v
it: Traduzione del post del blog non riuscita per %s: %v
ja: %s のブログ記事翻訳に失敗しました: %v
pl: Tłumaczenie wpisu bloga nie powiodło się dla %s: %v
pt_br: Falha na tradução da postagem do blog para %s: %v
ru: Ошибка перевода записи блога для %s: %v
tr: %s için blog yazısı çevirisi başarısız oldu: %v
uk: Помилка перекладу посту блогу для %s: %v

source: Translation complete!
ar: تمت الترجمة!
de: Übersetzung abgeschlossen!
es: ¡Traducción completada!
fr: Traduction terminée !
it: Traduzione completata!
ja: 翻訳が完了しました！
pl: Tłumaczenie zakończone!
pt_br: Tradução concluída!
ru: Перевод завершён!
tr: Çeviri tamamlandı!
uk: Переклад завершено!

source: Manage provider authentication
ar: إدارة مصادقة المزود
de: Provider-Authentifizierung verwalten
es: Gestionar autenticación de proveedor
fr: Gérer l’authentification du fournisseur
it: Gestisci autenticazione provider
ja: プロバイダー認証を管理
pl: Zarządzaj uwierzytelnianiem dostawcy
pt_br: Gerenciar autenticação de provedor
ru: Управление аутентификацией провайдера
tr: Sağlayıcı kimlik doğrulamasını yönet
uk: Керування автентифікацією провайдера

source: Manage authentication credentials for all AI providers. OAuth providers (interactive browser/device flow): copilot GitHub Copilot (device code flow, free with GitHub account) gemini Google Gemini Code Assist (browser OAuth, free tier: 60 req/min) API key providers (paste your key): google Google AI Studio (Gemini API key) groq Groq Cloud (free tier available) opencode OpenCode Zen API (free models available without key) custom-openai Custom OpenAI-compatible endpoint No auth required: ollama Local Ollama server Examples: lokit auth login Interactive provider selection lokit auth login --provider copilot OAuth with GitHub Copilot lokit auth login --provider google Store Google AI API key lokit auth logout --provider google Remove Google API key lokit auth logout Remove all credentials lokit auth list Show all stored credentials
ar: إدارة بيانات اعتماد المصادقة لجميع مزودي الذكاء الاصطناعي. مزودو OAuth (تدفق عبر المتصفح أو الجهاز): copilot GitHub Copilot (تدفق رمز الجهاز، مجاني مع حساب GitHub) gemini Google Gemini Code Assist (OAuth عبر المتصفح، الحد المجاني: 60 طلب/دقيقة) مزودو مفاتيح API (الصق مفتاحك): google Google AI Studio (مفتاح Gemini API) groq Groq Cloud (يوجد حد مجاني) opencode OpenCode Zen API (نماذج مجانية متاحة بدون مفتاح) custom-openai نقطة نهاية متوافقة مع OpenAI مخصصة لا يتطلب مصادقة: ollama خادم Ollama المحلي أمثلة: lokit auth login اختيار المزود بشكل تفاعلي lokit auth login --provider copilot OAuth مع GitHub Copilot lokit auth login --provider google حفظ مفتاح Google AI API lokit auth logout --provider google إزالة مفتاح Google API lokit auth logout إزالة جميع بيانات الاعتماد lokit auth list عرض جميع بيانات الاعتماد المخزنة
de: Verwalten Sie Authentifizierungsdaten für alle KI-Anbieter. OAuth-Anbieter (interaktiver Browser-/Geräte-Flow): copilot GitHub Copilot (Gerätecode-Flow, kostenlos mit GitHub-Konto) gemini Google Gemini Code Assist (Browser-OAuth, Free-Tier: 60 Anfragen/Min.) API-Schlüssel-Anbieter (fügen Sie Ihren Schlüssel ein): google Google AI Studio (Gemini API-Schlüssel) groq Groq Cloud (kostenloses Kontingent verfügbar) opencode OpenCode Zen API (kostenlose Modelle auch ohne Schlüssel) custom-openai Benutzerdefinierter OpenAI-kompatibler Endpunkt Keine Authentifizierung erforderlich: ollama Lokaler Ollama-Server Beispiele: lokit auth login Interaktive Anbieterauswahl lokit auth login --provider copilot OAuth mit GitHub Copilot lokit auth login --provider google Google AI API-Schlüssel speichern lokit auth logout --provider google Google API-Schlüssel entfernen lokit auth logout Alle Zugangsdaten entfernen lokit auth list Alle gespeicherten Zugangsdaten anzeigen
es: Gestiona credenciales de autenticación para todos los proveedores de IA. Proveedores OAuth (flujo interactivo en navegador/dispositivo): copilot GitHub Copilot (flujo de código de dispositivo, gratis con cuenta GitHub) gemini Google Gemini Code Assist (OAuth en navegador, nivel gratuito: 60 req/min) Proveedores con clave API (pega tu clave): google Google AI Studio (clave API de Gemini) groq Groq Cloud (nivel gratuito disponible) opencode OpenCode Zen API (modelos gratuitos disponibles sin clave) custom-openai Endpoint personalizado compatible con OpenAI No requiere autenticación: ollama Servidor local Ollama Ejemplos: lokit auth login Selección interactiva de proveedor lokit auth login --provider copilot OAuth con GitHub Copilot lokit auth login --provider google Guardar clave API de Google AI lokit auth logout --provider google Eliminar clave API de Google lokit auth logout Eliminar todas las credenciales lokit auth list Mostrar todas las credenciales almacenadas
fr: Gérez les identifiants d'authentification pour tous les fournisseurs IA. Fournisseurs OAuth (flux interactif via navigateur/appareil) : copilot GitHub Copilot (flux code appareil, gratuit avec compte GitHub) gemini Google Gemini Code Assist (OAuth navigateur, offre gratuite : 60 req/min) Fournisseurs par clé API (collez votre clé) : google Google AI Studio (clé API Gemini) groq Groq Cloud (offre gratuite disponible) opencode OpenCode Zen API (modèles gratuits disponibles sans clé) custom-openai Endpoint compatible OpenAI personnalisé Aucune authentification requise : ollama Serveur Ollama local Exemples : lokit auth login Sélection interactive du fournisseur lokit auth login --provider copilot OAuth avec GitHub Copilot lokit auth login --provider google Enregistrer la clé API Google AI lokit auth logout --provider google Supprimer la clé API Google lokit auth logout Supprimer tous les identifiants lokit auth list Afficher tous les identifiants enregistrés
it: Gestisci le credenziali di autenticazione per tutti i provider AI. Provider OAuth (flusso interattivo via browser/dispositivo): copilot GitHub Copilot (flusso codice dispositivo, gratuito con account GitHub) gemini Google Gemini Code Assist (OAuth via browser, piano gratuito: 60 richieste/min) Provider con chiave API (inserisci la tua chiave): google Google AI Studio (chiave API Gemini) groq Groq Cloud (piano gratuito disponibile) opencode OpenCode Zen API (modelli gratuiti disponibili senza chiave) custom-openai Endpoint personalizzato compatibile OpenAI Nessuna autenticazione richiesta: ollama Server locale Ollama Esempi: lokit auth login Selezione provider interattiva lokit auth login --provider copilot OAuth con GitHub Copilot lokit auth login --provider google Salva chiave API Google AI lokit auth logout --provider google Rimuovi chiave API Google lokit auth logout Rimuovi tutte le credenziali lokit auth list Mostra tutte le credenziali salvate
ja: すべてのAIプロバイダーの認証情報を管理します。 OAuthプロバイダー（ブラウザ/デバイスフローによる対話型認証）： copilot GitHub Copilot（デバイスコードフロー、GitHubアカウントで無料） gemini Google Gemini Code Assist（ブラウザOAuth、無料枠：60リクエスト/分） APIキー型プロバイダー（キーを貼り付けてください）： google Google AI Studio（Gemini APIキー） groq Groq Cloud（無料枠あり） opencode OpenCode Zen API（APIキー不要の無料モデルあり） custom-openai OpenAI互換カスタムエンドポイント 認証不要： ollama ローカルOllamaサーバー 使用例： lokit auth login 対話的にプロバイダーを選択 lokit auth login --provider copilot GitHub CopilotでOAuth認証 lokit auth login --provider google Google AIのAPIキーを保存 lokit auth logout --provider google GoogleのAPIキーを削除 lokit auth logout すべての認証情報を削除 lokit auth list 保存済み認証情報を一覧表示
pl: Zarządzaj poświadczeniami uwierzytelniającymi dla wszystkich dostawców AI. Dostawcy OAuth (interaktywny przepływ przez przeglądarkę/urządzenie): copilot GitHub Copilot (przepływ kodu urządzenia, darmowy z kontem GitHub) gemini Google Gemini Code Assist (OAuth przez przeglądarkę, darmowy limit: 60 żądań/min) Dostawcy kluczy API (wklej swój klucz): google Google AI Studio (klucz API Gemini) groq Groq Cloud (dostępny darmowy limit) opencode OpenCode Zen API (darmowe modele dostępne bez klucza) custom-openai Własny endpoint zgodny z OpenAI Nie wymaga uwierzytelnienia: ollama Lokalny serwer Ollama Przykłady: lokit auth login Interaktywny wybór dostawcy lokit auth login --provider copilot OAuth z GitHub Copilot lokit auth login --provider google Zapisz klucz API Google AI lokit auth logout --provider google Usuń klucz API Google lokit auth logout Usuń wszystkie poświadczenia lokit auth list Wyświetl wszystkie zapisane poświadczenia
pt_br: Gerencie credenciais de autenticação para todos os provedores de IA. Provedores OAuth (fluxo interativo via navegador/dispositivo): copilot GitHub Copilot (fluxo de código do dispositivo, gratuito com conta GitHub) gemini Google Gemini Code Assist (OAuth via navegador, plano gratuito: 60 req/min) Provedores com chave de API (cole sua chave): google Google AI Studio (chave de API Gemini) groq Groq Cloud (plano gratuito disponível) opencode OpenCode Zen API (modelos gratuitos disponíveis sem chave) custom-openai Endpoint compatível com OpenAI personalizado Sem autenticação necessária: ollama Servidor local Ollama Exemplos: lokit auth login Seleção interativa de provedor lokit auth login --provider copilot OAuth com GitHub Copilot lokit auth login --provider google Armazenar chave de API do Google AI lokit auth logout --provider google Remover chave de API do Google lokit auth logout Remover todas as credenciais lokit auth list Mostrar todas as credenciais salvas
ru: Управление учётными данными для всех ИИ-провайдеров. OAuth-провайдеры (интерактивный браузер/устройство): copilot GitHub Copilot (device code flow, бесплатно с аккаунтом GitHub) gemini Google Gemini Code Assist (OAuth через браузер, бесплатный тариф: 60 запросов/мин) Провайдеры с API-ключом (вставьте свой ключ): google Google AI Studio (API-ключ Gemini) groq Groq Cloud (доступен бесплатный тариф) opencode OpenCode Zen API (доступны бесплатные модели без ключа) custom-openai Пользовательский OpenAI-совместимый endpoint Без авторизации: ollama Локальный сервер Ollama Примеры: lokit auth login Интерактивный выбор провайдера lokit auth login --provider copilot OAuth с GitHub Copilot lokit auth login --provider google Сохранить API-ключ Google AI lokit auth logout --provider google Удалить API-ключ Google lokit auth logout Удалить все учётные данные lokit auth list Показать все сохранённые учётные данные
tr: Tüm yapay zeka sağlayıcıları için kimlik doğrulama bilgilerini yönetin. OAuth sağlayıcıları (etkileşimli tarayıcı/cihaz akışı): copilot GitHub Copilot (cihaz kodu akışı, GitHub hesabı ile ücretsiz) gemini Google Gemini Code Assist (tarayıcı OAuth, ücretsiz katman: 60 istek/dk) API anahtarı sağlayıcıları (anahtarınızı yapıştırın): google Google AI Studio (Gemini API anahtarı) groq Groq Cloud (ücretsiz katman mevcut) opencode OpenCode Zen API (anahtarsız ücretsiz modeller mevcut) custom-openai Özel OpenAI uyumlu uç nokta Kimlik doğrulama gerektirmez: ollama Yerel Ollama sunucusu Örnekler: lokit auth login Etkileşimli sağlayıcı seçimi lokit auth login --provider copilot GitHub Copilot ile OAuth lokit auth login --provider google Google AI API anahtarını kaydet lokit auth logout --provider google Google API anahtarını kaldır lokit auth logout Tüm kimlik bilgilerini kaldır lokit auth list Kayıtlı tüm kimlik bilgilerini göster
uk: Керуйте обліковими даними для всіх AI-провайдерів. OAuth-провайдери (інтерактивний браузер/пристрій): copilot GitHub Copilot (авторизація через код пристрою, безкоштовно з GitHub-акаунтом) gemini Google Gemini Code Assist (OAuth через браузер, безкоштовний тариф: 60 запитів/хв) Провайдери з API-ключем (вставте свій ключ): google Google AI Studio (Gemini API-ключ) groq Groq Cloud (є безкоштовний тариф) opencode OpenCode Zen API (безкоштовні моделі без ключа) custom-openai Користувацький endpoint, сумісний з OpenAI Без авторизації: ollama Локальний сервер Ollama Приклади: lokit auth login Інтерактивний вибір провайдера lokit auth login --provider copilot OAuth через GitHub Copilot lokit auth login --provider google Зберегти API-ключ Google AI lokit auth logout --provider google Видалити API-ключ Google lokit auth logout Видалити всі облікові дані lokit auth list Показати всі збережені облікові дані

source: Authenticate with an AI provider
ar: المصادقة مع مزود ذكاء اصطناعي
de: Mit einem KI-Provider authentifizieren
es: Autenticarse con un proveedor de IA
fr: S’authentifier auprès d’un fournisseur IA
it: Autenticati con un provider AI
ja: AIプロバイダーで認証する
pl: Uwierzytelnij się u dostawcy AI
pt_br: Autenticar com um provedor de IA
ru: Аутентификация через AI-провайдера
tr: Bir AI sağlayıcısıyla kimlik doğrulaması yap
uk: Автентифікація з AI-провайдером

source: Authenticate with an AI provider using OAuth or API key. If --provider is not specified, you will be prompted to choose. OAuth providers: copilot Device code flow — enter code in browser gemini Browser-based OAuth — sign in with Google API key providers: google Paste your Google AI Studio API key groq Paste your Groq API key opencode Paste your OpenCode API key custom-openai Paste your API key + endpoint URL
ar: المصادقة مع مزود ذكاء اصطناعي باستخدام OAuth أو مفتاح API. إذا لم يتم تحديد --provider، سيتم مطالبتك بالاختيار. مزودو OAuth: copilot تدفق رمز الجهاز — أدخل الرمز في المتصفح gemini مصادقة عبر المتصفح — سجل دخولك بحساب Google مزودو مفاتيح API: google الصق مفتاح Google AI Studio الخاص بك groq الصق مفتاح Groq الخاص بك opencode الصق مفتاح OpenCode الخاص بك custom-openai الصق مفتاح API + عنوان نقطة النهاية
de: Mit einem KI-Anbieter über OAuth oder API-Schlüssel authentifizieren. Wenn --provider nicht angegeben ist, erfolgt eine Auswahlaufforderung. OAuth-Anbieter: copilot Gerätecode-Flow — Code im Browser eingeben gemini Browserbasierte OAuth — Mit Google anmelden API-Key-Anbieter: google Google AI Studio API-Schlüssel einfügen groq Groq API-Schlüssel einfügen opencode OpenCode API-Schlüssel einfügen custom-openai API-Schlüssel + Endpunkt-URL einfügen
es: Autentícate con un proveedor de IA usando OAuth o clave API. Si no se especifica --provider, se te pedirá que elijas uno. Proveedores OAuth: copilot Flujo de código de dispositivo — ingresa el código en el navegador gemini OAuth basado en navegador — inicia sesión con Google Proveedores con clave API: google Pega tu clave API de Google AI Studio groq Pega tu clave API de Groq opencode Pega tu clave API de OpenCode custom-openai Pega tu clave API + URL del endpoint
fr: Authentifiez-vous auprès d'un fournisseur IA via OAuth ou clé API. Si --provider n'est pas spécifié, vous serez invité à choisir. Fournisseurs OAuth : copilot Code appareil — saisir le code dans le navigateur gemini OAuth via navigateur — connexion Google Fournisseurs par clé API : google Collez votre clé API Google AI Studio groq Collez votre clé API Groq opencode Collez votre clé API OpenCode custom-openai Collez votre clé API + URL du point de terminaison
it: Autenticati con un provider AI tramite OAuth o chiave API. Se --provider non è specificato, ti verrà chiesto di scegliere. Provider OAuth: copilot Device code flow — inserisci il codice nel browser gemini OAuth via browser — accedi con Google Provider chiave API: google Incolla la tua chiave API Google AI Studio groq Incolla la tua chiave API Groq opencode Incolla la tua chiave API OpenCode custom-openai Incolla la tua chiave API + URL endpoint
ja: OAuthまたはAPIキーを使ってAIプロバイダーに認証します。 --providerを指定しない場合は選択を促されます。 OAuthプロバイダー: copilot デバイスコードフロー — ブラウザでコード入力 gemini ブラウザOAuth — Googleアカウントでサインイン APIキー型プロバイダー: google Google AI StudioのAPIキーを貼り付け groq GroqのAPIキーを貼り付け opencode OpenCodeのAPIキーを貼り付け custom-openai APIキー＋エンドポイントURLを貼り付け
pl: Uwierzytelnij się u dostawcy AI za pomocą OAuth lub klucza API. Jeśli --provider nie jest podany, zostaniesz poproszony o wybór. Dostawcy OAuth: copilot Przepływ kodu urządzenia — wpisz kod w przeglądarce gemini OAuth w przeglądarce — zaloguj się przez Google Dostawcy klucza API: google Wklej swój klucz API Google AI Studio groq Wklej swój klucz API Groq opencode Wklej swój klucz API OpenCode custom-openai Wklej klucz API + URL endpointu
pt_br: Autentique-se com um provedor de IA usando OAuth ou chave de API. Se --provider não for especificado, você será solicitado a escolher. Provedores OAuth: copilot Fluxo de código de dispositivo — insira o código no navegador gemini OAuth via navegador — faça login com o Google Provedores com chave de API: google Cole sua chave de API do Google AI Studio groq Cole sua chave de API do Groq opencode Cole sua chave de API do OpenCode custom-openai Cole sua chave de API + URL do endpoint
ru: Авторизация с ИИ-провайдером через OAuth или API-ключ. Если параметр --provider не указан, вам предложат выбрать провайдера. OAuth-провайдеры: copilot Device code flow — введите код в браузере gemini OAuth через браузер — войдите с аккаунтом Google Провайдеры с API-ключом: google Вставьте свой API-ключ Google AI Studio groq Вставьте свой API-ключ Groq opencode Вставьте свой API-ключ OpenCode custom-openai Вставьте API-ключ и URL endpoint
tr: Bir yapay zeka sağlayıcısı ile OAuth veya API anahtarı kullanarak kimlik doğrulaması yapın. --provider belirtilmezse, seçim yapmanız istenir. OAuth sağlayıcıları: copilot Cihaz kodu akışı — kodu tarayıcıda girin gemini Tarayıcı tabanlı OAuth — Google ile oturum açın API anahtarı sağlayıcıları: google Google AI Studio API anahtarınızı yapıştırın groq Groq API anahtarınızı yapıştırın opencode OpenCode API anahtarınızı yapıştırın custom-openai API anahtarı + uç nokta URL'si girin
uk: Авторизуйтеся у AI-провайдера через OAuth або API-ключ. Якщо --provider не вказано, вам буде запропоновано вибрати. OAuth-провайдери: copilot Код пристрою — введіть код у браузері gemini OAuth через браузер — увійдіть з Google Провайдери API-ключів: google Вставте ваш API-ключ Google AI Studio groq Вставте ваш API-ключ Groq opencode Вставте ваш API-ключ OpenCode custom-openai Вставте API-ключ + URL endpoint

source: Select provider to authenticate
ar: اختر المزود للمصادقة
de: Provider zur Authentifizierung auswählen
es: Selecciona el proveedor para autenticarte
fr: Sélectionner le fournisseur pour l’authentification
it: Seleziona il provider per l’autenticazione
ja: 認証するプロバイダーを選択
pl: Wybierz dostawcę do uwierzytelnienia
pt_br: Selecione o provedor para autenticar
ru: Выберите провайдера для аутентификации
tr: Kimlik doğrulaması yapılacak sağlayıcıyı seçin
uk: Оберіть провайдера для автентифікації

source: API key
ar: مفتاح API
de: API-Schlüssel
es: Clave API
fr: Clé API
it: Chiave API
ja: APIキー
pl: Klucz API
pt_br: Chave de API
ru: API-ключ
tr: API anahtarı
uk: API-ключ

source: Enter choice (number or name):
ar: أدخل اختيارك (رقم أو اسم):
de: Auswahl eingeben (Nummer oder Name):
es: Introduce tu elección (número o nombre):
fr: Faites un choix (numéro ou nom) :
it: Inserisci scelta (numero o nome):
ja: 選択肢を入力してください（番号または名前）:
pl: Wybierz opcję (numer lub nazwa):
pt_br: Digite a opção (número ou nome):
ru: Введите выбор (номер или имя):
tr: Seçiminizi girin (numara veya isim):
uk: Введіть вибір (номер або назва):

source: No input received
ar: لم يتم استلام أي إدخال
de: Keine Eingabe erhalten
es: No se recibió ninguna entrada
fr: Aucune entrée reçue
it: Nessun input ricevuto
ja: 入力がありません
pl: Nie otrzymano żadnego wejścia
pt_br: Nenhuma entrada recebida
ru: Входные данные не получены
tr: Girdi alınamadı
uk: Вхідні дані не отримано

source: Invalid choice. Use: lokit auth login --provider PROVIDER
ar: خيار غير صالح. استخدم: lokit auth login --provider PROVIDER
de: Ungültige Auswahl. Verwenden Sie: lokit auth login --provider PROVIDER
es: Opción no válida. Usa: lokit auth login --provider PROVIDER
fr: Choix invalide. Utilisez : lokit auth login --provider PROVIDER
it: Scelta non valida. Usa: lokit auth login --provider PROVIDER
ja: 無効な選択です。使用方法: lokit auth login --provider PROVIDER
pl: Nieprawidłowy wybór. Użyj: lokit auth login --provider PROVIDER
pt_br: Escolha inválida. Use: lokit auth login --provider PROVIDER
ru: Некорректный выбор. Используйте: lokit auth login --provider PROVIDER
tr: Geçersiz seçim. Kullanım: lokit auth login --provider PROVIDER
uk: Неправильний вибір. Використайте: lokit auth login --provider PROVIDER

source: Unknown provider '%s'. Run 'lokit auth login' for options.
ar: مزود غير معروف '%s'. نفذ 'lokit auth login' للاطلاع على الخيارات.
de: Unbekannter Provider '%s'. Führen Sie 'lokit auth login' für Optionen aus.
es: Proveedor desconocido '%s'. Ejecuta 'lokit auth login' para ver opciones.
fr: Fournisseur inconnu « %s ». Exécutez « lokit auth login » pour voir les options.
it: Provider sconosciuto '%s'. Esegui 'lokit auth login' per le opzioni.
ja: 不明なプロバイダー '%s' です。オプションは 'lokit auth login' を実行してください。
pl: Nieznany dostawca '%s'. Uruchom 'lokit auth login', aby zobaczyć opcje.
pt_br: Provedor desconhecido '%s'. Execute 'lokit auth login' para opções.
ru: Неизвестный провайдер '%s'. Запустите 'lokit auth login' для просмотра вариантов.
tr: Bilinmeyen sağlayıcı '%s'. Seçenekler için 'lokit auth login' komutunu çalıştırın.
uk: Невідомий провайдер '%s'. Запустіть 'lokit auth login' для перегляду опцій.

source: Provider to authenticate
ar: المزود المطلوب المصادقة معه
de: Anbieter zur Authentifizierung
es: Proveedor para autenticar
fr: Fournisseur à authentifier
it: Provider da autenticare
ja: 認証するプロバイダー
pl: Dostawca do uwierzytelnienia
pt_br: Provedor para autenticar
ru: Провайдер для авторизации
tr: Kimlik doğrulaması yapılacak sağlayıcı
uk: Провайдер для авторизації

source: this command
ar: هذا الأمر
de: dieser Befehl
es: este comando
fr: cette commande
it: questo comando
ja: このコマンド
pl: ta komenda
pt_br: este comando
ru: эта команда
tr: bu komut
uk: ця команда

source: GitHub Copilot Authentication
ar: مصادقة GitHub Copilot
de: GitHub Copilot-Authentifizierung
es: Autenticación de GitHub Copilot
fr: Authentification GitHub Copilot
it: Autenticazione GitHub Copilot
ja: GitHub Copilot 認証
pl: GitHub Copilot — uwierzytelnianie
pt_br: Autenticação do GitHub Copilot
ru: Аутентификация GitHub Copilot
tr: GitHub Copilot Kimlik Doğrulama
uk: GitHub Copilot автентифікація

source: Open this URL in your browser:
ar: افتح هذا الرابط في متصفحك:
de: Öffnen Sie diese URL in Ihrem Browser:
es: Abre esta URL en tu navegador:
fr: Ouvrez cette URL dans votre navigateur :
it: Apri questo URL nel browser:
ja: このURLをブラウザーで開いてください:
pl: Otwórz ten adres URL w przeglądarce:
pt_br: Abra esta URL no seu navegador:
ru: Откройте этот URL в браузере:
tr: Bu URL'yi tarayıcınızda açın:
uk: Відкрийте цю URL-адресу у вашому браузері:

source: Enter this code:
ar: أدخل هذا الرمز:
de: Geben Sie diesen Code ein:
es: Introduce este código:
fr: Saisissez ce code :
it: Inserisci questo codice:
ja: このコードを入力してください:
pl: Wprowadź ten kod:
pt_br: Digite este código:
ru: Введите этот код:
tr: Bu kodu girin:
uk: Введіть цей код:

source: Waiting for authorization...
ar: بانتظار التفويض...
de: Warte auf Autorisierung...
es: Esperando autorización...
fr: En attente d’autorisation...
it: In attesa di autorizzazione...
ja: 認証を待機中...
pl: Oczekiwanie na autoryzację...
pt_br: Aguardando autorização...
ru: Ожидание авторизации...
tr: Yetkilendirme bekleniyor...
uk: Очікування авторизації...

source: Authentication cancelled
ar: تم إلغاء المصادقة
de: Authentifizierung abgebrochen
es: Autenticación cancelada
fr: Authentification annulée
it: Autenticazione annullata
ja: 認証がキャンセルされました
pl: Uwierzytelnianie anulowane
pt_br: Autenticação cancelada
ru: Аутентификация отменена
tr: Kimlik doğrulama iptal edildi
uk: Автентифікацію скасовано
