Repository: minios-linux/lokit
Catalog: po/*.po
Languages: ar, de, es, fr, it, ja, pl, pt_br, ru, tr, uk

source: lokit — Localization Kit: AI-powered translation for multiple formats. Supported project types (auto-detected or configured via lokit.yaml): gettext Flat (po/*.po) and nested (po/lang/*.po) PO files po4a Documentation translation (man pages, groff/roff markup) i18next React/i18next JSON translation files android Android strings.xml resource files json Generic JSON translation files (recipes, blog posts) yaml YAML translation files markdown Markdown document translation properties Java .properties translation files flutter Flutter ARB (Application Resource Bundle) files Configuration: Project settings are defined in lokit.yaml at the project root. Each project can have multiple translation targets with different types. See project examples for lokit.yaml format. AI Providers: google Google AI (Gemini) — API key gemini Gemini Code Assist — browser OAuth (free) groq Groq — API key required opencode OpenCode Zen API (free models available without key) copilot GitHub Copilot (native OAuth, free) ollama Ollama local server custom-openai Custom OpenAI-compatible endpoint
ar: lokit — مجموعة أدوات التوطين: ترجمة مدعومة بالذكاء الاصطناعي لعدة تنسيقات. أنواع المشاريع المدعومة (تُكتشف تلقائيًا أو يتم تكوينها عبر lokit.yaml): gettext ملفات PO مسطحة (po/*.po) ومتداخلة (po/lang/*.po) po4a ترجمة الوثائق (صفحات الدليل، تنسيقات groff/roff) i18next ملفات ترجمة JSON الخاصة بـ React/i18next android ملفات الموارد strings.xml لنظام Android json ملفات ترجمة JSON عامة (وصفات، منشورات مدونة) yaml ملفات ترجمة YAML markdown ترجمة مستندات Markdown properties ملفات ترجمة Java .properties flutter ملفات ARB (حزمة موارد التطبيقات) الخاصة بـ Flutter الإعدادات: يتم تعريف إعدادات المشروع في lokit.yaml الموجود في جذر المشروع. يمكن لكل مشروع أن يحتوي على أهداف ترجمة متعددة بأنواع مختلفة. راجع أمثلة المشاريع للحصول على تنسيق lokit.yaml. مزودو الذكاء الاصطناعي: google Google AI (Gemini) — مفتاح API gemini Gemini Code Assist — مصادقة المتصفح (مجاني) groq Groq — يتطلب مفتاح API opencode OpenCode Zen API (نماذج مجانية متاحة بدون مفتاح) copilot GitHub Copilot (مصادقة أصلية، مجاني) ollama خادم محلي Ollama custom-openai نقطة نهاية مخصصة متوافقة مع OpenAI
de: lokit — Localization Kit: KI-gestützte Übersetzung für mehrere Formate. Unterstützte Projekttypen (automatisch erkannt oder konfiguriert über lokit.yaml): gettext Flache (po/*.po) und verschachtelte (po/lang/*.po) PO-Dateien po4a Dokumentationsübersetzung (Manpages, groff/roff Markup) i18next React/i18next JSON-Übersetzungsdateien android Android strings.xml Ressourcendateien json Generische JSON-Übersetzungsdateien (Rezepte, Blogposts) yaml YAML-Übersetzungsdateien markdown Markdown-Dokumentübersetzung properties Java .properties Übersetzungsdateien flutter Flutter ARB (Application Resource Bundle) Dateien Konfiguration: Projekteinstellungen werden in lokit.yaml im Projektstammverzeichnis definiert. Jedes Projekt kann mehrere Übersetzungsziele mit unterschiedlichen Typen haben. Siehe Projektbeispiele für das lokit.yaml-Format. KI-Anbieter: google Google KI (Gemini) — API-Schlüssel gemini Gemini Code Assist — Browser-OAuth (kostenlos) groq Groq — API-Schlüssel erforderlich opencode OpenCode Zen API (kostenlose Modelle ohne Schlüssel verfügbar) copilot GitHub Copilot (native OAuth, kostenlos) ollama Ollama lokaler Server custom-openai Benutzerdefinierter OpenAI-kompatibler Endpunkt
es: lokit — Localization Kit: Traducción impulsada por IA para múltiples formatos. Tipos de proyectos compatibles (detectados automáticamente o configurados a través de lokit.yaml): gettext Archivos PO planos (po/*.po) y anidados (po/lang/*.po) po4a Traducción de documentación (páginas de manual, marcado groff/roff) i18next Archivos de traducción JSON para React/i18next android Archivos de recursos strings.xml de Android json Archivos de traducción JSON genéricos (recetas, publicaciones de blog) yaml Archivos de traducción YAML markdown Traducción de documentos Markdown properties Archivos de traducción Java .properties flutter Archivos ARB (Application Resource Bundle) de Flutter Configuración: La configuración del proyecto se define en lokit.yaml en la raíz del proyecto. Cada proyecto puede tener múltiples objetivos de traducción con diferentes tipos. Consulta los ejemplos de proyectos para el formato de lokit.yaml. Proveedores de IA: google Google AI (Gemini) — clave API gemini Gemini Code Assist — OAuth del navegador (gratuito) groq Groq — se requiere clave API opencode OpenCode Zen API (modelos gratuitos disponibles sin clave) copilot GitHub Copilot (OAuth nativo, gratuito) ollama Servidor local de Ollama custom-openai Endpoint personalizado compatible con OpenAI
fr: lokit — Kit de Localisation : Traduction assistée par IA pour plusieurs formats. Types de projets pris en charge (détectés automatiquement ou configurés via lokit.yaml) : gettext Fichiers PO plats (po/*.po) et imbriqués (po/lang/*.po) po4a Traduction de documentation (pages de manuel, balisage groff/roff) i18next Fichiers de traduction JSON pour React/i18next android Fichiers de ressources Android strings.xml json Fichiers de traduction JSON génériques (recettes, articles de blog) yaml Fichiers de traduction YAML markdown Traduction de documents Markdown properties Fichiers de traduction Java .properties flutter Fichiers ARB (Application Resource Bundle) pour Flutter Configuration : Les paramètres du projet sont définis dans lokit.yaml à la racine du projet. Chaque projet peut avoir plusieurs cibles de traduction avec différents types. Consultez les exemples de projets pour le format de lokit.yaml. Fournisseurs d'IA : google Google AI (Gemini) — Clé API gemini Gemini Code Assist — OAuth via navigateur (gratuit) groq Groq — Clé API requise opencode OpenCode Zen API (modèles gratuits disponibles sans clé) copilot GitHub Copilot (OAuth natif, gratuit) ollama Serveur local Ollama custom-openai Point de terminaison compatible OpenAI personnalisé
it: lokit — Localization Kit: traduzione basata su AI per formati multipli. Tipi di progetto supportati (rilevati automaticamente o configurati tramite lokit.yaml): gettext File PO piatti (po/*.po) e annidati (po/lang/*.po) po4a Traduzione di documentazione (man page, markup groff/roff) i18next File di traduzione JSON per React/i18next android File di risorse Android strings.xml json File di traduzione JSON generici (ricette, post di blog) yaml File di traduzione YAML markdown Traduzione di documenti Markdown properties File di traduzione Java .properties flutter File ARB (Application Resource Bundle) per Flutter Configurazione: Le impostazioni del progetto sono definite in lokit.yaml nella radice del progetto. Ogni progetto può avere più target di traduzione con tipi diversi. Consulta gli esempi di progetto per il formato di lokit.yaml. Provider AI: google Google AI (Gemini) — chiave API gemini Gemini Code Assist — OAuth via browser (gratuito) groq Groq — chiave API richiesta opencode OpenCode Zen API (modelli gratuiti disponibili senza chiave) copilot GitHub Copilot (OAuth nativo, gratuito) ollama Server locale Ollama custom-openai Endpoint personalizzato compatibile con OpenAI
ja: lokit — Localization Kit: AIを活用した多形式対応の翻訳ツールです。 対応プロジェクトタイプ（自動検出またはlokit.yamlで設定）： gettext フラット（po/*.po）およびネスト（po/lang/*.po）のPOファイル po4a ドキュメント翻訳（manページ、groff/roffマークアップ） i18next React/i18nextのJSON翻訳ファイル android Androidのstrings.xmlリソースファイル json 汎用JSON翻訳ファイル（レシピ、ブログ記事など） yaml YAML翻訳ファイル markdown Markdownドキュメント翻訳 properties Javaの.properties翻訳ファイル flutter FlutterのARB（Application Resource Bundle）ファイル 設定: プロジェクト設定はプロジェクトルートのlokit.yamlで定義します。 各プロジェクトには異なるタイプの複数の翻訳ターゲットを設定できます。 lokit.yamlのフォーマットについてはプロジェクト例を参照してください。 AIプロバイダー: google Google AI（Gemini）— APIキー gemini Gemini Code Assist — ブラウザOAuth（無料） groq Groq — APIキーが必要 opencode OpenCode Zen API（無料モデルはキー不要） copilot GitHub Copilot（ネイティブOAuth、無料） ollama Ollamaローカルサーバー custom-openai OpenAI互換のカスタムエンドポイント
pl: lokit — Localization Kit: Tłumaczenie wspierane przez AI dla wielu formatów. Obsługiwane typy projektów (automatycznie wykrywane lub konfigurowane w lokit.yaml): gettext Płaskie (po/*.po) i zagnieżdżone (po/lang/*.po) pliki PO po4a Tłumaczenie dokumentacji (strony man, znaczniki groff/roff) i18next Pliki tłumaczeń JSON dla React/i18next android Pliki zasobów strings.xml dla Androida json Ogólne pliki tłumaczeń JSON (przepisy, wpisy na blogu) yaml Pliki tłumaczeń YAML markdown Tłumaczenie dokumentów Markdown properties Pliki tłumaczeń Java .properties flutter Pliki ARB (Application Resource Bundle) dla Fluttera Konfiguracja: Ustawienia projektu są definiowane w lokit.yaml w katalogu głównym projektu. Każdy projekt może mieć wiele celów tłumaczenia o różnych typach. Zobacz przykłady projektów dla formatu lokit.yaml. Dostawcy AI: google Google AI (Gemini) — klucz API gemini Gemini Code Assist — przeglądarkowy OAuth (darmowy) groq Groq — wymagany klucz API opencode OpenCode Zen API (darmowe modele dostępne bez klucza) copilot GitHub Copilot (wbudowany OAuth, darmowy) ollama Lokalny serwer Ollama custom-openai Własny punkt końcowy zgodny z OpenAI
pt_br: lokit — Localization Kit: Tradução com IA para múltiplos formatos. Tipos de projeto suportados (detectados automaticamente ou configurados via lokit.yaml): gettext Arquivos PO planos (po/*.po) e aninhados (po/lang/*.po) po4a Tradução de documentação (páginas de manual, marcação groff/roff) i18next Arquivos de tradução JSON para React/i18next android Arquivos de recursos strings.xml do Android json Arquivos de tradução JSON genéricos (receitas, postagens de blog) yaml Arquivos de tradução YAML markdown Tradução de documentos Markdown properties Arquivos de tradução .properties do Java flutter Arquivos ARB (Application Resource Bundle) do Flutter Configuração: As configurações do projeto são definidas no lokit.yaml na raiz do projeto. Cada projeto pode ter múltiplos alvos de tradução com diferentes tipos. Consulte exemplos de projetos para o formato do lokit.yaml. Provedores de IA: google Google AI (Gemini) — chave de API gemini Gemini Code Assist — OAuth via navegador (gratuito) groq Groq — chave de API necessária opencode OpenCode Zen API (modelos gratuitos disponíveis sem chave) copilot GitHub Copilot (OAuth nativo, gratuito) ollama Servidor local Ollama custom-openai Endpoint compatível com OpenAI personalizado
ru: lokit — Localization Kit: перевод с поддержкой ИИ для множества форматов. Поддерживаемые типы проектов (автоматически определяются или настраиваются через lokit.yaml): gettext Плоские (po/*.po) и вложенные (po/lang/*.po) PO-файлы po4a Перевод документации (мануалы, разметка groff/roff) i18next JSON-файлы переводов для React/i18next android Ресурсные файлы Android strings.xml json Универсальные JSON-файлы переводов (рецепты, блоги) yaml YAML-файлы переводов markdown Перевод документов Markdown properties Файлы переводов Java .properties flutter Файлы Flutter ARB (Application Resource Bundle) Конфигурация: Настройки проекта задаются в lokit.yaml в корне проекта. Каждый проект может иметь несколько целей перевода с разными типами. См. примеры проектов для формата lokit.yaml. Провайдеры ИИ: google Google AI (Gemini) — API-ключ gemini Gemini Code Assist — OAuth через браузер (бесплатно) groq Groq — требуется API-ключ opencode OpenCode Zen API (доступны бесплатные модели без ключа) copilot GitHub Copilot (нативный OAuth, бесплатно) ollama Локальный сервер Ollama custom-openai Пользовательский OpenAI-совместимый эндпоинт
tr: lokit — Localization Kit: AI destekli, birden fazla format için çeviri. Desteklenen proje türleri (otomatik algılanır veya lokit.yaml ile yapılandırılır): gettext Düz (po/*.po) ve iç içe (po/lang/*.po) PO dosyaları po4a Dokümantasyon çevirisi (man sayfaları, groff/roff işaretleme) i18next React/i18next JSON çeviri dosyaları android Android strings.xml kaynak dosyaları json Genel JSON çeviri dosyaları (tarifler, blog yazıları) yaml YAML çeviri dosyaları markdown Markdown doküman çevirisi properties Java .properties çeviri dosyaları flutter Flutter ARB (Application Resource Bundle) dosyaları Yapılandırma: Proje ayarları, proje kök dizinindeki lokit.yaml dosyasında tanımlanır. Her proje, farklı türlerde birden fazla çeviri hedefi içerebilir. lokit.yaml formatı için proje örneklerine bakın. AI Sağlayıcıları: google Google AI (Gemini) — API anahtarı gemini Gemini Code Assist — tarayıcı OAuth (ücretsiz) groq Groq — API anahtarı gerekli opencode OpenCode Zen API (anahtarsız ücretsiz modeller mevcut) copilot GitHub Copilot (yerel OAuth, ücretsiz) ollama Ollama yerel sunucu custom-openai Özel OpenAI uyumlu uç nokta
uk: lokit — Localization Kit: AI-переклад для багатьох форматів. Підтримувані типи проєктів (автовизначення або налаштування через lokit.yaml): gettext Плоскі (po/*.po) та вкладені (po/lang/*.po) PO-файли po4a Переклад документації (man-сторінки, розмітка groff/roff) i18next JSON-файли перекладу для React/i18next android Файли ресурсів Android strings.xml json Загальні JSON-файли перекладу (рецепти, блоги) yaml YAML-файли перекладу markdown Переклад документів Markdown properties Файли перекладу Java .properties flutter Файли Flutter ARB (Application Resource Bundle) Конфігурація: Налаштування проєкту визначаються у lokit.yaml у кореневій папці проєкту. Кожен проєкт може мати кілька цільових форматів перекладу. Дивіться приклади проєктів для формату lokit.yaml. AI-постачальники: google Google AI (Gemini) — API-ключ gemini Gemini Code Assist — OAuth у браузері (безкоштовно) groq Groq — потрібен API-ключ opencode OpenCode Zen API (безкоштовні моделі доступні без ключа) copilot GitHub Copilot (вбудований OAuth, безкоштовно) ollama Локальний сервер Ollama custom-openai Користувацький сумісний з OpenAI кінцевий пункт

source: No provider specified. Use --provider to choose an AI translation service.
ar: لم يتم تحديد مزود خدمة. استخدم --provider لاختيار خدمة ترجمة بالذكاء الاصطناعي.
de: Kein Provider angegeben. Verwenden Sie --provider, um einen KI-Übersetzungsdienst auszuwählen.
es: No se especificó proveedor. Usa --provider para elegir un servicio de traducción IA.
fr: Aucun fournisseur spécifié. Utilisez --provider pour choisir un service de traduction IA.
it: Nessun provider specificato. Usa --provider per scegliere un servizio di traduzione AI.
ja: プロバイダーが指定されていません。--provider で AI 翻訳サービスを選択してください。
pl: Nie określono dostawcy. Użyj --provider, aby wybrać usługę tłumaczenia AI.
pt_br: Nenhum provedor especificado. Use --provider para escolher um serviço de tradução por IA.
ru: Провайдер не указан. Используйте --provider для выбора сервиса AI-перевода.
tr: Sağlayıcı belirtilmedi. Bir yapay zekâ çeviri servisi seçmek için --provider kullanın.
uk: Провайдер не вказаний. Використайте --provider для вибору AI-сервісу перекладу.

source: No targets defined in lokit.yaml
ar: لا توجد أهداف معرفة في lokit.yaml
de: Keine Ziele in lokit.yaml definiert
es: No hay targets definidos en lokit.yaml
fr: Aucune cible définie dans lokit.yaml
it: Nessun target definito in lokit.yaml
ja: lokit.yamlにターゲットが定義されていません
pl: Brak zdefiniowanych celów w lokit.yaml
pt_br: Nenhum alvo definido no lokit.yaml
ru: В lokit.yaml не указаны цели перевода
tr: lokit.yaml içinde hedef tanımlanmamış
uk: У lokit.yaml не визначено жодних цілей

source: Could not load lock file: %v
ar: تعذر تحميل ملف القفل: %v
de: Lock-Datei konnte nicht geladen werden: %v
es: No se pudo cargar el archivo de bloqueo: %v
fr: Impossible de charger le fichier de verrouillage : %v
it: Impossibile caricare il file di lock: %v
ja: ロックファイルを読み込めませんでした: %v
pl: Nie można załadować pliku blokady: %v
pt_br: Não foi possível carregar o arquivo de bloqueio: %v
ru: Не удалось загрузить файл блокировки: %v
tr: Kilit dosyası yüklenemedi: %v
uk: Не вдалося завантажити файл блокування: %v

source: Interrupted, saving progress...
ar: تم الإيقاف، جاري حفظ التقدم...
de: Unterbrochen, Fortschritt wird gespeichert...
es: Interrumpido, guardando el progreso...
fr: Interrompu, sauvegarde de la progression...
it: Interrotto, salvataggio in corso...
ja: 中断されました。進捗を保存しています...
pl: Przerwano, zapisywanie postępu...
pt_br: Interrompido, salvando progresso...
ru: Операция прервана, сохраняем прогресс...
tr: İşlem kesildi, ilerleme kaydediliyor...
uk: Перервано, зберігаю прогрес...

source: [%s] No languages to translate, skipping
ar: [%s] لا توجد لغات للترجمة، سيتم التخطي
de: [%s] Keine Sprachen zum Übersetzen, überspringe
es: [%s] No hay idiomas para traducir, omitiendo
fr: [%s] Aucune langue à traduire, passage
it: [%s] Nessuna lingua da tradurre, salto
ja: [%s] 翻訳対象の言語がありません。スキップします
pl: [%s] Brak języków do tłumaczenia, pomijam
pt_br: [%s] Nenhum idioma para traduzir, pulando
ru: [%s] Нет языков для перевода, пропускаем
tr: [%s] Çevrilecek dil yok, atlanıyor
uk: [%s] Немає мов для перекладу, пропускаю

source: [%s] Unknown target type %q, skipping
ar: [%s] نوع الهدف غير معروف %q، سيتم التخطي
de: [%s] Unbekannter Zieltyp %q, überspringe
es: [%s] Tipo de objetivo desconocido %q, omitiendo
fr: [%s] Type de cible inconnu %q, passage
it: [%s] Tipo di target sconosciuto %q, salto
ja: [%s] 不明なターゲットタイプ %q のためスキップします
pl: [%s] Nieznany typ celu %q, pomijam
pt_br: [%s] Tipo de destino desconhecido %q, pulando
ru: [%s] Неизвестный тип цели %q, пропускаем
tr: [%s] Bilinmeyen hedef türü %q, atlanıyor
uk: [%s] Невідомий тип цілі %q, пропускаю

source: Could not save lock file: %v
ar: تعذر حفظ ملف القفل: %v
de: Lock-Datei konnte nicht gespeichert werden: %v
es: No se pudo guardar el archivo de bloqueo: %v
fr: Impossible d'enregistrer le fichier de verrouillage : %v
it: Impossibile salvare il file di lock: %v
ja: ロックファイルを保存できませんでした: %v
pl: Nie można zapisać pliku blokady: %v
pt_br: Não foi possível salvar o arquivo de bloqueio: %v
ru: Не удалось сохранить файл блокировки: %v
tr: Kilit dosyası kaydedilemedi: %v
uk: Не вдалося зберегти файл блокування: %v

source: Translation completed with errors
ar: اكتملت الترجمة مع وجود أخطاء
de: Übersetzung abgeschlossen mit Fehlern
es: Traducción completada con errores
fr: Traduction terminée avec des erreurs
it: Traduzione completata con errori
ja: エラー付きで翻訳が完了しました
pl: Tłumaczenie zakończone z błędami
pt_br: Tradução concluída com erros
ru: Перевод завершён с ошибками
tr: Çeviri hatalarla tamamlandı
uk: Переклад завершено з помилками

source: All targets translated!
ar: تمت ترجمة جميع الأهداف!
de: Alle Ziele übersetzt!
es: ¡Todos los objetivos traducidos!
fr: Toutes les cibles ont été traduites !
it: Tutti i target tradotti!
ja: すべてのターゲットが翻訳されました！
pl: Wszystkie cele przetłumaczone!
pt_br: Todos os destinos traduzidos!
ru: Все цели переведены!
tr: Tüm hedefler çevrildi!
uk: Усі цілі перекладено!

source: Extracting strings and updating PO files...
ar: جارٍ استخراج السلاسل وتحديث ملفات PO...
de: Strings werden extrahiert und PO-Dateien aktualisiert...
es: Extrayendo cadenas y actualizando archivos PO...
fr: Extraction des chaînes et mise à jour des fichiers PO...
it: Estrazione delle stringhe e aggiornamento dei file PO...
ja: 文字列を抽出し、POファイルを更新しています...
pl: Ekstrahowanie ciągów i aktualizowanie plików PO...
pt_br: Extraindo strings e atualizando arquivos PO...
ru: Извлечение строк и обновление файлов PO...
tr: Dizeler çıkarılıyor ve PO dosyaları güncelleniyor...
uk: Витягаємо рядки та оновлюємо PO-файли...

source: Extraction failed: %v
ar: فشل الاستخراج: %v
de: Extraktion fehlgeschlagen: %v
es: Extracción fallida: %v
fr: Échec de l'extraction : %v
it: Estrazione non riuscita: %v
ja: 抽出に失敗しました: %v
pl: Błąd ekstrakcji: %v
pt_br: Falha na extração: %v
ru: Ошибка извлечения: %v
tr: Çıkarma işlemi başarısız: %v
uk: Помилка під час витягання: %v

source: Continuing with existing PO files
ar: المتابعة باستخدام ملفات PO الحالية
de: Fortfahren mit bestehenden PO-Dateien
es: Continuando con los archivos PO existentes
fr: Poursuite avec les fichiers PO existants
it: Si continua con i file PO esistenti
ja: 既存のPOファイルで続行します
pl: Kontynuowanie pracy z istniejącymi plikami PO
pt_br: Continuando com os arquivos PO existentes
ru: Продолжаем работу с существующими файлами PO
tr: Mevcut PO dosyalarıyla devam ediliyor
uk: Продовжуємо з наявними PO-файлами

source: Provider: %s (%s), Model: %s
ar: المزود: %s (%s)، النموذج: %s
de: Provider: %s (%s), Modell: %s
es: Proveedor: %s (%s), Modelo: %s
fr: Fournisseur : %s (%s), Modèle : %s
it: Provider: %s (%s), Modello: %s
ja: プロバイダー: %s（%s）、モデル: %s
pl: Dostawca: %s (%s), Model: %s
pt_br: Provedor: %s (%s), Modelo: %s
ru: Провайдер: %s (%s), Модель: %s
tr: Sağlayıcı: %s (%s), Model: %s
uk: Провайдер: %s (%s), Модель: %s

source: Parallel: enabled, max concurrent: %d
ar: المعالجة المتوازية: مفعلة، الحد الأقصى للمهام المتزامنة: %d
de: Parallel: aktiviert, max. gleichzeitig: %d
es: Paralelo: habilitado, máximo concurrentes: %d
fr: Parallélisme : activé, max simultanés : %d
it: Parallelo: abilitato, massimo concorrenti: %d
ja: 並列処理: 有効、最大同時実行数: %d
pl: Przetwarzanie równoległe: włączone, maks. jednoczesnych: %d
pt_br: Paralelo: ativado, máximo de concorrentes: %d
ru: Параллельная обработка: включена, максимум одновременных: %d
tr: Paralel: etkin, maksimum eşzamanlı: %d
uk: Паралельно: увімкнено, макс. одночасно: %d

source: Chunk size: %d
ar: حجم الجزء: %d
de: Chunk-Größe: %d
es: Tamaño de bloque: %d
fr: Taille du lot : %d
it: Dimensione chunk: %d
ja: チャンクサイズ: %d
pl: Rozmiar fragmentu: %d
pt_br: Tamanho do bloco: %d
ru: Размер чанка: %d
tr: Parça boyutu: %d
uk: Розмір блоку: %d

source: PO dir: %s
ar: مجلد PO: %s
de: PO-Verzeichnis: %s
es: Directorio PO: %s
fr: Dossier PO : %s
it: Dir PO: %s
ja: PO ディレクトリ: %s
pl: Katalog PO: %s
pt_br: Diretório PO: %s
ru: Каталог PO: %s
tr: PO dizini: %s
uk: PO директорія: %s

source: Translating: %s
ar: جاري الترجمة: %s
de: Übersetze: %s
es: Traduciendo: %s
fr: Traduction : %s
it: Traduzione in corso: %s
ja: 翻訳中: %s
pl: Tłumaczenie: %s
pt_br: Traduzindo: %s
ru: Перевод: %s
tr: Çevriliyor: %s
uk: Переклад: %s

source: %s (%s): %d strings to translate
ar: %s (%s): %d سلسلة للترجمة
de: %s (%s): %d zu übersetzende Strings
es: %s (%s): %d cadenas por traducir
fr: %s (%s) : %d chaînes à traduire
it: %s (%s): %d stringhe da tradurre
ja: %s（%s）: 翻訳対象 %d 件
pl: %s (%s): %d ciągów do tłumaczenia
pt_br: %s (%s): %d strings para traduzir
ru: %s (%s): %d строк для перевода
tr: %s (%s): Çevrilecek %d ifade
uk: %s (%s): %d рядків для перекладу

source: %s: PO file not found, will be created
ar: %s: ملف PO غير موجود، سيتم إنشاؤه
de: %s: PO-Datei nicht gefunden, wird erstellt
es: %s: archivo PO no encontrado, se creará
fr: %s : fichier PO non trouvé, il sera créé
it: %s: file PO non trovato, verrà creato
ja: %s: PO ファイルが見つかりません。新規作成します
pl: %s: plik PO nie znaleziony, zostanie utworzony
pt_br: %s: arquivo PO não encontrado, será criado
ru: %s: PO-файл не найден, будет создан
tr: %s: PO dosyası bulunamadı, oluşturulacak
uk: %s: PO-файл не знайдено, буде створено

source: [%s] All translations complete!
ar: [%s] جميع الترجمات اكتملت!
de: [%s] Alle Übersetzungen abgeschlossen!
es: [%s] ¡Todas las traducciones completadas!
fr: [%s] Toutes les traductions sont terminées !
it: [%s] Tutte le traduzioni completate!
ja: [%s] すべての翻訳が完了しました！
pl: [%s] Wszystkie tłumaczenia ukończone!
pt_br: [%s] Todas as traduções concluídas!
ru: [%s] Все переводы завершены!
tr: [%s] Tüm çeviriler tamamlandı!
uk: [%s] Усі переклади завершено!

source: default
ar: افتراضي
de: Standard
es: predeterminado
fr: par défaut
it: predefinito
ja: デフォルト
pl: domyślnie
pt_br: padrão
ru: по умолчанию
tr: varsayılan
uk: типово

source: po4a config: %s
ar: إعدادات po4a: %s
de: po4a-Konfiguration: %s
es: configuración po4a: %s
fr: Configuration po4a : %s
it: Configurazione po4a: %s
ja: po4a 設定: %s
pl: Konfiguracja po4a: %s
pt_br: Configuração do po4a: %s
ru: Конфигурация po4a: %s
tr: po4a yapılandırması: %s
uk: po4a конфіг: %s
