Repository: minios-linux/lokit
Catalog: po/*.po
Languages: ar, de, es, fr, it, ja, pl, pt_br, ru, tr, uk

source: AI provider (required): google, gemini, groq, opencode, copilot, ollama, custom-openai
ar: مزود الذكاء الاصطناعي (إجباري): google، gemini، groq، opencode، copilot، ollama، custom-openai
de: KI-Anbieter (erforderlich): google, gemini, groq, opencode, copilot, ollama, custom-openai
es: Proveedor de IA (obligatorio): google, gemini, groq, opencode, copilot, ollama, custom-openai
fr: Fournisseur IA (obligatoire) : google, gemini, groq, opencode, copilot, ollama, custom-openai
it: Provider AI (obbligatorio): google, gemini, groq, opencode, copilot, ollama, custom-openai
ja: AIプロバイダー（必須）: google, gemini, groq, opencode, copilot, ollama, custom-openai
pl: Dostawca AI (wymagane): google, gemini, groq, opencode, copilot, ollama, custom-openai
pt_br: Provedor de IA (obrigatório): google, gemini, groq, opencode, copilot, ollama, custom-openai
ru: Провайдер ИИ (обязательно): google, gemini, groq, opencode, copilot, ollama, custom-openai
tr: Yapay zeka sağlayıcısı (zorunlu): google, gemini, groq, opencode, copilot, ollama, custom-openai
uk: AI-провайдер (обов'язково): google, gemini, groq, opencode, copilot, ollama, custom-openai

source: Model name (required)
ar: اسم النموذج (إجباري)
de: Modellname (erforderlich)
es: Nombre del modelo (obligatorio)
fr: Nom du modèle (obligatoire)
it: Nome modello (obbligatorio)
ja: モデル名（必須）
pl: Nazwa modelu (wymagana)
pt_br: Nome do modelo (obrigatório)
ru: Название модели (обязательно)
tr: Model adı (zorunlu)
uk: Назва моделі (обов'язково)

source: API key (or provider env var: GOOGLE_API_KEY, GROQ_API_KEY, OPENAI_API_KEY, OPENCODE_API_KEY)
ar: مفتاح API (أو متغير بيئة المزود: GOOGLE_API_KEY، GROQ_API_KEY، OPENAI_API_KEY، OPENCODE_API_KEY)
de: API-Schlüssel (oder Provider-Umgebungsvariable: GOOGLE_API_KEY, GROQ_API_KEY, OPENAI_API_KEY, OPENCODE_API_KEY)
es: Clave API (o variable de entorno del proveedor: GOOGLE_API_KEY, GROQ_API_KEY, OPENAI_API_KEY, OPENCODE_API_KEY)
fr: Clé API (ou variable d'environnement du fournisseur : GOOGLE_API_KEY, GROQ_API_KEY, OPENAI_API_KEY, OPENCODE_API_KEY)
it: Chiave API (o variabile d'ambiente del provider: GOOGLE_API_KEY, GROQ_API_KEY, OPENAI_API_KEY, OPENCODE_API_KEY)
ja: APIキー（またはプロバイダー環境変数: GOOGLE_API_KEY, GROQ_API_KEY, OPENAI_API_KEY, OPENCODE_API_KEY）
pl: Klucz API (lub zmienna środowiskowa dostawcy: GOOGLE_API_KEY, GROQ_API_KEY, OPENAI_API_KEY, OPENCODE_API_KEY)
pt_br: Chave de API (ou variável de ambiente do provedor: GOOGLE_API_KEY, GROQ_API_KEY, OPENAI_API_KEY, OPENCODE_API_KEY)
ru: API-ключ (или переменная окружения провайдера: GOOGLE_API_KEY, GROQ_API_KEY, OPENAI_API_KEY, OPENCODE_API_KEY)
tr: API anahtarı (veya sağlayıcı ortam değişkeni: GOOGLE_API_KEY, GROQ_API_KEY, OPENAI_API_KEY, OPENCODE_API_KEY)
uk: API-ключ (або змінна середовища провайдера: GOOGLE_API_KEY, GROQ_API_KEY, OPENAI_API_KEY, OPENCODE_API_KEY)

source: Custom API base URL
ar: عنوان URL الأساسي لمزود API مخصص
de: Benutzerdefinierte API-Basis-URL
es: URL base de API personalizada
fr: URL de base API personnalisée
it: URL base API personalizzato
ja: カスタムAPIベースURL
pl: Własny bazowy URL API
pt_br: URL base da API personalizada
ru: Пользовательский базовый URL API
tr: Özel API taban URL'si
uk: Користувацький базовий URL API

source: Languages to translate (comma-separated, default: all with untranslated)
ar: اللغات المطلوب ترجمتها (مفصولة بفواصل، الافتراضي: جميع غير المترجمة)
de: Zu übersetzende Sprachen (kommagetrennt, Standard: alle mit nicht übersetzten Einträgen)
es: Idiomas a traducir (separados por coma, predeterminado: todos los no traducidos)
fr: Langues à traduire (séparées par des virgules, défaut : toutes non traduites)
it: Lingue da tradurre (separate da virgola, predefinito: tutte con non tradotte)
ja: 翻訳対象言語（カンマ区切り、デフォルト: 未翻訳を含む全言語）
pl: Języki do tłumaczenia (oddzielone przecinkami, domyślnie: wszystkie nieprzetłumaczone)
pt_br: Idiomas para traduzir (separados por vírgula, padrão: todos não traduzidos)
ru: Языки для перевода (через запятую, по умолчанию: все непереведённые)
tr: Çevrilecek diller (virgülle ayrılmış, varsayılan: çevrilmemişlerin tümü)
uk: Мови для перекладу (через кому, за замовчуванням: всі з неперекладеними)

source: Entries per API request (0 = all at once)
ar: عدد الإدخالات لكل طلب API (0 = الكل دفعة واحدة)
de: Einträge pro API-Anfrage (0 = alle auf einmal)
es: Entradas por solicitud a la API (0 = todas de una vez)
fr: Entrées par requête API (0 = tout d'un coup)
it: Voci per richiesta API (0 = tutte insieme)
ja: 1リクエストあたりのエントリー数（0=一括）
pl: Liczba wpisów na żądanie API (0 = wszystko naraz)
pt_br: Entradas por requisição à API (0 = tudo de uma vez)
ru: Количество записей на запрос к API (0 = все сразу)
tr: API isteği başına giriş sayısı (0 = hepsi bir defada)
uk: Кількість записів на запит до API (0 = всі одразу)

source: Re-translate already translated entries
ar: إعادة ترجمة الإدخالات المترجمة مسبقًا
de: Bereits übersetzte Einträge erneut übersetzen
es: Retraducir entradas ya traducidas
fr: Retraduire les entrées déjà traduites
it: Ritraduci le voci già tradotte
ja: 既に翻訳済みのエントリーも再翻訳
pl: Przetłumacz ponownie już przetłumaczone wpisy
pt_br: Retraduzir entradas já traduzidas
ru: Перевести уже переведённые записи
tr: Zaten çevrilmiş girdileri tekrar çevir
uk: Повторно перекладати вже перекладені записи

source: Translate fuzzy entries and clear fuzzy flag
ar: ترجمة الإدخالات الغامضة ومسح علامة الغموض
de: Fuzzy-Einträge übersetzen und Fuzzy-Flag entfernen
es: Traducir entradas marcadas como fuzzy y limpiar la bandera fuzzy
fr: Traduire les entrées floues et effacer le drapeau fuzzy
it: Traduci le voci fuzzy e rimuovi il flag fuzzy
ja: fuzzyエントリーも翻訳し、fuzzyフラグをクリア
pl: Tłumacz wpisy oznaczone jako fuzzy i usuń flagę fuzzy
pt_br: Traduzir entradas fuzzy e limpar o flag fuzzy
ru: Перевести нечеткие записи и снять флаг fuzzy
tr: Fuzzy (belirsiz) girdileri çevir ve fuzzy bayrağını kaldır
uk: Перекладати fuzzy-записи та прибирати прапор fuzzy

source: Custom system prompt (use {{targetLang}} placeholder)
ar: مطالبة نظام مخصصة (استخدم {{targetLang}} كمكان مخصص)
de: Benutzerdefiniertes System-Prompt (nutze {{targetLang}} als Platzhalter)
es: Prompt de sistema personalizado (usa el marcador {{targetLang}})
fr: Prompt système personnalisé (utiliser le placeholder {{targetLang}})
it: Prompt di sistema personalizzato (usa il segnaposto {{targetLang}})
ja: カスタムシステムプロンプト（{{targetLang}}プレースホルダー使用可）
pl: Własny prompt systemowy (użyj placeholdera {{targetLang}})
pt_br: Prompt do sistema personalizado (use o placeholder {{targetLang}})
ru: Пользовательский системный промпт (используйте плейсхолдер {{targetLang}})
tr: Özel sistem istemi ({{targetLang}} yer tutucusunu kullanın)
uk: Користувацький системний промпт (використовуйте плейсхолдер {{targetLang}})

source: Enable detailed logging
ar: تفعيل السجل التفصيلي
de: Detailliertes Logging aktivieren
es: Activar registro detallado
fr: Activer la journalisation détaillée
it: Abilita log dettagliato
ja: 詳細ログを有効化
pl: Włącz szczegółowe logowanie
pt_br: Ativar log detalhado
ru: Включить подробное логирование
tr: Ayrıntılı loglamayı etkinleştir
uk: Увімкнути детальне логування

source: Show what would be translated without calling AI
ar: عرض ما سيتم ترجمته دون الاتصال بالذكاء الاصطناعي
de: Anzeigen, was übersetzt würde, ohne KI-Aufruf
es: Mostrar lo que se traduciría sin llamar a la IA
fr: Afficher ce qui serait traduit sans appeler l'IA
it: Mostra cosa verrebbe tradotto senza chiamare l'AI
ja: AIを呼び出さずに翻訳予定内容を表示
pl: Pokaż co byłoby tłumaczone bez wywoływania AI
pt_br: Mostrar o que seria traduzido sem acionar a IA
ru: Показать, что будет переведено, без обращения к ИИ
tr: AI çağrısı yapmadan hangi metinlerin çevrileceğini göster
uk: Показати, що буде перекладено, без звернення до AI

source: Ignore lock file and re-translate all changed entries
ar: تجاهل ملف القفل وإعادة ترجمة جميع الإدخالات المعدلة
de: Lock-Datei ignorieren und alle geänderten Einträge neu übersetzen
es: Ignorar el archivo de bloqueo y volver a traducir todas las entradas modificadas
fr: Ignorer le fichier de verrouillage et retraduire toutes les entrées modifiées
it: Ignora il file di lock e ritraduci tutte le voci modificate
ja: ロックファイルを無視して、変更されたすべてのエントリを再翻訳
pl: Ignoruj plik blokady i przetłumacz wszystkie zmienione wpisy
pt_br: Ignore o arquivo de bloqueio e retraduz todas as entradas alteradas
ru: Игнорировать файл блокировки и перевести все изменённые записи заново
tr: Kilit dosyasını yok say ve tüm değişen girişleri yeniden çevir
uk: Ігнорувати файл блокування та повторно перекласти всі змінені записи

source: Enable parallel translation
ar: تفعيل الترجمة المتوازية
de: Parallele Übersetzung aktivieren
es: Habilitar traducción en paralelo
fr: Activer la traduction en parallèle
it: Abilita traduzione parallela
ja: 並列翻訳を有効化
pl: Włącz tłumaczenie równoległe
pt_br: Ativar tradução em paralelo
ru: Включить параллельный перевод
tr: Paralel çeviriyi etkinleştir
uk: Увімкнути паралельний переклад

source: Maximum concurrent tasks (with --parallel)
ar: الحد الأقصى للمهام المتزامنة (مع --parallel)
de: Maximale gleichzeitige Aufgaben (mit --parallel)
es: Máximo de tareas concurrentes (con --parallel)
fr: Nombre maximal de tâches simultanées (avec --parallel)
it: Numero massimo di task concorrenti (con --parallel)
ja: 最大同時タスク数（--parallel使用時）
pl: Maksymalna liczba równoczesnych zadań (z --parallel)
pt_br: Máximo de tarefas simultâneas (com --parallel)
ru: Максимальное количество одновременных задач (с --parallel)
tr: Maksimum eşzamanlı görev sayısı (--parallel ile)
uk: Максимальна кількість одночасних задач (з --parallel)

source: Delay between parallel tasks
ar: الفاصل الزمني بين المهام المتوازية
de: Verzögerung zwischen parallelen Aufgaben
es: Retraso entre tareas paralelas
fr: Délai entre les tâches parallèles
it: Ritardo tra i task paralleli
ja: 並列タスク間の遅延
pl: Opóźnienie między równoległymi zadaniami
pt_br: Intervalo entre tarefas paralelas
ru: Задержка между параллельными задачами
tr: Paralel görevler arası gecikme
uk: Затримка між паралельними задачами

source: Request timeout (0 = provider default)
ar: مهلة الطلب (0 = الافتراضي للمزود)
de: Anfrage-Timeout (0 = Standardwert des Anbieters)
es: Tiempo de espera de la solicitud (0 = valor predeterminado del proveedor)
fr: Délai d'expiration de la requête (0 = valeur par défaut du fournisseur)
it: Timeout richiesta (0 = predefinito provider)
ja: リクエストタイムアウト（0=プロバイダーのデフォルト）
pl: Limit czasu żądania (0 = domyślny u dostawcy)
pt_br: Timeout da requisição (0 = padrão do provedor)
ru: Таймаут запроса (0 = значение по умолчанию провайдера)
tr: İstek zaman aşımı (0 = sağlayıcı varsayılanı)
uk: Таймаут запиту (0 = стандартний для провайдера)

source: HTTP/HTTPS proxy URL
ar: عنوان URL لوكيل HTTP/HTTPS
es: URL de proxy HTTP/HTTPS
fr: URL du proxy HTTP/HTTPS
it: URL proxy HTTP/HTTPS
ja: HTTP/HTTPSプロキシURL
pl: URL proxy HTTP/HTTPS
pt_br: URL do proxy HTTP/HTTPS
ru: URL HTTP/HTTPS прокси
tr: HTTP/HTTPS proxy URL'si
uk: URL HTTP/HTTPS проксі

source: Maximum retries on rate limit (429)
ar: الحد الأقصى لعدد المحاولات عند تجاوز الحد (429)
de: Maximale Wiederholungen bei Rate-Limit (429)
es: Máximos reintentos por límite de tasa (429)
fr: Nombre maximal de tentatives sur limitation de débit (429)
it: Numero massimo di tentativi su rate limit (429)
ja: レート制限（429）時の最大リトライ回数
pl: Maksymalna liczba ponowień przy limicie zapytań (429)
pt_br: Máximo de tentativas em caso de rate limit (429)
ru: Максимальное количество попыток при ограничении по скорости (429)
tr: Oran limiti (429) için maksimum tekrar deneme
uk: Максимальна кількість повторів при обмеженні швидкості (429)

source: Google AI (Gemini) — API key required
ar: Google AI (Gemini) — يتطلب مفتاح API
de: Google AI (Gemini) — API-Schlüssel erforderlich
es: Google AI (Gemini) — requiere clave API
fr: Google AI (Gemini) — clé API requise
it: Google AI (Gemini) — chiave API richiesta
ja: Google AI（Gemini） — APIキー必須
pl: Google AI (Gemini) — wymagany klucz API
pt_br: Google AI (Gemini) — chave de API obrigatória
ru: Google AI (Gemini) — требуется API-ключ
tr: Google AI (Gemini) — API anahtarı gerekli
uk: Google AI (Gemini) — потрібен API-ключ

source: Gemini Code Assist — browser OAuth (free)
ar: Gemini Code Assist — مصادقة عبر المتصفح (مجاني)
de: Gemini Code Assist — Browser-OAuth (kostenlos)
es: Gemini Code Assist — OAuth en navegador (gratis)
fr: Gemini Code Assist — OAuth navigateur (gratuit)
it: Gemini Code Assist — OAuth browser (gratis)
ja: Gemini Code Assist — ブラウザOAuth（無料）
pl: Gemini Code Assist — OAuth w przeglądarce (darmowe)
pt_br: Gemini Code Assist — OAuth via navegador (gratuito)
ru: Gemini Code Assist — OAuth через браузер (бесплатно)
tr: Gemini Code Assist — tarayıcı OAuth (ücretsiz)
uk: Gemini Code Assist — браузерний OAuth (безкоштовно)

source: Groq — API key required
ar: Groq — يتطلب مفتاح API
de: Groq — API-Schlüssel erforderlich
es: Groq — requiere clave API
fr: Groq — clé API requise
it: Groq — chiave API richiesta
ja: Groq — APIキー必須
pl: Groq — wymagany klucz API
pt_br: Groq — chave de API obrigatória
ru: Groq — требуется API-ключ
tr: Groq — API anahtarı gerekli
uk: Groq — потрібен API-ключ

source: OpenCode — optional API key
ar: OpenCode — مفتاح API اختياري
de: OpenCode — API-Schlüssel optional
es: OpenCode — clave API opcional
fr: OpenCode — clé API optionnelle
it: OpenCode — chiave API opzionale
ja: OpenCode — APIキーは任意
pl: OpenCode — opcjonalny klucz API
pt_br: OpenCode — chave de API opcional
ru: OpenCode — API-ключ необязателен
tr: OpenCode — isteğe bağlı API anahtarı
uk: OpenCode — API-ключ необов'язковий

source: GitHub Copilot — native OAuth (free)
ar: GitHub Copilot — مصادقة أصلية (مجاني)
de: GitHub Copilot — native OAuth (kostenlos)
es: GitHub Copilot — OAuth nativo (gratis)
fr: GitHub Copilot — OAuth natif (gratuit)
it: GitHub Copilot — OAuth nativo (gratis)
ja: GitHub Copilot — ネイティブOAuth（無料）
pl: GitHub Copilot — natywny OAuth (darmowe)
pt_br: GitHub Copilot — OAuth nativo (gratuito)
ru: GitHub Copilot — нативный OAuth (бесплатно)
tr: GitHub Copilot — yerel OAuth (ücretsiz)
uk: GitHub Copilot — нативний OAuth (безкоштовно)

source: Ollama local server
ar: خادم Ollama محلي
de: Ollama lokaler Server
es: Servidor local Ollama
fr: Serveur local Ollama
it: Server locale Ollama
ja: Ollamaローカルサーバー
pl: Lokalny serwer Ollama
pt_br: Servidor local Ollama
ru: Локальный сервер Ollama
tr: Ollama yerel sunucu
uk: Локальний сервер Ollama

source: Custom OpenAI-compatible endpoint
ar: نقطة نهاية متوافقة مع OpenAI مخصصة
de: Benutzerdefinierter OpenAI-kompatibler Endpunkt
es: Endpoint compatible con OpenAI personalizado
fr: Point de terminaison compatible OpenAI personnalisé
it: Endpoint compatibile OpenAI personalizzato
ja: OpenAI互換カスタムエンドポイント
pl: Własny endpoint kompatybilny z OpenAI
pt_br: Endpoint compatível com OpenAI personalizado
ru: Пользовательский OpenAI-совместимый endpoint
tr: OpenAI uyumlu özel uç nokta
uk: Користувацький endpoint сумісний з OpenAI

source: Localization Kit: AI-powered translation for multiple formats
ar: Localization Kit: ترجمة مدعومة بالذكاء الاصطناعي لعدة صيغ
de: Localization Kit: KI-gestützte Übersetzung für mehrere Formate
es: Localization Kit: traducción con IA para múltiples formatos
fr: Localization Kit : traduction par IA pour plusieurs formats
it: Localization Kit: traduzione AI per più formati
ja: Localization Kit: 複数フォーマット対応のAI翻訳
pl: Localization Kit: tłumaczenie wspierane AI dla wielu formatów
pt_br: Localization Kit: tradução com IA para múltiplos formatos
ru: Localization Kit: перевод на базе ИИ для различных форматов
tr: Localization Kit: Çoklu formatlar için yapay zekâ destekli çeviri
uk: Localization Kit: переклад на основі AI для різних форматів
